// ignore_for_file: constant_identifier_names

// The Descriptoin of foods

//////////////////////////////// -- Nuts List -- ////////////////////////////
////////////////////////////////////////////////////////////////////////////
const walnut_des =
    "تعد شجرة الجوز من أقدم الأشجار التي عرفها الإنسان، فقد شكلت جزءاً هاماً من حمية البشر لآلاف السنين، ويعد الجوز من المكسرات الغنية بالأحماض الدهنية المفيدة للجسم مثل أوميجا 3 وتحتوي على مضادات للأكسدة أكثر من أي طعام آخر، بالإضافة إلى كمية كبيرة من الفيتامينات والمعادن.";
const almond_des =
    "اللوز من الأغذية ذات القيمة الغذائية المرتفعة لإحتوائه على الألياف، والبروتينات، والدهون المفيدة، وفيتامين E، والكالسيوم، إضافة إلى كل من مضادات الأكسدة، وفيتامين ب2 وب3، والمغنيسيوم.";
const hazelnut_des =
    "إن تناول البندق يساعد على التقليل من نسبة الكولسترول السيء في الدم، وهذا بطبيعة الحال يؤدي للتقليل من فرص الإصابة بأمراض القلب، كما أن المحتوى العالي من الأحماض الدهنية، والألياف الغذائية، ومضادات الأكسدة، والبوتاسيوم، والمغنيسيوم في البندق يساعد في تنظيم ضغط الدم.";
const cashew_des =
    "يعد الكاجو من المصادر النباتية الغنية بالدهون الصحية، التي يساعد تناولها في الحفاظ على صحة الدماغ وقدرته على أداء الوظائف الإدراكية، والحفاظ على مزاج الأفراد، كما يحتوي الكاجو على بعض العناصر الهامة، مثل النحاس، والحديد، والزنك. والتي يؤدي نقصها إلى العديد من الاضطرابات النفسية مثل الاكتئاب، القلق، أو الخرف.";
const pistachio_des =
    "قد أثبتت الدراسات أن الفستق يساعد على التقليل من معدل الإصابة بأمراض القلب الخطيرة، وهذا لأنه يحتوي على نسبة عالية من مضادات الأكسدة التي تساعد على التقليل من نسبة الكوليسترول الضار بالدم ، فضلا على أنه يحسن من معدلات ضغط الدم وهذا بدوره يقلل من الأمراض القلبية.";
const peanut_des =
    "يساعد الفول السوداني في المحافظة على صحة القلب حيث أثبتت العديد من الدراسات أن تناول الفول السوداني وغيرها من المكسرات قد يساعد على التقليل من خطر الإصابة بأمراض القلب وذلك لأنه يحتوي على مجموعة من العناصر الغذائية كالمغنيسيوم وفيتامين ب3 وحمض الأولييك والنحاس والعديد من مضادات الأكسدة.";
const sunflowerPulp_des =
    "تحتوي البذور على نسبة عالية من فيتامين هـ (Vitamin E)، والذي يعد أحد مضادات الأكسدة الهامة التي تساعد على حماية وتحصين جهاز القلب والشرايين من المشكلات الصحية المختلفة، إذ يخفض من فرص حصول التهابات في جهاز الدوران، والتي قد تسبب بدورها الإصابة بأمراض القلب المختلفة.";
const whitePulp_des =
    "يساعد اللب الأبيض في تعزيز وتحفيز الجهاز المناعي للجسم بفضل مضادات الأكسدة التي يحتوي عليها كما يساعد على تنظيم نسبة السكر في الدم وتحفيز عمل الأنسولين. تساعد الألياف الموجودة في بذور اليقطين على خفض الكمية الإجمالية للكوليسترول في الدم وتقليل خطر الإصابة بأمراض القلب.";
const brownPulp_des =
    "يعتبر اللب السوبر من أفضل العناصر الطبيعية الكفيلة بتقوية بنية الجسم، بفضل احتوائه على نسبة مرتفعة جداً من البروتينات و يقوي الدم، ويمنع الإصابة بمرض الأنيميا؛ وذلك لأنّه يحتوي على نسبة مرتفعة من عنصر الحديد الذي يزيد منسوب الهيموغلوبين في الدم، وإنتاج كريات الدم الحمراء في الجسم.";

//////////////////////////// -- Meats List -- //////////////////////////
///////////////////////////////////////////////////////////////////////
const beef_des =
    "يساهم تناول لحم البقر في زيادة قوة جهاز المناعة، ممّا قد يؤدي إلى زيادة قدرة الجسم على مقاومة الأمراض، إضافةً إلى دوره في مساعدة أنسجة الجسم على الشفاء والالتئام بسرعة عند الإصابة بالجروح، ويعود ذلك بشكل رئيسي إلى احتوائه على الزنك الذي يساهم في توفير هذه الفوائد.";
const beefRaw_des =
    "يحتوي لحم البقر على كميات كبيرة من البروتين والأحماض الأمينية المهمين للحفاظ على الكتلة العضلية، لذا فإن تناول لحم البقر يساعد على تقليل خطر الإصابة بالضمور العضلي ، و قد يساهم تناول لحم البقر في تقليل خطر الإصابة بفقر الدم للأشخاص المعرضين له، وذلك بسبب احتوائه على كميات كبيرة من الحديد الذي يساهم بدوره في مساعدة الجسم على إنتاج الهيموغلوبين.";
const lamb_des =
    "يحتوى لحم الضأن على نسبة حديد تفوق غيرها من المصادر مثل الدجاج أو الأسماك، ونوعية الحديد هو العالي الجودة سريع الامتصاص، وبالتالى فإن تناول لحم الضأن باعتدال يساعد على الوقاية والعلاج من نقص الحديد وأعراض فقر الدم، خاصة إذا احتوى الغذاء على كميات كافية من فيتامين C الذى يساعد على امتصاص الحديد.";
const goat_des =
    "يصنف لحم الماعز ضمن فئة اللحوم الغنية بالعديد من العناصر الغذائية الضرورية للجسم، فهو يحتوي على نسب عالية من البوتاسيوم، والحديد، وفيتامين ب1، والفسفور، والنحاس، والسيلينيوم، والزنك، بالإضافة إلى فيتامين ب12، وفيتامين ب2 المعروف بالرايبوفلافين.";
const sheep_des =
    "يعد لحم الغنم من اللحوم الحمراء؛ وذلك لاحتوائه على مستويات عالية من الميوغلوبين وهو البروتين الموجود في الأنسجة العضلية لبعض الحيوانات كالأبقار، إذ يحول هذا البروتين لون اللحم إلى اللون الأحمر بمجرد تعرضه إلى الأكسجين، وبما أن الأغنام تعتمد في غذائها على الأعشاب؛ لذا فإن لحومها تعد مصدرًا غنيًا بالبروتين، وتتميز نكهة لحم الغنم بنكهة ترابية خفيفة مميزة عن اللحم البقري والدجاج خاصة عند الشواء.";
const camel_des =
    "يعد لحم الإبل مصدراً مهماً للبروتين الحيواني في العديد من الدول الآسيوية، والإفريقية، كما أن سهولة طهيه، ومضغه جعلته من اللحوم التي يفضل استهلاكها في هذه الدول، إلى جانب أن الدول العربية تفضل لحم الجمل بسبب توفره، وسعره، ولما يشيع حول امتلاكه فوائد صحية، وتختلف مكونات لحم الإبل بحسب نوع السلالة، والعمر، والجنس، وحالته الصحية، ومكان ذبحه.";
const bunny_des =
    "تعد لحوم الأرانب من المصادر المهمة للبروتين والتي يحتاجها جسم الإنسان ولا يوجد بها الكثير من الدهون، وقرابة (20)% من جسم الأرنب هو عظام وكل ما تبقى فهو لحم، وتحتوي لحوم الأرانب على الكثير من الفيتامينات مثل فيتامين B12 والمعادن مثل الحديد، والفسفور، والسيلينيوم، والصوديوم، بالإضافة إلى النياسين.";
const lanshon_des =
    "اللانشون هو أحد أنواع اللحوم المصنعة التي يشيع تناولها بين الناس، ويرتبط تناول لحوم اللانشون وغيرها من اللحوم المصنعة بالعديد من المشاكل الصحية والمخاطر، لكن ذلك يكون تحديدًا عند الإكثار من تناولها، أو تناولها بشكل دوري، أما في حال تناولها بكمية قليلة مرة أو مرتين في الشهر، فلن يسبب مخاطر على الصحة.";
const basterma_des =
    "تعرف البسطرمة على أنها لحم بقري تم تمليحه وتتبيله، وتعود هذه الأكلة في أصلها إلى المطبخين الأرمني والعثماني القديم، وهي كلمة ذات أصول تركية، وتعني اللحم المملح والمجفف. تشتهر البسطرمة في العديد من دول شرق البحر الأبيض المتوسط، ويمكن توظيفها في العديد من الأطباق الشهية واللذيذة.";
const salame_des =
    "السلامي هو سجق معالج يعود أصله إلى المطبخ الإيطالي. تم استخدام هذه النقانق في البداية من قبل الفلاحين الإيطاليين الذين صنعوا طريقة لتخمير هذا النوع من اللحوم التي يمكنهم استخدامها لمدة عام ، في حالة عدم الوصول إلى أي نوع من اللحوم لفترة أطول من الوقت. لذلك ، أخذ السلامي أصله من إيطاليا حيث لا يزال يعامل كعلامة مميزة للمطبخ الإيطالي و يتم استخدامه في أنواع مختلفة من البيتزا وغيرها من الوصفات.";
const sausage_des =
    "يعتبر السجق من الأكلات المنتشرة في كثير من المجتمعات سواء كانت عربية أو غير عربية، وهو عبارة عن كمية من اللحوم المبهرة المتبلة جيداً بالكثير من المواد مثل الفلفل والفلفل الأسمر والبصل والثوم والزنجبيل والقصعين وغيرها من التوابل وبعد ذلك يتم حشو هذه اللحوم المتبلة في الأمعاء الدقيقة للخروف أو العجل.";
const soses_des =
    "تحظى النقانق (هوت دوغ) بشعبية واسعة في العالم، ويحبها الكبار والصغار على حد سواء، لكن التسمية الغريبة والمقززة لهذا الطعام تثير كثيرا من الفضول والروايات التاريخية المتضاربة، وبحسب موقع كيورا، فإن المهاجرين الألمان الذين حلوا بالولايات المتحدة خلال القرن التاسع عشر، هم أصل هذا النوع من النقانق، وبما أن هذه النقانق تتخذ شكلا ممتلئا وطويلا، تقول إحدى الروايات إنها سميت بـهوت دوغ أي الكلب الساخن، بالنظر إلى شبهها بكلاب داشاند التي تتميز بأرجلها القصيرة.";
const kebda_des =
    "الكبد البقري هو كبد غني بالعناصر الغذائية وله العديد من الفوائد الصحية، بالإضافة إلى الفيتامينات الجيدة، فإن أكباد الحيوانات مثل كبد البقر غنية أيضًا بالمعادن،  بما في ذلك الزنك والحديد والفوسفور والسيلينيوم والنحاس.";
const dry_meat_des =
    "اللحم المقدد هو اللحم الذي يكون محفوظاً بواسطة التجفيف، وتتم عملية التجفيف إما عن طريق تعريضه لأشعة الشمس أو عن طريق تعريضه لنار الفحم، ويعد من العادات والتقاليد المغربية في أيام عيد الأضحى المبارك، ويعد من الأطباق المشهورة في الكثير من الشعوب، ولأنه يتميز بسرعة التحضير لهذا يتم تقديمه في جميع المناسبات أو الاحتفالات.";
const blobeef_des =
    'كشف موقع "health"، أن البلوبيف يحتوي على مادة النترات، والتي يتم استخدامها في حفظ اللحوم المجمدة، وهذه المادة تتفاعل مع البيض المُصنع منه البلوبيف، وتشكل العديد من الأضرار، أبرزها تهديد مرضى القلب والضغط والكبد  نتيجة الأملاح المرتفعة التي تؤدي للإصابة للكبد، كما يتسبب البلوبيف المصنع في ارتفاع ارتفاع الكوليسترول الضار بالدم ويؤدي إلى تصلب الشرايين، كما يؤثر البلوبيف على صحة الأطفال وتكون الديدان والطفيليات.';
const dehn_des =
    "إن شحم الخروف أو ما يسمى باللية وهو عبارة عن الشحوم والدهون الموجودة في جسم الخروف، والذي يتم إعداد الكثير من الوصفات المختلفة منه، ولكن معظم الناس يبتعدون عن تناوله ظناً منهم بأن له مخاطر على صحتهم، ولكن على العكس تماماً فقد أثبتت الدراسات الحديثة بأن لشحم الخروف العديد من الفوائد لجسم الإنسان مثل تعزيز قوة وصحة بعض الأعضاء الداخلية كالكبد والأمعاء ومعظم الأجهزة الحيوية الأخرى و إخراج السموم المتراكمة في الجسم والتي تنتج عن تناول الأغذية المهدرجة والمشبعة بالدهون.";

////////////////////////// -- Birds List --///////////////////////////
/////////////////////////////////////////////////////////////////////
const chickenChest_des =
    "يساعد تناول صدور الدجاج في بناء كتلة عضلية للجسم؛ وذلك لأنها تحتوي على مستويات مرتفعة من البروتين، بذلك فإن ممارسة التمارين الرياضية جنبًا إلى جنب مع تناول صدور الدجاج سيكون له أثر إيجابي على صحة عضلات الجسم، و تعد صدور الدجاج من الأطعمة منخفضة الكولسترول، وبالتالي تناولها يضمن الحصول على البروتين والقيم الغذائية المختلفة دون رفع مستويات الكوليسترول في الجسم.";
const chickenLegs_des =
    "تعد افخاد الدجاج مصدراً للفيتامينات الذائبة في الماء، بما في ذلك فيتامين ب12، وفيتامينات أخرى من مجموعة فيتامين ب، مثل: النياسين أو فيتامين ب3 ، وفيتامين ب6، وحمض البانتوثينيك أو فيتامين ب5، ومقارنةً باللحوم الحمراء فإن الدجاج يحتوي على كمية أقل من فيتامين ب12 والحديد، وكمية أعلى من فيتامين ب3، كما يُعد مصدراً جيداً للسيلينيوم، والنحاس، والزنك.";
const duck_des =
    "يعد محتوى لحم البط من البروتين أحد أهم جوانبه التغذوية وذلك بالإضافة إلى كونها من البروتينات عالية الجودة التي تحتوي على مختلف الأحماض الأمينية الأساسية وغير الأساسية، وقد أظهرت بعض الدراسات أن تناول البط أو غيره من البروتينات الحيوانية بالإضافة إلى تناول كميات كافية من الكالسيوم يمكن أن يحسن من قوة العظام وكثافتها.";
const geese_des =
    "لحم الإوز يعزز من قوة الجهاز المناعي لأنه يحتوى على عنصر الزنك الذى يقوي الجهاز المناعي لإحتوائه على مضادات للأكسدة كما أن الزنك يعمل على خلق أجسام مضادة لمحاربة الجذور الحرة التى تساعد فى علاج الأمراض المزمنة، و تناول لحم الإوز يعزز من نمو العضلات لإحتوائه على البروتين الذى يساعد فى بناء الأنسجة وإصلاح الأنسجة المصابة وتقوية العضلات وتحسين نشاطها.";
const pigeon_des =
    "يشتهر الحمام باحتوائه على مجموعة كبيرة جدًا من الفيتامينات والمعادن والمركبات المفيدة جدًا للجسم بقيمتها الغذائية العالية، ويحتوى أيضًا على العديد من العناصر المهمة جدًا للجسم مثل البروتين، الفسفور، الماغنسيوم، المنغنيز، البوتاسيوم، الحديد و يمكن للحمام أن يعزز القدرة الجنسية عند الرجال.";
const quail_des =
    "يتميز لحم طير السمان بقلة نسبة الدهون الموجودة فيه، مما يجعل منه مصدراً مثالياً للبروتين المنخفض الكولسترول، كما أنه من اللحوم التي تفيد في الوقاية من أمراض القلب المختلفة، يعرف هذا اللحم بأنه يحمل الصفة المرمرية، والتي يقصد بها وجود حبيبات من الدهن ضئيلة الحجم تتوزع ما بين ألياف نسيج هذا اللحم، وهذا مما يميز مذاق لحم السمان.";
const turkey_des =
    "يعد الديك الرومي بديلاً أكثر صحة من اللحوم الحمراء، تحديداً المشبعة بالدهون الضارة بالجسم؛ نظراً لاحتوائه على كميات كبيرة من العناصر الغذائية المختلفة، كالفيتامينات أبرزها فيتامين ب، والبروتينات، إضافة إلى مجموعة من المواد المعدنية كالزنك والفسفور، ومادة السيلينوم والتربتوفان.";
const ostrich_des =
    "لا توجد دراسات علمية كافية حول فوائد استهلاك لحم النعام، إلا أنه يشيع استهلاكه في بعض المناطق للحصول على فوائده الغذائية، إذ يحتوي على نسبة عالية من بعض العناصر الغذائية كالبروتين، وغيرها، كما أنه يتميز بمذاقه الشبيه باللحم البقري إلا أنه أقل محتوى بالدهون من غيره من أنواع اللحوم، وأعلى محتوى بالحديد من اللحم البقري.";
const egg_des =
    "البيض مليء بالمغذيات التي تجعل منه غذاء أساسي بجميع المراحل، فهو يحتوي على كل من فيتامين A وفيتامين B2 وفيتامين B12 وفيتامين B5 وفيتامين D وفيتامين E، ، كما يحتوي على مجموعة من العناصر المهمة مثل: البيوتين والكولين وحمض الفوليك واليود، و يعتبر البيض من الأغذية التي تدعم صحة الإنسان بشكل أساسي، وقد أشيع سابقًا أن البيض له ضرر على ارتفاع الكوليسترول بالجسم لكن أثبتت الدراسات لاحقًا أنه لا مشكلة من تناول البيض فهو يحتوي على 186 ميللغرام من الكوليسترول والذي يمثل تقريبا ثلثي الحد اليومي الموصى به.";
const eggYork_des =
    "يعتبر صفار البيض الأغنى بالفيتامينات والمعادن كفيتامين B12 وفيتامين A والسيلينيوم مقارنة مع بياض البيض، وتجدر الإشارة هنا إلى وجوب التخلي عن الحصول عليه من قبل الأفراد الذين يزيد لديهم خطر الإصابة بأمراض القلب وارتفاع الكوليسترول في الدم أو ارتفاع ضغط الدم وذلك لمحتواه المرتفع من الكوليسترول, اذ يحتوي صفار بيضة واحدة كبيرة الحجم على 186 ملليغرام منه.";
const eggWhites_des =
    "يحتوي بياض البيض على كمية وفيرة من البروتين، وبذات الوقت هو منخفض السعرات الحرارية والكوليسترول والدهون، لذلك هو مناسب لمن يرغب بفقدان وزنه، ومناسب لمن هو بحاجة لكميات كبيرة من البروتين، دون اكتساب سعرات حرارية أكثر في وجبتهم، ولكنه يفتقد للعناصر الغذائية الأخرى المفيدة المتوفرة في صفار البيض.";
const eggGeese_des =
    "بيض الإوز حجمه أكبر من حجم بيض الدجاج بأربع مرات و يحتوي بيض الاوز على الكثير من المعادن المفيدة، إذ تحتوي كل بيضة على قرابة خمس ملليغرامات من الحديد، فتوفر ما مقداره تسعة وعشرون بالمئة من القيمة الموصى بها من الحديد اليومي، وتكمن أهمية الحديد بأنه ينقل الأكسجين إلى أجزاء الجسم المختلفة، ويحسن من تشكل الهيموغلوبين، ويخفف من التعب.";
const eggDuck_des =
    "يحتوي بيض البط على البروتين ذا الجودة المرتفعة؛ أي الذي يزود بكافة الأحماض الأمينية الأساسية التي يحتاجها الجسم لصنع البروتينات، و يُعد صفار بيض البط من المصادر الغنية بالكولين، وهي مادة غذائية تعزز العديد من وظائف الجسم المُختلفة، مثل؛ نمو الخلايا، وعمليات الأيض، وتجدر الإشارة إلى أن الجسم ينتج كمية بسيطة من هذه المادة الغذائية بينما يأتي معظمها من استهلاك الأغذية الغنية بها.";
const eggQuail_des =
    "يعد بيض السمان من أنواع الأطعمة الغنية بالحديد، وقد يساعد تناوله بانتظام على الحماية من فقر الدم، أو تسريع عملية التعافي منه نتيجة الإصابة به، إضافة إلى أن بيض السمان غني بالبوتاسيوم الذي يعزز قدرة الخلايا الحمراء على القيام بوظائفها الطبيعية في الجسم.";

//////////////////// -- Seafood List -- //////////////////////
/////////////////////////////////////////////////////////////
const boltiFish_des =
    "تعيش أسماك البلطي في المياه العذبة أو قليلة الملوحة و تعد مصدرا غنيا بالبروتينات الخالية من الدهون، حيث تحتوي على أقل من 3 غرامات فقط من الدهون وهو ايضا أحد الأطعمة الغنية بالفيتامينات والمعادن، إذ يحتوي على كميات جيدة من فيتامين ب3، وفيتامين ب12، والفسفور، والبوتاسيوم، بالإضافة إلى احتوائه على الكالسيوم والذي يعد ضرورياً لتقوية العظام، والمساعدة على تخثر الدم، كما يحتوي على عنصر السيلينيوم الذي تحتاجه الغدة الدرقية لأداء وظائفها بشكل جيد.";
const boriFish_des =
    "سمك البوري يعتبر مصدر مهم للغذاء في دول حوض البحر الأبيض المتوسط منذ العصور القديمة. تضم الفصيلة حوالي 80 نوعاً من سمك البوري موزعة على 17 جنساً، و تعد مصدراً للمعادن الأساسية بما في ذلك الزنك، والحديد، والكالسيوم، والصوديوم، والبوتاسيوم، والفسفور، والمنغنيز، والمغنيسيوم، والسيلينيوم وبالتالي فهي واحدة من البدائل الأكثر صحة مقارنة باللحوم الحمراء أو المصنعة، والتي غالباً ما تكون ذات نسبة عالية من الدهون، وخاصة الدهون المشبعة.";
const barboniFish_des =
    "السلطان إبراهيم، أو البربوني، هو عبارة عن نوع من أنواع الأسماك التي تعيش في المناطق الرملية، وتتغذى على القشريات التي تعيش في قيعان المياه، وتتغذى على الديدان، ولهذا النوع من الأسماك أهمية تجارية كبيرة؛ حيث يوجد في أسواق السمك المحلية بشكل كبير، وعادة ما يوجد سمك السلطان إبراهيم في مياه البحر الأبيض المتوسط، وفي مياه البحر الأسود، كما يوجد في الجزء الشمالي الشرقي من المحيط الأطلسي.";
const morganFish_des =
    "يتميز سمك المرجان بأنه يضم مجموعة كبيرة من الألوان، ذات الأشكال الملفتة والجريئة، والألوان الزاهية، ومن النادر وجود نوع آخر من السمك تحت سطح البحر بمثل هذه الألوان، حيث يجد الناظر إلى هذا النوع من السمك المتعة والشعور بجمالية لا مثيل لها، إلا أن هذه الألوان لا تنحصر فقط في الشكل، بل لها وظيفة أخرى وهي التمويه، إذ يموه سمك المرجان نفسه تحت الماء هروباً من السمك.";
const salamonFish_des =
    "تُعد أسماك السلمون من الأسماك النهرية؛ تولد في المياه العذبة ثم تهاجر إلى المحيطات، وتعود إلى المياه العذبة فقط عندما تصل لمرحلة البلوغ لتتكاثر، و تعد مصدراً غذائياً مهماً للإنسان ولكثير من الحيوانات، مثل: الدببة، والذئاب، والعقبان، والكثير من الثدييات، والطيور،  وتتغذى أسماك السلمون الصغيرة على القواقع، والقشريات الأخرى، بينما تتغذى الأسماك الأكبر عمراً على الأسماك الأخرى.";
const farisFish_des =
    "سمك الفارس من الاسماك القاعية والتي تعيش بمجموعات في الاعماق المتفاوته مابين 100 الى 120 متر و تعتبر الأسماك مثل سمك الفارس من بين أكثر الأطعمة الصحية على هذا الكوكب. إنها محملة بالعناصر الغذائية المهمة، مثل البروتين وفيتامين د، و تعد الأسماك أيضًا أفضل مصدر لأحماض أوميغا 3 الدهنية، والتي تعتبر مهمة للغاية لجسمك وعقلك.";
const tunaFish_des =
    "تناول التونة يساعد في التقليل من الإصابة بأمراض القلب، وذلك بسبب قدرته على خفض نسبة الكولسترول الضار في الجسم، ورفع نسبة الكولسترول الجيد و منع تراكم الترسبات التي تتسبب في انسداد الشرايين، و من فوائد سمك التونة أنه يحسن المزاج، والسبب في ذلك يعود إلى احتوائه على أوميغا- 3 و احتوائه على مادة السيلينيوم هذان المكونان يساهمان في تنشيط الحمض الأميني التريبتوفان وهرمون السيروتونين في الجسم، الأمر الذي يساعد في رفع الحالة المزاجية ويقلل من التوتر.";
const segalFish_des =
    "هو نوع مشهور من أسماك البحر الأحمر كونه يُعد من ألذها لطهوه وتناول لحمه، وهو ينتمي إلى مجموعة من السمك تسمى سمك الأرنب، وتتميز هذه الأسماك بأن لديها عدداً كبيراً من الإبر السامة على زعانفها الظهرية والخلفية.";
const hamorFish_des =
    "يحتوي سمك الهامور على نسبة عالية من الأوميغا-3 كغيره من الأسماك، وتجدر الإشارة إلى أنه لا توجد العديد من المعلومات أو الدراسات العلمية حول فوائد سمك الهامور بشكل خاص، إلا أن الأسماك بشكل عام تعد جزءاً مهماً من النظام الغذائي الصحي والمتوازن، فهي مصدر جيد للبروتين، والفيتامينات، ومصدر أساسي للحمض الدهني الأوميغا-3 الذي قد يساهم في تعزيز صحة القلب والأوعية الدموية، ولا يستطيع الجسم تصنيع هذا الحمض الدهني بالكميات التي يحتاجها، لذلك فإنه يجب الحصول عليه من الطعام.";
const karosFish_des =
    "يقدم سمك قاروص المياه العذبة وقاروص المياه المالحة فوائد صحية عديدة، إذ يعد النوعان منخفضا السعرات الحرارية، ومصدراً للبروتين، والسيلينيوم الذي يعد ضرورياً لإنتاج مضادات الأكسدة، وتكوين هرمونات الغدة الدرقية، بالإضافة إلى أنهما مصدراً للأحماض الدهنية الأساسية أوميغا 3، إذ إنهما يحتويان على العناصر الغذائية نفسها تقريباً، إلا أنهما يحتويان على كميات متختلفة ومتفاوتة من بعض الفيتامينات، مثل: فيتامين ب12 وفيتامين ب6.";
const denesFish_des =
    "يُعد سمك الدنيس أحد الأطعمة الأوربية الشائعة، ومن الجدير بالذكر أنه عادة ما يتواجد في الأنهار والبحيرات البطيئة، ويتغذى سمك الدنيس بشكل رئيسي على الديدان، والرخويات، بالإضافة إلى الحيوانات الصغيرة الأخرى، ومن الجدير بالذكر إلى أن هناك أنواعاً عديدة من سمك الدنيس؛ والتي يصل عددها إلى أكثر من 100 نوع في جميع أنحاء العالم و تعد نكهته واضحة، ورطبة في الفم، وقليلة الزيت.";
const mosaFish_des =
    "يعد سمك موسى من الأسماك التي تحتوي على نسبة جيدة من أحماض أوميغا 3 الدهنية التي تساهم في تطور الدماغ لدى الأطفال بالإضافة إلى كونها مفيدة بشكل عام لصحة الدماغ، وتغذية البشرة، ولمعان الشعر، وعلى الرغم من قلة المعلومات حول فوائد سمك موسى تحديداً، إلّا أن الأسماك بشكل عام تُعد من الأطعمة مُنخفضة السعرات الحرارية، والغنية بالبروتينات، ولا تحتوي على نسبة عالية من الدهون المشبعة الموجودة في اللحوم الدهنية.";
const heredFish_des =
    "سمك الحريد او السمك الببغائي من أحد الفصائل السمكية الرأسية الكيدمية، تتغذى بشكل أساسي على الطحالب المائية، كما أن أطوالها تتراوح فيما بين قدم واحد، وحتى أربعة أقدام، أما عن متوسط عمر هذه الفصيلة السمكية، فيتمثل في سبعة أعوام، وقد اكتسبت أسماك الحريد اسم الببغاء؛ نظرًا لوجه الشبه بينها وبين الببغاء في منقارها، ذي الأسنان الأمامية، بهيئتها المرتبة، كما تجدر الإشارة إلى أن سمك الحريد من أروع أسماك البحر الأحمر، بلونه الأبيض المميز، ذي المذاق الفريد من نوعه.";
const wakarFish_des =
    "لا توجد معلومات خاصة بالفوائد المرتبطة بسمك الوقار إلا أن الأسماك بشكل عام تمتلك العديد من الفوائد الصحية بسبب محتواها من بعض المواد الغذائية، مثل؛ البروتين عالي الجودة، بالإضافة إلى الأحماض الأمينية والدهنية الأساسية التي لا تتوفر في مصادر البروتين الأُخرى، وبالتالي فإنه ينصح بتناول الأسماك كمصدر للبروتين في النظام الغذائي، وتجدر الإشارة إلى النظام الغذائي الذي يحتوي على الأسماك ومنتجاتها يساهم في الحفاظ على صحة القلب، ونمو الأطفال بشكل طبيعي.";
const bayadFish_des =
    "توجد أحماض أوميغا 3 الدهنية في جميع أنواع الأسماك، ولكنها غنية بشكل خاص في سمك البياض. تساعد في الحفاظ على صحة القلب عن طريق خفض ضغط الدم وتقليل مخاطر الموت المفاجئ والنوبات القلبية واضطراب نظم القلب والسكتات الدماغية. و تساعد على صحة وظائف المخ وتطور البصر والأعصاب لدى الرضيع أثناء الحمل.";
const keshrbayadFish_des =
    "هنالك فوائد عظيمة لتناول السمك علي الصحة العامة وصحة القلب والأوعية الدموية، لأن السمك يحتوي على أحماض أوميجا 3 الدهنية. التي لها العديد من الفوائد علي الصحة الجسدية والنفسية أيضاً ، وكذلك تعزيز القدرات العقلية والجنسية لدي الرجال. وتعتبر أسماك قشر البياض واحدة من أكثر الأسماك التي تحتوي على كمية كبيرة من أحماض أوميجا 3 الدهنية.";
const karmotFish_des =
    "هناك أنواع عديدة من سمك القرموط، أو ما يعرف ب السلور فتختلف طريقة تسميته، وهناك من يطلق علي سمك القرموط أبو شناب، بسبب وجود مجموعة من  الشعيرات البارزة في جزء الرأس الأمامي لسمك القراميط والتي تشبه الأشناب الموجودة في القطط ، لذلك يسمي أيضاً سمك القط Catfish ، ويبلغ طول سمك القرموط البالغ الكبير بين 100 - 280 سم ، و يفضل الابتعاد قد المستطاع عن شراء سمك قراميط كبيرة الحجم، لأنها تتغذى بشكل مباشر على الضفادع ، والفئران خاصةً إذا كانت تعيش في المصارف.";
const sardenFish_des =
    "تستوطن اسماك السردين المحيط الأطلسي بشكل أساسي، فضلا عن إمكانية توافره في البحر الأبيض المتوسط، اشتهر بهذا الاسم؛ نظرًا لاصطياده للمرة الأولى، على مقربة من جزيرة تسمى سردينيا  في غرب البحر المتوسط، تعتبر المياه المعتدلة، الحارة، هي الأنسب لنمو السردين، وتتزايد الأعداد بالضرورة، كلما اقتربنا من سطح المياه؛ إذ تتغذى على العوالق، وهي الأحياء المائية، التي تطفو على سطح الماء مثل سمك قشر بياض.";
const rengaFish_des =
    "يُعد سمك الرنجة من الأسماك الدهنية الغنية بأحماض الأوميغا 3 الأساسية لصحة الجسم لا سيما أنها لا تصنع في داخله، وهو يحتوي على كميات مرتفعة من هذه الأحماض مقارنة بسمك التونة والسلمون، حيث توفر الحصة الواحدة منه والتي تزن قرابة 85 غراماً حوالي 1.5 غرام منها، ومقارنةً بالأسماك الأخرى الغنية أيضاً بالأوميغا 3 بما فيها؛ سمك الماكريل الملكي، وسمك أبو سيف، وسمك الهلبوت فإن سمك الرنجة يحتوي على نسبة أقل من معدن الزئبق.";
const makaronaFish_des =
    "لا توجد معلومات خاصة بالفوائد المرتبطة بسمك المكرونة إلا أن الأسماك بشكل عام تمتلك العديد من الفوائد الصحية بسبب محتواها من بعض المواد الغذائية، مثل؛ البروتين عالي الجودة، بالإضافة إلى الأحماض الأمينية والدهنية الأساسية التي لا تتوفر في مصادر البروتين الأُخرى، وبالتالي فإنه ينصح بتناول الأسماك كمصدر للبروتين في النظام الغذائي، وتجدر الإشارة إلى النظام الغذائي الذي يحتوي على الأسماك ومنتجاتها يساهم في الحفاظ على صحة القلب، ونمو الأطفال بشكل طبيعي.";
const makarelFish_des =
    "تُعد الأسماك الدهنية ومنها الماكريل غنية بالأوميغا 3، وهو نوع من أنواع الدهون المتعددة غير المشبعة، تساعد على خفض ضغط الدم، إذ يمكن لارتفاع ضغط الدم مع مرور الوقت أن يؤثر في صحة الإنسان، بالإضافة إلى أن الأوميغا 3 ضروري لوظائف الجسم، فهو يساهم في المحافظة على صحة الدماغ، والقلب، وتقليل خطر الإصابة بالعديد من الأمراض، ويُعد سمك السلمون، والماكريل، والبوري الأحمر، من الأنواع التي تحتوي على أعلى نسبة من أحماض أوميغا 3 الدهنية.";
const nagelFish_des =
    "تعتبر سمكة الناجل هي السمكة الأشهر في البحر الأحمر في الآونة الأخيرة. كما أنها تحظي بسمعة وشعبية طيبة في دول الخليج والمملكة السعودية،  وخاصة أهل منطقة الحجاز بالسعودي  وعلي الرغم من أن أسماك الناجل لم تكن بهذه الشهرة في الماضي ، فقد كانت تعرف أكثر في أستراليا ومعروفة في المناطق الاستوائية وشبه الاستوائية جميعها تقريباً، و يتميز لحم سمك الناجل بأنه عالي الكثافة ولا يتخلله كمية كبيرة من الأشواك.";
const shoaorFish_des =
    "لا توجد معلومات خاصة بالفوائد المرتبطة بسمك الشعور إلا أن الأسماك بشكل عام تمتلك العديد من الفوائد الصحية بسبب محتواها من بعض المواد الغذائية، مثل؛ البروتين عالي الجودة، بالإضافة إلى الأحماض الأمينية والدهنية الأساسية التي لا تتوفر في مصادر البروتين الأُخرى، وبالتالي فإنه ينصح بتناول الأسماك كمصدر للبروتين في النظام الغذائي، كما تحتوي الأسماك على كمية مرتفعة من الأحماض الدهنية غير المشبعة، وكمية قليلة من الأحماض الدهنية المشبعة، وتجدر الإشارة إلى النظام الغذائي الذي يحتوي على الأسماك ومنتجاتها يساهم في الحفاظ على صحة القلب، ونمو الأطفال بشكل طبيعي.";
const shrimp_des =
    "يعتبر الجمبري من أشهر وأحب المأكولات البحرية المنتشرة حول العالم لما له من طعم  ومذاق مميز للغاية، كما أن له أسماء أخرى وهي الروبيان والقريدس، و يعتبر الجمبري هو أحد المصادر الهامة للحمض الدهني أوميجا 3 ولقد أثبتت الدراسات والأبحاث أن هذا الحمض الدهني يعمل على تخفيف الاكتئاب وتحسين الحالة المزاجية والصحة النفسية لدى الأشخاص الذين يعانون من الإكتئاب،و يساعد الجمبري على تحسين الصحة الجنسية لاحتواءه على عنصر الزنك.";
const kaborya_des =
    "يعد الزنك الموجود بسرطان البحر من العناصر الغذائية التي لا يمكن تخزينها في الجسم، وبالتالي يجب تناوله ضمن النظام الغذائي اليومي، كما قد يفيد ذلك في صحة الرجال وتحسين نوعية الحيوانات المنوية لديهم،  حيث يساعد عنصر الزنك في توازن الهرمونات كالتستوستيرون و يحتوي ايضا على النحاس الذي يساعد على إنتاج خلايا الدم البيضاء، والحمراء، ويحفز إطلاق الحديد لإنتاج الهيموجلوبين، إضافة لأهميته لنمو الرُّضع، وتطور الدماغ، وجهاز المناعة، والعظام.";
const estakoza_des =
    "الإستاكوزا هو كائن حي بحري من مجموعة القشريات، وهو الأكثر شهرة في هذه المجموعة، يتميز بمظهره الغريب وطعمه اللذيذ والشهي ويعد من الأطعمة مرتفعة السعر والفاخرة التي تقدم في العديد من دول العالم، ويحظى بشعبية كبيرة في أمريكا الشمالية بسبب قرب سكانها من البحر، ويتم صيد الإستاكوزا وتصديره إلى جميع أنحاء العالم، ويوفر الإستاكوزا أهم المعادن التي يحتاجها الهيكل العظمي للحفاظ على صحته وقوته، وهما الفوسفور والكالسيوم، حيث إنه يوفر 39% من احتياجات الفسفور اليومية وأيضاً 14% من احتياجات الكالسيوم اليومية. ";
const habbar_des =
    "يعد الحبار أحد أنواع الكائنات البحرية التي يتم استخدامها في الأنظمة الغذائية المتعددة، حيث يتميز الحبار بأنه أحد أطباق الأطعمة البحرية التي تنتمي لنفس مجموعة المحارات الصدفية المختلفة، حيث إن ما يميز الحبار بأن محتواه من الدهون المشبعة والكولسترول يُعد قليلًا جدًا، وبشكل عام فإن الأطعمة البحرية تحتوي على مجموعة كبيرة ومتعددة من العناصر الغذائية، حيث تساعد هذه العناصر الغذائية والمواد الفعالة في تحسين القوة الجنسية والخصوبة ولهذا السبب فإنه يُنصح بتناول هذه الأطعمة.";
const mahar_des =
    "يحتوي محار البحر على كافة الأحماض الأمينية التسعة الأساسية، والتي يحتاج الإنسان إلى استهلاكها من الغذاء لعدم قدرته على صنعها، ومن المعروف أنَ البروتين يؤثر في العديد من هرمونات الشهية، مما يعطي إحساساً بالشبع، ويقلل من تناول الطعام لاحقاً خلال اليوم، و يحتوي محار البحر على مجموعة من الفيتامينات، ومن أهمها فيتامين د، الذي يساعد على تنظيم مستويات الكالسيوم والفسفور بالجسم، مما يحافظ على صحة العظام والأسنان.";

//////////////////////// -- Fruits List -- ////////////////////////
///////////////////////////////////////////////////////////////////
const avocado_des =
    "قد يساعد الأفوكادو على إنقاص الوزن عند تناوله بكميات معتدلة، وذلك بسبب احتوائه على كمية جيدة من الدهون غير المشبعة الأُحادية والألياف الغذائية،وحسب إحدى الدراسات التي نشرت في مجلة (Nutrition) عام 2013، وأجريت على 26 شخصًا يعانون من زيادة الوزن، فإن تناول نصف حبة من الأفوكادو ضمن وجبة الغداء يساعد على الشعور بالشبع لمدة تتراوح بين 3 إلى 5 ساعات بعد تناول الوجبة، و هو غني بالعناصر الغذائية والفيتامينات مثل الفيتامين ,C ,A E و فيتامين K، ويعتبر مصدر جيد بالمعادن مثل البوتاسيوم والفسفور والمغنيسيوم.";
const pineapple_des =
    "يعد الأناناس من الفواكه الإستوائية المتوفرة بالوقت الحالي في أي متجر للبقالة، لكن في القدم أعاد كريستوفر كولومبوس الأناناس إلى أوروبا بعد رحلة استكشافية إلى أمريكا الجنوبية وأصبح الأناناس حينها يعرف بالفاكهه الفارهة والغريبة ويتم تقديمه فقط في أفخم المآدب، أما الآن فأصبح الأناناس شائعًا ويمكن للناس الإستمتاع به، ويعتبر الأناناس وجبة خفيفة مغذية فهو قليل السعرات الحرارية ومليئ بالفيتامينات المهمة والمعادن ولا يحتوي على الدهون المشبعة أو الدهون غير المشبعة.";
const orange_des =
    "مضادات الأكسدة والعناصر الغذائية الدقيقة والخصائص الصحية الموجودة داخل البرتقال كثيرة، يمكن القول بشكل مؤكد بأن البرتقال قد يكون له تأثير فعال في بقاء الجسم في صحة جيدة، حيث يوجد في البرتقال الكثير من العناصر الغذائية مثل الألياف الغذائية وفيتامين C وحمض الفوليك والثيامين والبوتاسيوم الذي يحتاج له الجسم كل يوم، إن تناول البرتقال أو حتى زيت البرتقال له العديد من الفوائد الصحية لجسم الإنسان من تقليل خطر الإصابة بأمراض القلب إلى المكافحة والوقاية من السرطان.";
const dates_des =
    "يعد التمر مصدرًا غنيًا بالسكر الطبيعي، ومن الممكن أن يظن البعض أنه غير مفيد لهم، ومع ذلك فإن هذه الفاكهة الحلوة مليئة وغنية بالعديد من العناصر الغذائية المختلفة، منها المعادن كالبوتاسيوم وغيره، مما يجعلها تشكل وجبة خفيفة ممتازة، ويمكن تناولها باعتدال، ويعتبر التمر مصدرًا يمد الجسم بالطاقة بشكل كبير، ويساعد كذلك على خسارة الوزن، ويحمي العظام من الإصابة بمرض هشاشة العظام ويعتبر تناول حبات التمر بشكل يومي يوفر الإحتياج اليومي من الحديد للجسم، بالإضافة إلى أن محتواه من الألياف وفيتامين ج يزيد من امتصاص الحديد.";
const blueberry_des =
    "يعد التوت الأزرق من أكثر أنواع الفاكهة احتواءاً لمضادات الأكسدة، ويعود ذلك إلى احتوائها على عدة أنواع من المركبات النباتية، التي تمنح الجسم عدة فوائد صحية، ومن أهمها مركبات الأنثوسيانين التي تمنح التوت لونه الأزرق، والبروسيانيدين ، وحمض الكلوروجينيك ، ومركبات الفلافونويد الأخرى، و يغطي كوب واحد حجمه 148 غراماً من فاكهة التوت 24% من احتياجات الشخص اليومية من فيتامين ج، و36% من فتامين ك، و25% من المنغنيز.";
const guava_des =
    "تعد هذه الفاكهة غنية بالفيتامينات والبوتاسيوم مما يعطي الجسم العديد من الفوائد، ومن أهمها المحافظة على صحة القلب و تتميز الجوافة بمحتواها المنخفض من السعرات الحرارية مما يجعلها عنصرًا مفيدًا في الرجيم، وعلى عكس الكثير من الأغذية منخفضة السعرات الحرارية فهي تحوي على الكثير من الفيتامينات والمعادن والعناصر المغذية الأخرى، وبفضل مضادات الأكسدة التي تحتويها الجوافة فهي تعتبر فاكهة ممتازة لتأخير ظهور علامات الشيخوخة.";
const lemon_des =
    "يعد الليمون من الحمضيات الغنية بفيتامين ج، والذي يعتبر من مضادات الأكسدة التي تحمي خلايا البشرة من الجذور الحرة التي تسبب لها التلف والضرر، كما يوفر فيتامين ج الحماية للقلب، ويقي من الإصابة بأمراض القلب المفاجئة، والشرايين، والأوردة، والسكتات الدماغية، ويحد من انخفاض ضغط الدم المفاجئ، وقد بينت العديد من الأبحاث بأن الأشخاص الذين يعانون من السمنة وتدنٍ في مستويات فيتامين ج، وارتفاع في ضغط الدم يتعرضون لفرصة أكبر للإصابة بالسكتات الدماغية المفاجئة، كما يحد فيتامين ج من الإصابة بنزلات البرد.";
const mango_des =
    "تساعد كل من الألياف، والفيتامينات، والبوتاسيوم الموجودة في المانجا على تحسين عمل الشرايين، وتقليل خطر الإصابة بأمراض القلب، كما يساهم المغنيسيوم، والبوتاسيوم في تحسين ضغط الدم، والحفاظ على نبض صحي، بالإضافة إلى محتواها من مضاد الأكسدة المنجيفيرين، إذ أظهرت دراسة مخبرية نشرت في مجلة Journal of Ayurveda and Integrative Medicine عام 2017، أن المنجيفيرين يحمي خلايا القلب من الالتهاب، والإجهاد التأكسدي، كما يقلل من خطر الإصابة بتلف عضلة القلب.";
const coconut_des =
    "يصنف جوز الهند على أنه من الفواكه الاستوائية التي تتبع فصيلة النخيل وتعود هذه الثمار في الأصل إلى جنوب شرق آسيا والجزر الواقعة بين المحيط الهادئ والهندي، وتمتاز ثمار جوز الهند بخصائصها المضادة للأكسدة والالتهابات والفطريات، كما يمكن استخدام زيوت هذه الثمرة للعناية بالبشرة وتكثيف الشعر وتقويته و تتعدد فوائد جوز الهند التي يمكن الحصول عليها إما عن طريق تناوله بشكل مباشر أو عن طريق استخدام زيته أو الماء الذي يوجد فيه، وترجع هذه الفوائد إلى القيم الغذائية العالية التي تمتلكها الثمرة.";
const pumpkin_des =
    "تميز قرع العسل بمحتوى غذائي غني ومذاق حلو بطبيعته مع سعرات حرارية قليلة جدًا، الأمر الذي يجعله وجبة محببة وصحية بامتياز، و تعد ثمار هذا النوع من القرع غنية بمضادات الأكسدة والبيتاكاروتينات (Beta Carotene) التي وُجد أنها تساعد على محاربة الشوارد الحرة وتخفيف فرص الإصابة بالسرطان، لا سيما سرطان الرئة، و بسبب احتواء هذا النوع من القرع على كمية ضئيلة جدًا من السعرات الحرارية مقابل نسبة جيدة من الألياف، فإن تناوله قد يساعد وبشكل فعال على خسارة الوزن والدهون الزائدة، وعلى الشعور بالشبع لفترات أطول.";
const raspberry_des =
    "إن شكل فاكهة توت العليق له طرف حاد مع مسحة خفيفة من الألوان وطعم حلو، عند تناول توت العليق يذوب في الفم بسهولة وذلك بسبب القوام الناعم والحلو له، يأتي توت العليق بعدة ألوان إما زهري أو أورجواني أو أسود أو أصفر أو برتقالي أو أبيض و يوجد في توت العليق نسبة كبيرة من مضادات الاكسدة التي قد تساعد في الوقاية من السرطان،كما ان مستخلص التوت والذي يتضمنه توت العليق يمنع نمو الخلايا السرطانية ويدمرها.";
const mandarin_des =
    "ينتمي اليوسفي إلى الحمضيات، وتحديدًا إلى نوع المندرين ، موطنها الأصلي جنوب شرق آسيا وبدأت بالانتشار غربًا على طول الطرق التجارية لتصل إلى مناطق البحر الأبيض المتوسط، تزرع أشجاره في المناطق شبه الاستوائية في حضارات كل من العالم القديم والحديث، و من فوائد اليوسفي تتمثل بمحتواه القليل من السعرات الحرارية، إذ أن الحبة الواحدة ذات الحجم المتوسط والتي لا يتعدى قطرها سبعة سنتيمترات تزود الجسم بما يقارب 47 سعرة حرارية، مما يجعلها خيارًا مثاليًا من مجموعة الفواكه لمن يتبعون نظامًا غذائيًا لإنقاص الوزن.";
const plum_des =
    "ينتمي البرقوق إلى الفصيلة الوردية ذات الفلقتين كالخوخ ، ويأتي في العديد من الألوان ويتراوح طعم البرقوق من الحلو إلى الحامض، وهو من الثمار المغذية ويملك العديد من الفوائد الصحية، ويمكن تناوله نيئًا أو صنعه كمربى أو إضافته إلى العديد من الأطباق كما يمكن أكله مجففًا، يحتوي البرقوق على العديد من الخصائص المميزة لإزالة السموم ومحفزات الأيض ومضادات الأكسدة، ويحتوي على العديد من المعادن كالبوتاسيوم والسيلينيوم والكروم، وفيتامين C والبيتاكاروتين والتي تعتبر من العناصر الغذائية التي تعزز الصحة.";
const apricot_des =
    "يوفر المشمش 8% من الاحتياج اليومي لفيتامين أ، وهذا ضمن 70 غرامًا منه، أي ضمن ما يعادل حبتي مشمش و يعد المشمش مصدرًا جيدًا لفيتامين سي، وهو أحد الفيتامينات التي لا يستطيع جسم الإنسان إنتاجها، ويجب الحصول عليه من خلال النظام الغذائي و يعد المشمش مصدرًا غنيًا بالألياف، والتي لها دور أساسي في تنظيم مستويات السكر في الدم، ومنع حدوث الإمساك وتعزيز صحة الجهاز الهضمي، وحيث يحتوي كل 35 غرامًا من المشمش على 0.7 غرامًا من الألياف الغذائية.";
const keshta_des =
    "إن فاكهة القشطة تعد من الأشجار دائمة الخضرة، حيث أوراقها وثمرها وبذورها وحتى الساق يتم استخدامه في صنع الأدوية، حيث يتم استخدام فاكهة القشطة في علاج الإتهابات الناجمة عن البكتيريا والطفيليات ومنها مرض الليشمانيات؛ وهو مرض ناجم عن الطفيليات التي تنتقل من خلال عضة أو لدغة الحشرات الرملية، وفي علاج الكحة والسرطان، وأيضًا يستخدم في تسبيب القيء وتفريغ الأمعاء، وبعض الأشخاص يستخدمون فاكهة القشطة للاسترخاء أو للاستخدام الموضعي على الجلد لعلاج التهاب المفاصل.";
const blackRaspberry_des =
    "بتميز التوت الأسود في كونه واحدًا من أفضل الأطعمة ذات القيمة الغذائية العالية، ولذلك فهو يقدم للجسم نطاقات واسعة من الفوائد الصحية، وبهذا يعين الدماغ على أداء وظائفه المختلفة، ويعتبر التوت الاسود مصدر غني بالمنجنيز، فيتامين ج، فيتامين ك، فيتامين أ والألياف الغذائية، و يحتوي على مضادات الأكسدة و قد يعزز من صحة الدماغ .";
const cranberry_des =
    "التوت البري هو أحد الفواكه اللذيذة والمفضلة لدى الكثير من الناس، حيث يتم استهلاكه كصلصة أو عصير أو يمكن إضافته للحلويات، و يحتوي التوت البري على كمية وفيرة من الألياف الغذائية، والكثير من الفيتامينات، مثل فيتامين C وفيتامين E وفيتامين K، كما ويحتوي التوت البري على المعادن الضرورية للجسم مثل النحاس والمنغنيز، ويحتوي أيضًا على العديد من مضادات الأكسدة.";
const fig_des =
    "أظهرت دراسة أُجريت على 150 شخصاً يعانون من متلازمة القولون العصبي مع الإمساك أن تناول حوالى 4 حبات من التين المجفف (45 غراماً) مرتين يومياً ساهم في انخفاض الأعراض بشكل كبير، بما في ذلك الألم والانتفاخ والإمساك. كما وجدت دراسة أخرى أن التين أدى إلى تحسين غالبية أعراض الإمساك لدى الأشخاص المصابين بالإمساك الوظيفي مقارنة مع مكملات الألياف. تشمل هذه الأعراض عدد حركات الأمعاء وآلام المعدة وعدم الراحة. بالإضافة إلى ذلك، يقلل التين من الجهد اللازم لتمرير البراز.";
const figs_des =
    "هناك العديد من فوائد التين الشوكي فهو يقلل من مستويات السكر في الدم لدى مرضى السكري من النوع 2، كما يعالج ارتفاع الكوليسترول في الدم و قد يؤدي التين الشوكي إلى التخفيف من الصداع النصفي والتقليل من شدته وتكراره وذلك بسبب خصائصه المضادة للالتهابات، كما إن بإمكانها التقليل من العوامل المسببة للالتهابات في مختلف أجزاء الجسم و يحتوي التين الشوكي على مركبات الفلافونويد، والتي تقلل بدورها من الاصابة بسرطان المعدة، والثدي.";
const banana_des =
    "يعد الموز أحد مصادر الكربوهيدرات الهامة، والتي يحتاجها ممارسو كمال الأجسام و يعد تناول الموز بعد التمرين مناسبًا للانتعاش السريع وتقليل الالتهابات العضلية، و من فوائد تناول الموز قبل التمرين مضاعفة الأداء أثناء التمرين الرياضي، ويجب مراعاة أن يكون تناول الموز قبل التمرين بنصف ساعة إلى ساعة، و من أهم فوائد الموز للعضلات احتواؤه على عنصر البوتاسيوم، فهو مصدر جيد لهذا العنصر الضروري لصحة العضلات والأعصاب والجهاز الدوراني.";
const peer_des =
    "هي فاكهة ذات طعم حلو وغنية بالألياف وقليلة السعرات الحرارية، كما أنها خالية من الدهون والكولسترول، وتأخذ فاكهة الكمثرى أشكال وأحجام مختلفة حسب أصلها ومكان نموها، كما أنها  تتوفر بأكثر من لون مثل: الأخضر والأصفر والأحمر، وقد يكون لونها أبيض، كما أن من الداخل ومحتواها من الماء عالي، بالإضافة إلى ذلك فإن فاكهة الكمثرى تحمل العديد من الفوائد الغذائية كالفيتامينات والمعادن والعناصر المفيدة لجسم الإنسان ومضادات الأكسدة، وبفضل احتوائها على العديد من العناصر الغذائية تعتبر الكمثرى للحامل خيارًا جيدًا لصحة الأم والجنين.";
const watermelon_des =
    "من فوائد فاكهة البطيخ تحسين الصحة العامة ويقلل البطيخ من خطر الإصابة ببعض الأمراض المزمنة، فتتمثل فوائد فاكهة البطيخ في تأثيره الإيجابي على القلب وعمليات الهضم كما ان فيتامين C المتواجد في العديد من الفواكه بما في ذلك البطيخ يعمل على حماية الجسم من مرض الربو، ويمكن للمكملات المستخلصة من فاكهة البطيخ ان تعمل على أن تحسين الجهاز الدوري في الجسم، وأيضًا من الفوائد المهمة لفاكهة البطيخ احتوائه على مادة الليكوبين بنسب عالية وتعمل على حماية الجسم من الإصابة بأمراض القلب.";
const pomegranate_des =
    "يمتلك عصير الرمان مستويات عالية من مضادات الأكسدة؛ إذ يحتوي على 3 أضعاف مضادات الأكسدة الموجودة في الشاي الأخضر مثلاً، وذلك لاحتوائه على مادة قوية مضادة للأكسدة تسمى البوليفينول، وبسبب هذه المادة تحصل بذور الرمان على لونها الأحمر، كما تساهم مضادات الأكسدة في الوقاية من تلف الخلايا، وتعمل على تخفيف الالتهابات، والحماية من مرض ألزهايمر، و يمكن الحصول على 48% من احتياج جسم الإنسان لفيتامين ج من خلال تناول فاكهة الرمان.";
const grabe_des =
    "تعد ثمرة العنب من الفواكه المليئة بالمواد الغذائية، والتي تنبت على أشجار الكروم المتمددة، وتمت زراعة العنب منذ القدم، حيث وجد علماء الآثار أن العنب قد تمت زراعته في أعوام 6500 قبل الميلاد في مصر القديمة واليونان، وتنتشر أشجار العنب في وقتنا الحاضر في جميع أنحاء العالم، حيث يتم حصاد أكثر من 72 مليون طن من العنب سنويًا، وتتنوع استخدامات العنب نسبةً لمحتواه الغذائي المتنوع، حيث يحتوي العنب على مضادات الأكسدة والريسفيراترول، واللذان يعدان من العناصر الأساسية المعززة لصحة القلب.";
const nabq_des =
    "النبق عبارة عن نبات يمتلك زهورًا وأوراقًا وبذور وثمار يتم استخدامهم في صنع الأدوية، حيث يتم استخدام أوراق النبق وأزهارها في علاج التهاب المفاصل وقرحة المعدة والنقرس والطفح الجلدي الناجم عن أمراض معدية مثل الحصبة، إن الشاي الذي يحتوي على أوراق النبق يعد مصدر جيد للفيتامينات ومضادات الأكسدة والحمض الأميني والحمض الدهني والمعادن، توت النبق يستخدم للوقاية من العدوى والتحسين من النظر والتقليل من الشيخوخة.";
const harankash_des =
    "الحرنكش أو ما يعرف بالتوت الذهبي ، وهو توت يتراوح لونه بين الأصفر والبرتقالي، ويتميز الحرنكش بالمذاق الحلو يشبه إلى حد ما مذاق الأناناس والمانجو و يعد الحرنكش غني بالمركبات النباتية التي تسمى بمضادات الأكسدة، حيث تحمي مضادات الأكسدة من الضرر الناتج عن الجذور الحرة، فترتبط الجذور الحرة بالعديد من الأمراض مثل السرطان والشيخوخة، حيث تحتوي قشرة الحرنكش على مضادات أكسدة 3 أضعاف أكثر من اللب.";
const melon_des =
    "يعد الشمام أحد أنواع البطيخ الصيفي ويكون بمثابة وجبة خفيفة مثالية بين الوجبات الرئيسة، ويساعد محتواه العالي من الماء في الحد من الجفاف والحفاظ على رطوبة الجسم ومقاومة الحرارة في أيام الصيف الحارة، فضلا عن مذاقه الحلو واللذيذ، ويتميز الشمام بفوائده الصحية التي يقدمها للجسم، واحتوائه على العديد من العناصر الغذائية الضرورية لوظائف الجسم الحيوية كفيتامين C وفيتامينات B وغيرها، وبالإضافة إلى ذلك يحتوي الشمام على كمية قليلة جدًا من السعرات الحرارية، مما يجعله خيارًا جيدًا للأشخاص الذين يريدون إنقاص وزنهم.";
const cherry_des =
    "شجرة الكرز هي إحدى العائلات الشجرية من فصيلة الخوخيات، و تضم فئتين أساسيتن هما: الكرز الحمضي (البرقوق)، والكرز الحلو، وتُعد ثمار فاكهة الكرز غنية بالفيتامينات وبالأملاح المعدنية والبوتاسيوم، وإن عملية جني ثمار الكرز تكون عادة بين نهاية شهر مايو وبداية شهر يوليو، وقد يختلف الأمر حسب نوع الكرز، وتتم زراعة الكرز في الوطن العربي في العديد من الدول مثل: الأردن وسوريا، و يتوقع العلماء أن تصبح فاكهة الكرز واحدة من وسائل علاج مرض السكري، إضافة للدراسات العديدة حول فوائد الكرز للرجيم.";
const papaya_des =
    "يعرف الاسم العلمي للبابايا ب Carica papaya، كما تعرف بعدة أسماء أخرى مثل فاكهة الباوباو أو الباباو التي ينحدر موطنها الأصلي من الأمريكيتين، وتعد فاكهة البابايا من ضمن قائمة الأصناف الغذائية الشعبية حول العالم نظرًا لطعمها الحلو المميز والغني بالعصير، يوفر تناول ثمرة البابايا علاجًا فعالا لمعظم مشاكل الهضم كعسر الهضم، ومتلازمة القولون العصبي، وحرقة المعدة، والإمساك، كما أشادت دراسة نشرت من قبل مجلة رسائل علم الغدد العصبي، بأن استهلاك البابايا بشكل منتظم يساعد على تعزيز صحة الجهاز الهضمي.";
const apple_des =
    "غالبًا ما يطلق عليه الفاكهة المعجزة، إذ ربما تناول تفاحة يوميًا تساعد الشخص على البقاء بعيدًا عن الأطباء، لأنها واحدة من أكثر الأطعمة الصحية التي يمكن للشخص تناولها، إذ تحتوي هذه الفاكهة المستديرة والعصرية على نسبة عالية من الألياف وفيتامين سي، كما أنها منخفضة السعرات الحرارية، ولا تحتوي على دهون أو كولسترول، كما أن التفاح غني بالبوليفينول، الذي يعمل كمضادات للأكسدة، وتوجد هذه البوليفينول في قشرة التفاح، ويمكن القول أن التفاح يخفف من آثار الربو، مرض الزهايمر، مع المساعدة في إدارة الوزن، وصحة العظام، الوظيفة الرئوية، وحماية الجهاز الهضمي.";
const greenApple_des =
    "يمتاز التفاح الأخضر بمحتواه المتدني من الدهون كما أنه يساعد في تدفق الدم بسلاسة في الجسم، الأمر الذي يجعله من الأغذية المفيدة التي تساعد في الوقاية من الإصابة بالجلطات الدماغية ومن أمراض القلب المختلفة، كما يمتاز التفاح الأخضر بوفرة محتواه من فيتامين K الذي يساعد في شفاء جلطات الدم، كما ان محتواه الثري من فيتامين C الذي يسهم في تخليص الجسم من الجذور الحرة وحماية خلايا الجسم من الضرر الذي تحدثه ويقلل من فرص الإصابة من سرطان الجلد.";
const grapefruit_des =
    "يعد الجريب فروت من الفواكه الحمضية، ويكون مذاقها مميزًا ومتراوحًا بين المذاق المر والحلو والحامض، ويمكن استهلاكها بتناول الفاكهة ككل أو بعصرها أو بتناول اللب فقط، وتحتوي هذه الفاكهة على العديد من الفيتامينات والمعادن الأساسية، وسميت بهذا الإسم لأنها تنمو وتكبر على شكل عناقيد كعناقيد العنب، وتحتوي أيضًا على العناصر المغذية المختلفة التي يمكن أن تسهم في العناية بصحة الجلد والحماية من العديد من الحالات المرضية، كما يمكن أن تساعد في الحفاظ على وزن صحي إذا تم تناولها باعتدال.";
const strawberry_des =
    "تنتمي الفراولة لجنس الشليك Fragaria، حيث نمت لأول مرة في أجزاء من فرنسا وإيطاليا وذلك قبل 234 قبل الميلاد، تتميز بكثرة بذورها التي تنتشر على سطح الثمرة الخارجي، وهي من أكثر أنواع الفواكه المحببة للعديد من الأفراد، و تعد الفراولة مصدراً غنياً بمضادات الأكسدة، بما فيها الأنثوسيانين ؛ المسؤولة عن إعطاء الفراولة لونها الأحمر اللامع، وتؤدي مضادات الأكسدة دوراً مهماً في الحفاظ على صحة الإنسان، فهي تحمي الجسم من الجذور الحرة الضارة، التي ينتجها الجسم كناتجٍ ثانويٍ لعملية الأيض تحت ظروف يرتفع فيها مستوى الإجهاد.";
const kiwi_des =
    "دايمًا ما يفضل الناس تقشير الكيوي، وقل تناوله لكن الكيوي بقشرته البنية وثمرته الخضراء وبذوره السوداء يمكن أكلها جميعًا، ويتوفر الكيوي على مدار السنة بمختلف مناطق العالم،  و للكيوي فوائد متعددة مثل كونها غنية بالعناصر الغذائية مثل فيتامين C وفيتامين K وفيتامين E والفولات والبوتاسيوم، كما تحتوي على مضادات للأكسدة وتعد مصدر جيد للألياف.";
const dragonfruit_des =
    "تعد فاكهة التنين غنية بمضادات الأكسدة، كما توفر كميات جيدة من الألياف والليكوبين والكربوهيدرات، إضافة إلى الفيتامينات القابلة للذوبان في الماء، كالكاروتين وفيتامين C إلى جانب فيتامين B2 وفيتامين B3، وكذلك بعض المعادن كالمغنيسيوم والحديد والكالسيوم والفسفور والصوديوم، كما توفر بذورها بعض الأحماض الدهنية المتعددة غير المشبعة وكذلك أحماض أوميغا 3 الدهنية وأحماض أوميغا 6 الدهنية.";
const hawthorn_des =
    "تنجم فوائد الزعرور في إنقاص الوزن عن دوره في تحسين مستويات الشحوم في الدم ويشمل ذلك الشحوم الثلاثية والكوليسترول حيث تشير الدراسات لذلك، فالمستويات الطبيعة عند الناس الأصحاء تؤدي وظائف مهمة في الجسم تشمل نقل المغذيات في جميع أنحاء الجسم، أما المستويات المرتفعة فتؤدي إلى تراكمها في الأوعية الدموية وفي كافة الجسم، مما يزيد من خطر البدانة وداء التصلب العصيدي وأمراض القلب والأوعية الدموية.";
const peach_des =
    "الخوخ من الفاكهة المغذية بشكل كبير وتوفر العديد من الفوائد الصحية لجسم الإنسان ، و يحتوي الخوخ على كمية كبيرة من سكر السوربيتول  وهو أحد أنواع الكحولات السكرية التي تعد مليناً طبيعياً، لذا يعد الخوخ الطازج، والمجفف من الفاكهة التي تساعد على تسهيل حركة الأمعاء، كما يمكن لثماره المجففة أن تخفف أعراض الإمساك، وتسهل حركة البراز عبر الجهاز الهضمي.";
const kaka_des =
    "تعتبر الكاكا مصدرًا جيدًا للألياف وتحتوي على حوالي 20% من الاحتياجات اليومية في الحصة الواحدة، وتساعد الألياف على هضم الطعام بطريقة أكثر فعالية عن طريق إضافة التخلص من الجزء الأكبر عن طريق البراز وتحفيز الحركة الدودية لتحريك الطعام من خلال الجهاز الهضمي وزيادة إفرازات العصارة الهضمية وتخفيف أعراض الإمساك والإسهال، كما يمكن لها الحماية من سرطان القولون والمستقيم وغيرها من الأمراض المماثلة.";

const zebeeb_des =
    "يعد الزبيب من المصادر الغنية بالبوتاسيوم، فنصف الكوب منه يحتوي على 618 مليغراماً، ومن الجدير بالذكر أن البوتاسيوم يعد مفيداً لصحة القلب والأوعية الدموية و يساعد تناول الزبيب على تقليل خطر الإصابة بفقر الدم، وذلك لاحتوائه على العديد من المعادن؛ كالحديد، والنحاس، والعديد من الفيتامينات، والتي تعد مهمة في تكوين خلايا الدم الحمراء، ونقل الأكسجين لجميع أجزاء الجسم.";
const karasya_des =
    "تعرف القراصيا بأنها ثمرة البرقوق المجفف، وهي من الأطعمة الصحية، التي تحتوي على عدد من العناصر الغذائية، مثل: الكربوهيدرات، والفيتامينات، والمعادن، كما تحتوي القراصيا على مضادات الأكسدة بكميات أكبر من تلك الموجودة في الخوخ الطازج، وتعد القراصيا مصدرًا جيدًا للبوتاسيوم والذي هو مهم جدًا في تنظيم وظائف الجسم المختلفة مثل تسهيل الهضم، تنظيم نبض القلب، تنظيم عمل النواقل العصبية، تنظيم ضغط الدم.";
///////////////////////// -- vegetables -- ////////////////////////////
//////////////////////////////////////////////////////////////////////
const potato_des =
    "تعد البطاطس مصدرا جيدا للكربوهيدرات وتحتوي على كمية مرتفعة من البوتاسيوم المهم لوظائف العضلات والأعصاب، بالإضافة إلى أنه يساعد على تنظيم مستوى ضغط الدم وتوازن السوائل عبر تأثيره المعاكس للصوديوم، وترتبط زيادة استهلاك البوتاسيوم بتقليل خطر الإصابة بارتفاع ضغط الدم وأمراض القلب.";
const potatoSweet_des =
    "البطاطا الحلوة هي نوع من أنواع الخضروات، والتي تتكون على شكل جذور حلوة المذاق ونشوية، وتعد من الخضروات الشائعة جدًا إذ تزرع في جميع أنحاء العالم، وتختلف كثيرًا في الحجم واللون بين أنواعها، فمنها البطاطا ذات اللون البرتقالي أو الأبيض أو الأرجواني، وتعد غنية جدًا بالفيتامينات والمعادن ومضادات الأكسدة وكذلك الألياف الغذائية، وبالتالي فهي تقدم الكثير من الفوائد الصحية لجسم الإنسان، فمن الضروري تضمينها ضمن النظام الغذائي.";
const onion_des =
    "يعد البصل من الخضروات الجذرية التي تنمو تحت الأرض، والتي تشمل أيضًا الثوم والكراث، وتتم زراعته منذ آلاف السنين بفضل استعمالاته الكثيرة وفوائده الطبية، ويحتوي البصل أيضًا على العديد من المعادن مثل الكالسيوم والمغنيسيوم والصوديوم والبوتاسيوم والسيلينيوم والفوسفور، ويعد البصل مصدرًا جيدًا لفيتامين C وفيتامين B6 والألياف الغذائية أيضًا.";
const garlic_des =
    "تقدر القيمة الغذائية للثوم من خلال محتواه المميز الذي يحمل العديد من الفيتامينات والمعادن مثل الفوسفور والبوتاسيوم والمغنيسيوم والزنك والكالسيوم والحديد واليود والكبريت والكلور، كما يعد الثوم مصدرًا غنيًا بفيتامينات المجموعة B مثل الثيامين، والنياسين، وحمض الفوليك وفيتامين A،C،K كما يحمل الثوم في مكوناته بعض للمركبات العضوية مثل الأليسين.";
const spinach_des =
    "يعد السبانخ إحدى الخضراوات ذات الأوراق الخضراء الداكنة والتي تعود نشأتها إلى بلاد فارس، والتي تمتاز بالعديد من المهام والفوائد الصحية لكل من البشرة والشعر وصحة العظام و يعد السبانخ مصدر ممتاز لمعدن الحديد الذي يساعد في إنتاج مادة الهيموغلوبين التي تقوم بنقل الأكسجين إلى أنسجة الجسم المختلفة والعديدة لمنحها الطاقة اللازمة لإجراء العمليات الحيوية داخل جسم الإنسان.";
const courgettes_des =
    "يعود أصل الكوسا لأمريكا لكنها انتشرت في مختلف بلدان العالم وقد أصبح عدد كبير منها يقوم بإنتاجها كاليابان والصين ورومانيا وإيطاليا وتركيا ومصر والأرجنتين، حيث تتوفر بألوان مختلفة كالأصفر والأخضر الفاتح والأخضر الغامق، يشبه شكلها القرع وتحتوي من الداخل على البذور، و تعود الكوسا على الجسم بمجموعة متنوعة من الفوائد، فهي تحتوي على البوتاسيوم والمنغنيز إلى جانب الفوسفور والنحاس وكميات لا بأس بها من الكالسيوم والحديد والصوديوم والزنك والسيلينيوم.";
const watercress_des =
    "تعد اوراق الجرجير الصغيرة الطازجة مصدرًا جيدًا لمعدني الكالسيوم والحديد وفيتامين A وفيتامين C وفيتامين K، أما عن الاعتقاد القديم الحديث عن فوائد الجرجير للجنس يرجح خبراء الصحة والتغذية أن وجود مضادات الأكسدة بكمية كبيرة في الجرجير يساعد على تثبيط عمل الملوثات البيئية التي تؤثر بشكل سلبي على الرغبة الجنسية.";
const beetroot_des =
    "الشمندر غني بالألياف الطبيعية فمن خلال هذه الألياف يقوم بتخفيف مشاكل الإمساك وأعراض التهاب الأمعاء، حيث إن تناول كوب من الشمندر سيمد الشخص بـ3.4 جرام من الألياف ،و أحد العناصر المتواجدة بالشمندر هي النترات والتي تكون أكسيد النيتريك في جسم الإنسان، حيث إن هذا المركب هو المسؤول عن خفض ضغط الدم فهو يقوم بتوسيع الأوعية الدموية، مما يؤدي إلى تحسين الدورة الدموية والأكسجين.";
const corn_des =
    "تتميز الذرة الصفراء بكونها من الحبوب الكاملة الغنية بالألياف، وهي مصدر هام للعديد من الفيتامنيات، المعادن ومضادات الأكسدة، يساعد تناول الذرة الصفراء المسلوقة على دعم صحة القلب وذلك بفضل محتواها من الألياف المخفضة للكوليسترول ومعدني البوتاسيوم والمغنيسيوم الضرورين لصحة القلب.";
const grapeLeaves_des =
    "تتميز أوراق العنب بأنها غنية بالأملاح المعدنية الضرورية للجسم مثل الحديد والبوتاسيوم والفوسفور بالإضافة إلى (البورون)، كما أنها تحتوي على نسبة مرتفعة من السكريات البسيطة كالفركتوز والجلوكوز وهي مواد كربوهيدراتية تتميز بسهولة هضمها ولا تتحول إلى دهون، حيث أن الكبد تخزنها لحين الحاجة إليها.";
const greenBeens_des =
    "تعد الفاصوليا الخضراء مصدر جيد للمعادن كالكالسيوم، والفسفور، والبوتاسيوم، والزنك، والحديد الذي يعتقد أن نسبته في الفاصولياء الخضراء من شأنها أن تحسن الخصوبة، بالإضافة إلى أنها تحتوي على النحاس، والمغنيسيوم، والمنغنيز، وهي معادن تساهم في تعزيز الأيض، وتحمل خصائصاً مضادة للأكسدة، وتعزز صحة العظام، وشفاء الجروح.";
const lubya_des =
    "تعرف اللوبيا البيضاء بغناها بالألياف، كما يعرف ايضًا أنها حل لمشاكل الجهاز الهضمي كالإمساك والإسهال اللذان قد يسببان حرجًا والإحساس بعدم الراحة، فالألياف الغذائية هي أفضل الحلول لمعالجة مشاكل المعدة فهي تساعد على امتصاص الماء وتليين البراز كما أنها تحسن حركة الأمعاء وتحسن كذلك من كفاءة الجهاز الهضمي.";
const carrot_des =
    "منذ القدم، ساد اعتقاد أن الجزر يعزز صحة العين ويحسن النظر، رغم أن الجزر مفيد لصحة العين لأنه يحتوي على عناصر عديدة معززة لصحة جميع الأعضاء في الجسم بما فيها العين، مثل عنصر البيتا كاروتين واللوتين، واللذان يعززان من قوة الإبصار لدى الإنسان ولكن تعد فائدة الجزر لتقوية النظر من الأساطير والخرافات التي لا مجال لها من الصحة.";
const cucumber_des =
    "يعد الخيار مصدراً جيداً لفيتامين ج، وفيتامين أ، وفيتامين ك، وبعض فيتامينات ب، كما يحتوي على كميات جيدة من المعادن؛ كالبوتاسيوم الذي يساعد على تنظيم ضغط الدم، والمنغنيز الذي يدخل في عملية تنظيم وظائف الدماغ والأعصاب، بالإضافة إلى الزنك، والمغنيسيوم، والحديد، والكالسيوم،و يمكن أن يساهم الخيار في المحافظة على ضغط الدم بمستوياته الطبيعية، وذلك لمحتواه من البوتاسيوم، الذي يمكن أن يقلل من احتباس السوائل الناجم عن الصوديوم داخل الجسم.";
const parsley_des =
    "يحتوي البقدونس على العديد من مضادات الأكسدة المفيدة لصحة الجسم؛ كالفلافونويدات ، والكاروتينات، وفيتامين ج؛ وهي مركبات تقلل خطر ضرر الخلايا الناتج عن الجذور الحرة، إضافة إلى تقليل خطر الإصابة ببعض الأمراض؛ كالسكري من النوع الثاني، وسرطان القولون، وأمراض القلب.";
const dill_des =
    "تحتوي الـ 100 غرام من أوراق الشبت الطازجة على نسبة عالية من الفيتامينات والمعادن حيث إنها تغطي 154% من النسبة اليومية الموصى بها من فيتامين أ، و تحتوي على 142% من النسبة اليومية الموصى بها من فيتامين ج، و تغطي 17% من النسبة اليومية الموصى بها من فيتامين ب2.";
const tomato_des =
    "تحتوي الطماطم على نسب عالية من اللايكوبين، وهو أكسيد يساهم في حماية القلب. وفقًا لبعض الدراسات، فإن استهلاك الطماطم بكميات كافية يحارب أعراض سرطان الثدي وغيره من الأمراض الشائعة في أيامنا هذه، كما إن تناول الطماطم بانتظام يجنبك الإصابة بأمراض القلب، نظرًا لاحتوائها على الفيتامينات التي تمنع النزيف وتنقي الدم.";
const eggplant_des =
    "يعتبر الباذنجان أحد أنواع الخضراوات، ويوجد بأصناف متعددة تختلف في اللون، والشكل، والحجم. ويعتبر الباذنجان ذو اللون الأرجواني اللامع من الأنواع الأكثر شهرة، و تشير بعض الدراسات إلى أن الباذنجان يمكن أن يساعد على تقليل خطر الإصابة بأمراض القلب من خلال خفض مستويات الكوليسترول الضار، والدهون الثلاثية في الدم.";
const broccoli_des =
    "يحتوي البروكلي على كمية جيدة من فيتامين ج؛ إذ إن تناول 100 غرام من البروكلي المطبوخ يزود الجسم بما يُقارب 30 مليغراماً من فيتامين ج، وهو كمية تفوق احتياجات الجسم اليومية من هذا الفيتامين، الذي يعد عنصراً ضرورياً لعمل الجهاز المناعي، إذ يعمل كمضاد للأكسدة، كما يمكن أن يساعد على تقليل خطر الإصابة بالسرطان، وأمراض القلب والأوعية الدموية.";
const basil_des =
    "يساعد نبات الريحان على التخفيف من الغازات، وتهدئة المعدة، ومن الممكن أن يستخدم في حالات عسر الهضم، و يحتوي الريحان على حمض الأسيتيك الذي قد يساعد على تفتيت حصوات الكلى، وتخفيف الألم الناجم عنها، كما أن عصير الريحان مليء بالعناصر الغذائية؛ مثل مضادات الأكسدة، ومضادات الالتهابات، وقد يكون مفيداً للحفاظ على صحة الكلى.";
const cabbage_des =
    "يعد الكرنب (الملفوف) مصدراً جيداً للألياف الغذائية، والتي تعد ضروريةً في النظام الغذائي الصحي، فهي تساعد على التقليل من مستوى الكوليسترول، والمحافظة على انتظام مستويات السكر في الدم، والتقليل من خطر ارتفاعها أو انخفاضها الشديد.";
const olive_des =
    "شجرة الزيتون هي شجرة دائمة الخضرة التي يمكن أن تعيش وتنتج الزيتون لأكثر من قرن من الزمان. وفي بعض الحالات النادرة، أفادت التقارير بأن أشجار الزيتون تعيش وتنتج براعم في عمر يبلغ 1800 سنة. تصل الشجرة إلى ارتفاع 5-20 متر، و يساعد الزيتون على الحفاظ على صحة القلب والشرايين عن طريق تقليل الكولسترول السيء ورفع مستوى الكولسترول الجيد.";
const salq_des =
    "يحتوي  السلق على النترات التي تزود العضلات بكميات أكبر من الأكسجين الذي يعمل على التحسين من أداء التمارين الرياضية، بالإضافة إلى أن هذه المادة مفيدة للقلب والأوعية الدموية، ويمكن أن يفيد مرضى الجهاز التنفسي أيضاً.";
const chickpea_des =
    "تتميز البازلاء الخضراء باحتوائها على الفيتامينات الأساسية ومضادات الأكسدة مثل فيتامين K وC والفولات كما أنها غنية بالمنغنيز والألياف، وتعتبر البازلاء غنية بالحديد وتكمن اهمية الحديد في ان نقص الحديد هو السبب الرئيسي لفقر الدم وإن لم يكن لدى الشخص مخزون كاف من الحديد فلن يتمكن الجسم من صنع خلايا دم حمراء صحية تحمل كمية كافية من الأكسجين.";
const coriander_des =
    "الكزبرة تعد مصدراً جيداً للعديد من مضادات الأكسدة التي تقلل من تلف الخلايا الناجم عن تراكم الجذور الحرة في الجسم، كما أنها قد تساهم في التقليل من شدة الالتهابات، وتنظيم مستويات السكر والهرمونات في الدم، والتقليل من التوتر والقلق.";
const mint_des =
    "النعناع له دور مفيد في علاج مشاكل المعدة كقرحة المعدة، بالإضافة إلى أن مستخلص النعناع يعمل كمسكن للآلام ومضاد للالتهابات، أما مغلي النعناع أو مشروب النعناع يساعد في عملية الهضم وتسهيل المعدة، وأوراقه طاردة للغازات في حالة الانتفاخات، كما أنه مفيد أيضًا للقلب.";
const chilli_des =
    "يوجد العديد من أنواع الأطعمة التي تساعد الجسم في التخلص من الوزن الزائد والسمنة، ويعد الفلفل الحار أحد هذه الأطعمة التي تعمل على فقدان الوزن،و يحتوي على مركب يسمى Capsaicin؛ الذي يتميز باحتوائه على خصائص تساعد في تخفيف الآلام، وتخفيف بعض الحالات المرضية كالتهاب المفاصل الروماتويدي.";
const pepper_des =
    "يحتوي الفلفل الأخضر على أكثر من نصف ملليغرام من اللوتين وزياكسانثين وهما من أحد مضادات الأكسدة المهمان للحفاظ على صحة العينين وهما أحد أفضل المصادر الطبيعية لمضادات الأكسدة، فاللوتين يعد علاجًا طبيعيًا للضمور البقعي المسبب الرئيسي للعمى لدى المسنين.";
const taro_des =
    "تحتوي جذور القلقاس على نسبة عالية من الألياف الغذائية، بالإضافة إلى احتوائه على نوع خاص من النشا، يعرف بالنشا المقاوم، وتعد كل من الألياف والنشا المقاوم من كربوهيدرات غير القابلة للهضم في جسم الإنسان، وبالتالي لا تؤثر في مستويات السكر في الدم، بل إنها تساعد على التقليل من ارتفاع السكر؛ نتيجةً لإبطائها لعملية الهضم.";
const lettuce_des =
    "الخس من الخضروات التي تقدم للجسم جميع الفيتامينات والمعادن اللازمة دون الحاجة إلى زيادة كمية السعرات الحرارية المستهلكة، حيث يقدم الخس القليل من السعرات الحرارية والكثير من الفيتامينات والمعادن الضرورية مقارنةً بغيره من الخضروات، حيث يقدم خس مثلا ما يقارب ال 4094 وحدة دولية من فيتامين A أي حوالي 82% من الاحتياج اليومي.";
const qarnabeet_des =
    "يعد القرنبيط من الخضار الغنية بالألياف؛ حيث يحتوي الكوب الواحد منه على 10% من الاحتياجات اليومية منها، وتعد الألياف غذاء للبكتيريا النافعة في الأمعاء، والتي تعزز صحة الجهاز الهضمي، وتقلل الالتهابات.";
const mashroom_des =
    "يعد الفطر من المصادر الغنية بمجموعة فيتامينات ب، والتي تساهم في الحفاظ على صحة القلب، ومنها فيتامين ب2 والذي يعرف باسم الريبوفلافين الذي يساعد على تجديد خلايا الدم الحمراء في الجسم، وفيتامين ب3 والذي يعرف باسم النياسين والذي يساهم في الحفاظ على صحة الجهاز الهضمي.";
const okra_des =
    "تتميز البامية بمحتواها الجيد من الألياف التي تساعد على الهضم، وتقلل من الجوع، وتحافظ على الشبع لفترة أطول، و تحتوي البامية على نسبة جيدة من المعادن، مثل البوتاسيوم الذي يساعد على تنظيم ضغط الدم، والكالسيوم، والمغنيسيوم، والحديد، والمنغنيز، والفسفور.";
const molokhiya_des =
    "تعتبر الملوخية من النباتات الورقية والتي يتم استخدامها عند وجود نقص في أحد العناصر الغذائية أو للأشخاص الذين يعانون من سوء في التغذية في الشرق الأوسط أو أفريقيا، تحتوي هذه النبتة على مضادات الاكسدة وأيضًا لها تأثير للحماية من بعض المواد المسممة مثل الرصاص والزرنيخ، وأيضًا الأوراق قد أظهرت تأثير كمضادات للبكتيريا ومضاد للسرطان.";
const ginger_des =
    "يحتوي الزنجبيل على مواد فعالة تسمى بالجنجرول والشوغول ؛ وهي مواد تتمتع بخصائص مضادة للأكسدة ومضادة للالتهابات؛ حيث تساعد على التخلص من الآثار السلبية التي تسببها السمنة، كما أشارت بعض الدراسات إلى أن للزنجبيل دوراً فعالاً في خسارة الوزن، حيث يساعد على تقليل الشهية وتحسين عمل الجهاز الهضمي، كما أشارت دراسات أخرى إلى أنه يساهم في تنظيم مستويات السكر في الدم؛ مما يساعد على خسارة الوزن.";
/////////////////////// -- Oils List -- //////////////////////////
/////////////////////////////////////////////////////////////////
const cornOil_des =
    "يخضع زيت الذرة أثناء التصنيع لعمليات معالجة متعددة المراحل تساعد على رفع درجة الاحتراق الخاصة به، مما قد يجعله أحد الزيوت المثالية للطهي، ولكن عليك أن تدرك أن عمليات المعالجة المذكورة تجرد زيت الذرة من العديد من الخصائص والعناصر الغذائية المفيدة، مما يقلل من قيمة زيت الذرة الغذائية، ويقلل من الفوائد التي من الممكن تحصيلها من هذا الزيت.";
const palmOil_des =
    "يستخلص زيت النخيل من ثمار أشجار النخيل، حيث يتمتع باللون البرتقالي المائل للأحمر في صيغته الطبيعية غير المكررة، يتم تصنيع زيت النخيل المركزي في منطقة جنوب شرق آسيا، حيث تنتج ماليزيا وأندونيسيا أكثر من 80% من الزيت المستهلك في العالم، ويعتب زيت النخيل  من الزيوت الصلبة في درجة حرارة الغرفة كزيت جوز الهند، إلا أن درجة انصهاره هي 35 درجة مئوية وهي أعلى من درجة انصهار زيت جوز الهند البالغة 24 درجة.";
const canolaOil_des =
    "زيت الكانولا  زيت كندي الأصل يستخدم بشكل كبير في المصانع التي تعمل على إنتاج الصوابين والشموع والمشحمات وغيرها، وبعد أن تم تعديل زيت الكانولا أصبح استخدامه متداول في صناعة الطعام، إذ يروج على أنه غني بالحمض الدهني الأوميغا 3، ان الزيت والمتوفر حاليًا في الأسواق من شأنه أن يضر بالصحة، وذلك نتيجة تعديله وراثيًا.";
const oliveOil_des =
    "زيت الزيتون ممتاز للصحة، بسبب غناه بالأوميغا 3 و أوميغا 6 و أوميغا 9 والأحماض الدهنية الأحادية غير المشبعة، ومن فوائد زيت الزيتون، أنه يقلل من خطر الإصابة بأمراض القلب والأوعية الدموية، ويخفض مستويات الكوليسترول الكلي والكوليسترول الضار في الدم، كما أنه غني بالبوليفينول ومضادات الأكسدة التي تبطئ شيخوخة الخلايا وفيتامين K (لتخثر الدم وقوة العظام) و E (لمرونة الجلد).";
const coconutOil_des =
    "يعتبر زيت جوز الهند من الزيوت التي تستخدم في تحضير الطعام ومجالات الاعتناء بالشعر والبشرة. هو يستخرج من لب ثمرة جوز الهند الناضجة ويحتوي علي نسبة عالية من الأحماض التي تساهم في تبطيء عملية التأكسد وبالتالي إطالة صلاحيته لسنوات، و عندما تتفاعل الحرارة مع الضوء والأوكسيجين، قد تقل الدهون المفيدة في أنواع من الزيوت ولكن زيت جوز الهند يحتوي علي الكثير من الدهون المشبعة لذلك سنصح في استخدامه في القلي اذ يتحمل الحرارة المرتفعة لفترة طويلة قبل أن يتأكسد.";
const sunflowerOil_des =
    "هو الزيت المستخلص من بذور زهرة الشمس. ويستخدم زيت زهرة الشمس غالباً في الطعام كزيت قلي وفي صناعة مستحضرات التجميل. وتشير الاحصائيات إلى أن إجمالي الإنتاج في العالم من زيت عباد الشمس في عام 2014 قد بلغ  ما يقرب 16 مليون طن، وتتصدر أوكرانيا وروسيا قائمة الدول المنتجة لزيت عباد الشمس.";
const cottonOil_des =
    "زيت بذرة القطن هو زيت طبخ مصنوع من بذور نبات القطن ، وهو ينتمي إلى نفس فئة زيت الكانولا وزيت فول الصويا وزيت القرطم ، لأنه في الأساس زيت “نباتي” التهابي تتم معالجته ويمكن أن يتأكسد بسهولة عند تعرضه للحرارة العالية ويستخدم زيت بذرة القطن في العديد من سلاسل الوجبات السريعة للقلي العميق لأنه يعزز نكهة الطعام بدلا من إخفائها ، كما أنها أقل تكلفة من الزيوت النباتية الأخرى.";
const butter_des =
    "تعد الزبدة من أكثر الأطعمة الدهنية تعقيداً؛ إذ تحتوي على أكثر من 400 نوع من الأحماض الدهنية، وخاصةً المشبعة منها، والتي توجد بنسبة كبيرة قد تصل إلى 70% من محتوى الدهون في الزبدة، كما تحتوي على نسبة جيدة من الدهون الأحادية غير المشبعة، مثل حمض اللينولييك.";
const samn_des =
    "إن من فوائد السمن الحيواني أنه يعد مصدراً غنياً بالأحماض الدهنية ومن أبرزها؛ حمض اللينولييك، وحمض الدوكوساهكساينويك؛ حيث يحتوي حمض اللينوليك على خصائص تقلل الأكسدة، والالتهابات، وخطر الحساسية، كما أنه يزيد من نشاط بعض الإنزيمات التي تخفض الضرر التأكسدي في الخلايا؛ كإنزيم الكاتالاز وإنزيم سوبر أكسيد ديسميوتاز، كما قد يقلل من كمية الأنسجة الدهنية في الكبد والعضلات؛ بواسطة زيادة نشاط الإنزيم الذي له دور في تكسير الدهون.";
////////////////////////// -- Beens list -- //////////////////////
///////////////////////////////////////////////////////////////////
const whiteRice_des =
    "إن الطاقة التي يحتاجها الجسم لممارسة رياضة كمال الأجسام تستمد من الكربوهيدرات، والتي يقوم الجسم بتحويلها إلى الجليكوجين المخزن في الكتلة العضلية، وتبعا لكون الأرز مصدرًا جيدًا للكربوهيدرات فيمكن عندئذ اعتماده كمساعد على زيادة الطاقة اللازمة لأداء التمارين، و لا يحتوي الأرز على الغلوتين، بالتالي لا يسبب الحساسية أو التهابات الأمعاء لمن يعانون من حساسية القمح أو الداء البطني.";
const whiteRiceCooked_des =
    "إن الطاقة التي يحتاجها الجسم لممارسة رياضة كمال الأجسام تستمد من الكربوهيدرات، والتي يقوم الجسم بتحويلها إلى الجليكوجين المخزن في الكتلة العضلية، وتبعا لكون الأرز مصدرًا جيدًا للكربوهيدرات فيمكن عندئذ اعتماده كمساعد على زيادة الطاقة اللازمة لأداء التمارين، و لا يحتوي الأرز على الغلوتين، بالتالي لا يسبب الحساسية أو التهابات الأمعاء لمن يعانون من حساسية القمح أو الداء البطني.";
const brownRice_des =
    "يعد الأرز الغذاء الأساسي لنصف سكان العالم تقريبًا ويقدم العديد من الفوائد الصحية للجسم، وتحتوي أصناف الأرز جميعها على نسبة عالية من البروتين والكربوهيدرات، لكن تختلف في محتواها من الألياف الغذائية و يحتاج الأرز البني إلى وقت أطول كي يهضم؛ وذلك تبعًا لاحتوائه على الألياف الغذائية، وهذا ما يجعله خيارًا مناسبًا للوجبات الخاصة بالتمارين الرياضية الخاصة بكمال الأجسام، حيث يزود الجسم بالطاقة لمدة أطول من الأرز الأبيض.";
const brownRiceCooked_des =
    "يعد الأرز الغذاء الأساسي لنصف سكان العالم تقريبًا ويقدم العديد من الفوائد الصحية للجسم، وتحتوي أصناف الأرز جميعها على نسبة عالية من البروتين والكربوهيدرات، لكن تختلف في محتواها من الألياف الغذائية و يحتاج الأرز البني إلى وقت أطول كي يهضم؛ وذلك تبعًا لاحتوائه على الألياف الغذائية، وهذا ما يجعله خيارًا مناسبًا للوجبات الخاصة بالتمارين الرياضية الخاصة بكمال الأجسام، حيث يزود الجسم بالطاقة لمدة أطول من الأرز الأبيض.";
const basmatiRice_des =
    "هو عبارة عن مجموعة من أنواع الأرز طويل الحبة، ويعتبر الأرز البسمتي من تقاليد جنوب آسيا، ولهذا تكثر زراعته في الهند وباكستان، فهم لا يعرفون الأرز العادي التقليدي، وحبات هذا النوع من الأرز أسطوانية الشكل، طول الحبة منه حوالي 1 سنتيمتر، وزراعة هذا النوع تأخذ وقتاً طويلاً، حوالي المئة وثلاثين يوماً؛ لذلك يعتبر سعره مرتفع نسبة إلى الأنواع الأخرى من الأرز.";
const basmatiRiceCooked_des =
    "هو عبارة عن مجموعة من أنواع الأرز طويل الحبة، ويعتبر الأرز البسمتي من تقاليد جنوب آسيا، ولهذا تكثر زراعته في الهند وباكستان، فهم لا يعرفون الأرز العادي التقليدي، وحبات هذا النوع من الأرز أسطوانية الشكل، طول الحبة منه حوالي 1 سنتيمتر، وزراعة هذا النوع تأخذ وقتاً طويلاً، حوالي المئة وثلاثين يوماً؛ لذلك يعتبر سعره مرتفع نسبة إلى الأنواع الأخرى من الأرز.";
const oats_des =
    "الشوفان هو إحدى الخيارات المهمة للاعبي كمال الأجسام كونه يحتوي على كمية جيدة من الكربوهيدرات المعقدة حيث انها تمد الجسم بكمية كبيرة من الطاقة التي تبقى فترات طويلة، و تسهم الألياف الموجودة في الشوفان بالتقليل من المشاكل الهضمية التي قد يعاني منها الرياضيون نتيجة تناول كميات كبيرة من البروتينات.";
const wheatFlour_des =
    "يعد الدقيق الأبيض من أكثر أنواع الدقيق المستعمل في العديد من المخبوزات ومنتجات الطعام الجاهزة؛ وهو من المواد الغذائية التي تحتوي على المعادن والمغذيات إذ وفقاً لوزارة الزراعة الأمريكية فإن الدقيق الأبيض المدعم يحتوي على نسب جيدة جداً من السيلينيوم ، وفيتامينات ب. كما أنه يعتبر مصدر جيد للعديد من المعادن مثل: الحديد، والزنك، والفسفور، والنحاس.";
const pasta_des =
    "إن المعكرونة من الأطعمة سهلة التحضير، كما أنها غنية بالكربوهيدرات، ورغم فوائد المعكرونة الصحية، بما في ذلك توفير بعض العناصر الغذائية المهمة؛ مثل: الفيتامينات ب، واحتوائها على الألياف المشبعة، غير أن عدد السعرات الحرارية الذي تملكه المعكرونة لا يجعلها مناسبة لتصبح جزءًا من نظام غذائي يهدف إلى خسارة الوزن.";
const beadsCorn_des =
    "تعد أمريكا الوسطى الموطن الأصلي للذرة، إلّا أنها اكتسب شهرة وواسعة، ووصلت معظم دول العالم، فالذرة تعد من أكثر الحبوب شهرة حول العالم، وتتميز الذرة الصفراء بالعديد من الفوائد الصحية التي يمكن أن تزود الجسم بها، فهي من الحبوب الغنية بالألياف، والعديد من الفيتامينات، والمعادن، ومضادات الأكسدة، و يمكن أن يساعد المحتوى المرتفع من الألياف في الذرة في تخفيف أعراض الإمساك.";
const ferek_des =
    "الفريك هو منتج غذائي من حبوب القمح  تحصد سنابلها وهي خضراء طرية قبل جفافها وتعرض للحرارة عن طريق حرقها، ثم تسحق لتصبح حبيبات صلبة ومطحونة مثل جريش القمح الجاف ويكون حجمها أكبر من حبات البرغل. تتعدد وصفات طبخ الفريكة بمختلف المناطق، فتطبخ كالبرغل أو يصنع منها حساء في بلاد الشام والعراق ومصر والجزائر وغيرها من البلدان.";
const grit_des =
    "يعد البرغل عنصرًا شائعًا في العديد من أطباق الشرق الأوسط التقليدية، إذ له العديد من الفوائد الصحية والعناصر الغذائية بالإضافة إلى سهولة تحضيره، والبرغل هو حبوب صالحة للأكل مصنوعة من القمح المكسر والمجفف، كما يعد البرغل أحد أنواع الحبوب الكاملة، إذ إنه يحتوي على جميع أجزاء القمح ذات القيمة الغذائية العالية، ويمكن تحضيره بطرق مختلفة، كما يمكن صناعة العديد من المنتجات منه، كالمعكرونة، وبعض أنواع العجين.";
const barley_des =
    "حبوب الشعير مصدر مهم للألياف الغذائية والفيتامينات والمعادن، فتقلل من احتمال الإصابة بالعديد من الأمراض المزمنة؛ لاحتوائها على مجموعة من مضادات الأكسدة. كما تحتوي على مركبات حيوية تسهم في صحة الجهاز الهضمي وامتصاصه للعناصر الغذائية، و تساعد ألياف البيتا جلوكان الموجودة في الشعير في تخفيض مستوى الكوليسترول الضار في الدم.";
const couscous_des =
    "الكسكسي هو وجبة شمال إفريقية قديمة جدًا. يصنع الكسكسي من سميد القمح القاسي أو الذرة ويدور على شكل حبيبات صغيرة، ويتناول بالملعقة أو باليد. يطبخ بالبخار ويضاف إليه اللحم أو الخضار أو الفول الأخضر المقور أو الحليب أو الزبدة والسكر الناعم حسب الأذواق والمناسبات. وفي كل أقطار المغرب العربي يحضر الكسكس بوصفاته المختلفة ويقدم بالمرق، أو باللبن بدون مرق أو خضر فقط.";
const semed_des =
    "يحتوي السميد على كميات عالية من فيتامين ب9 (حمض الفوليك)، لذا يمكن الاعتماد عليه كمكمل غذائي عن طريق إضافته إلى الأطعمة اليومية، وتكمن أهميته للحامل بأنه يضمن نمو صحي للجنين، إضافة إلى ذلك، فالسميد من الأطعمة الغنية بالبروتين دون القلق من ضرر الدهون المشبعة، كما أنه غني بالحديد.";
const cornStarch_des =
    "يستخرج نشا الذرة من حبات الذرة، التي تزال جميع نخالتها وقشورها الخارجية، ليتبقى نسيج البذرة المليء بالنشا، المستخدم في المطابخ لأغراض الخبز والطهي؛ إذ يستعمل لإضفاء الملمس الكثيف لأطباق المرق، والشوربة، واليخنة، ويمتاز هذا المنتج بعدم احتوائه على الغلوتين، مما يجعل استهلاكه من أفضل الخيارات للأشخاص المصابين بمشكلات الهضم.";
const kettan_des =
    "الألياف الموجودة في بذور الكتان تساعد على الشعور بالشبع بشكل أسرع، وبالتالي فإنها قد تساعد على خسارة الوزن في حال تقليل كمية السعرات المستهلكة خلال اليوم، ويعتقد أن محتوى بذور الكتان من الألياف القابلة للذوبان قد يساهم في تخفيف الإسهال، إذ إن هذه الألياف ترتبط بالماء، مما يسبب زيادة في حجم البراز، وقد يساهم ذلك في الوقاية من حدوث الإسهال، كما أن هذه البذور تقلل أعراض الإمساك أيضاً، وذلك لمحتواها من الألياف غير القابلة للذوبان.";
const chia_des =
    "تحتوي بذور الشيا على نوعي الألياف الغذائية، حيث تساعد الألياف القابلة للذوبان على تقليل نسبة الكوليسترول في الدم، وعلى تنظيم نسبة السكر في الدم، وأما الألياف غير القابلة للذوبان فإنها تعد مهمة لصحة الجهاز الهضمي، وتساعد على منع الإمساك ،و تحتوي بذور الشيا على العديد من العناصر الغذائية الضرورية لصحة العظام، مثل: الفسفور، والمغنيسيوم، والبروتين، والكالسيوم؛ حيث توفر 28 غراماً من هذه البذور الكالسيوم بنسبة 18% من الكمية اليومية المرجعية وبالتالي فهي غنية بهذا العنصر.";
const semsem_des =
    "تعد بذور السمسم مصدراً ممتازاً لعنصر النحاس؛ الذي يساعد على تكوين خلايا الدم الحمراء، ويدعم وظائف الجهاز المناعي، وتحتوي بذور السمسم على نسبة عالية من الألياف الغذائية التي تساهم في المحافظة على صحة الجهاز الهضمي والقولون، حيث تحتوي قشور السمسم على الألياف غير القابلة للذوبان بنسبة أكثر من 26٪ مقارنة بنخالة الذرة، ونخالة القمح، ونخالة الشوفان، ونخالة الأرز، كما أن محتوى الألياف القابلة للذوبان  في قشور السمسم أعلى بكثير.";
const popcorn_des =
    "يعد الفشار من الأطعمة منخفضة السعرات الحرارية، ومصدراً غنياً بالألياف، وتساهم إضافته إلى النظام الغذائي اليومي في تعزيز الشعور بالشبع، مما يؤدي إلى استهلاك كميات أقل من الطعام، وبالتالي التقليل من الوزن، ولذلك فإن تناول الفشار كوجبة خفيفة بين الوجبات يعد صحياً، فهو قليل السعرات الحرارية، بالإضافة إلى احتوائه على نسب منخفضة من الدهون المشبعة والمتحولة، وعلى الرغم من ذلك يجب الاعتدال في تناوله.";
const kenwa_des =
    "تعتبر المركبات الكيميائية النباتية الموجودة في الكينوا مسؤولة عن خصائصها المضادة للأكسدة، والتي تساعد على تقليل خطر الإصابة بالأمراض المرتبطة بالإجهاد التأكسدي (Oxidative Stress)، وقد وجد أن مضادات الأكسدة مفيدة لبعض الأمراض؛ مثل أمراض القلب، والسكري، والسمنة، وغيرها ،كما تحتوي الكينوا على فيتامين هـ؛ وهو مركب مضاد للأكسدة، والذي قد يساعد على تقليل خطر الإصابة بأمراض القلب، وبعض أنواع السرطان، واضطرابات العين، كما تعد الكينوا مصدراً ممتازاً لللايسين (Lysine) حيث يعتبر اللايسين من الأحماض الأمينية الأساسية.";
const sambosa_des =
    "نشأت السمبوسة في الشرق الأوسط وآسيا الوسطى، ومن ثم انتشرت إلى إفريقيا، جنوب شرق آسيا، جنوب آسيا، وغيرها. يشير مصطلح السمبوسة وأشكاله إلى مجموعة من المعجنات الزلابية المشهورة في شمال شرق إفريقيا إلى غرب الصين. وصلت السمبوسة إلى شبه القارة الهندية، مع وصول الإسلام إلى الهند، أثناء الحكم الإسلامي في المنطقة، يمكن العثور على مدح لأكلة السمبوسة في قصيدة من القرن التاسع للشاعر الفارسي إسحاق الموصلي. وعثر على وصفات للطبق في كتب الطهي العربية من القرن العاشر حتى الثالث عشر، تحت أسماء سنبوسك وسنبوسق وسنبوسج، وكلها مستمدة من الكلمة الفارسية سنبوسك.";
///////////////////// -- Legumes List -- ///////////////////////
///////////////////////////////////////////////////////////////
const hummos_des =
    "إن لإحتواء الحمص على كميات جيدة من الألياف دورًا في تسهيل حركة الأمعاء عند الأشخاص الذين يعانون من الإمساك، والألياف تلعب دورًا مهمًا في صحة البكتيريا النافعة الموجودة في الأمعاء ووظيفتها؛ إذ أثبتت دراسة أُجريت في عام 2010 أن إضافة 200 غرام على الأقل من الحمص إلى النظام الغذائي اليومي تساعد في التقليل من وجود البكتيريا الضارة، وتحفز نمو البكتيريا النافعة.";
const lentil_des =
    "العدس هو بذور صالحة للأكل من عائلة البقوليات، وعلى الرغم من أنه عنصر غذائي شائع في أسيا وشمال أفريقيا إلا أن أكبر إنتاج للعدس في الوقت الحاضر في كندا، و يحتوي العدس على الألياف وحمض الفوليك، مما يعزز صحة القلب ويدعمها، وقد يساهم الإكثار من تناول الألياف في تقليل مستويات الكولسترول الضار، كما يحتوي العدس على البوتاسيوم والكالسيوم والمغنيسيوم، مما يساهم في خفض ضغط الدم طبيعيًا.";
const lentilBegebba_des =
    "يُوفِّر العدس كميات كبيرة من الفوليك أسيد الضروري لمنع العيوب الخلقية العصبية خاصةً عند الأجنة، بالإضافة إلى كونه يُقلِّل أيضًا من خطر الإصابة بسكر الحمل، ولذلك توصي مراكز السيطرة على الأمراض والوقاية منها بأن تستهلك الإناث في سن الإنجاب ما لا يقل عن 400 ميكروغرام من حمض الفوليك يوميًا، ويُنصح بزيادة الجرعة أثناء الحمل والرضاعة الطبيعية.";
const besella_des =
    "يمكن لتناول البازلاء أن يساهم في الحفاظ على صحة القلب، إذ تعد البازلاء الخضراء غنية بالألياف وباللوتين، والذي يعمل بصورة أساسية كمضاد للأكسدة ، إذ يحمي الخلايا من الأكسدة، ويحسن كل من الألياف واللوتين في البازلاء صحة القلب عن طريق خفض الكوليسترول ومنع تراكم البلاك على طول جدران الشريان.";
const whiteFasolia_des =
    "تعد الفاصوليا البيضاء مثالية لمرضى السكري، لأنها تحتوي على كميات عالية من الألياف، وتساعد على التقليل من مستويات السكر في الدم، كما أن الألياف تساعد على الشعور بالشبع لفترات طويلة، و ايضا للذين يبحثون عن مأكولات لزيادة الكتلة العضلية، إن الفاصوليا قد تكون الوجبة المثالية، لاحتوائها على كميات عالية من البروتين والألياف الهامان في عملية بناء الكتلة العضلية.";
const fool_des =
    "يحتوي الفول على نسبة كبيرة من الألياف، والبروتين، وايضا يحتوي الفول على نسبة كبيرة من الفولات وهي مادة طبيعية تساعد على نمو الجنين بشكل صحي وطبيعي، وأهمية الفولات تكمن في أنه يساعد على تكوين الخلايا والأعضاء العصبية، من فوائد الفول المدمس المهمة أنه يساعد في الحماية من الإصابة بهشاشة العظام، وذلك لأن الفول المدمس يحتوي على ما نسبته 36 بالمئة من احتياجات الجسم اليومية من معدن المنغنيز.";
const falafel_des =
    "من فوائد الفلافل أنه يحتوي على المعادن، حيث يقدم نصف كوب من الفلافل 3.42 مليغرام من الحديد و585 مليغرام من البوتاسيوم، وذلك ما يمثل 12 % من المدخول اليومي الموصى به من البوتاسيوم، كما تحتوي الفلافل على الزنك والكالسيوم والمغنيسيوم أيضًا، وكذلك الصوديوم، حيث تحتوي 100 غرام من الفلافل على 294 مليغرام من الصوديوم، وهو ما يمثل 13 % من المدخول اليومي الموصى به من الصوديوم.";
const soyaFool_des =
    "يعد فول الصويا من المصادر المهمة للبروتين، وعند وجود كمية كافية من البروتين في الجسم فإن ذلك سيحسن عملية التمثيل الغذائي في الجسم، وسوف يحسن الأداء العام في الجسم، ويعد فول الصويا أكثر فائدة للنساء من الرجال، حيث يقدم لهن العديد من الفوائد حيث انه يوفر للنساء حماية كبيرة ضد الإصابة بالسرطان ويلعب دورًا فعالًا في تخفيف آلام الدورة الشهرية ويزيد هرمون الإستروجين لديهن.";
const termes_des =
    "هناك نوعين من أنواع بذور الترمس إما بذور حلوة أو بذور مرة الطعم، والجدير بالذكر أن الترمس المر يحتوي على مواد سامة، لذلك يجب نقعه في الماء لمدة كافية حتى تزول هذه السموم قبل استخدامه كغذاء، و يحتوي الترمس الحلو على العديد من الفوائد والقيم الغذائية الأساسية والمفيدة لصحة جسم الإنسان، فهو مليء بالبروتينات، والألياف، وفيتامين B، والمعادن الأساسية للجسم.";
const whiteLubya_des =
    "تعد اللوبيا بصورة عامة من محاصيل البقوليات المهمة للغاية في العديد من أنحاء آسيا وإفريقيا وغيرها من المناطق ذات الطبيعة شبه القاحلة في العالم، وهذه النبتة متعددة الاستخدامات، وتنتمي إلى عائلة الحبوب من جنس Vigna، وتعد قادرة على النمو في المناخات القاسية التي لا ترحم، مثل: التربة الرملية، والصحراوية، وقليلة هطول الأمطار، مما يوفر للناس في تلك المناطق مصدرًا جيدًا للعناصر الغذائية الضرورية.";

///////////////////// -- Dairy List -- ///////////////////////
///////////////////////////////////////////////////////////////
const cheddarCheese_des =
    "الجبنة هي أحد أشهر منتجات الألبان التي لها الكثير من الأشكال والنكهات المختلفة، فهناك آلاف الأنواع من الجبنة تتراوح نكهاتها بين الخفيفة والناضجة، كما تتراوح كمية الدسم الموجودة بها من منخفضة إلى عالية، ويتم صناعة الجبنة من الحليب المأخوذ من الأبقار أو الأغنام والماعز وغيرها من الحيوانات، أما جبنة شيدر فيتم صناعتها من حليب البقر الكامل المبستر الذي يتم العمل عليه بطريقة معينة لينتج جبن متماسك بدون ثقوب، وله نكهة خفيفة أو لاذعة اعتمادًا على عمر الجبنة.";
const baramezanCheese_des =
    "جبن البارميزان، أو بارمجيانو ريجيانو، جبن معتق صلب حاد النكهة يصنع من حليب البقر، ويمتاز جبن البارميزان الأصلي بأنه يصنع في مناطق خاصة في إيطاليا دونًا عن غيرها، وفي أوقات خاصة من السنة بين شهر إبريل ونوفمبر، ويجب تعتيقه لمدة لا تقل عن سنتين حتى يخرج الجبن المميز بطعمه الغني الفاتح للشهية، ولونه الذهبي، وقوامه الهش المحاط بقشرة ذهبية داكنة، يتوفر جبن البارميزان في أغلب الأحيان مبشورًا، ويوجد على هيئة قوالب، ويستخدم في الطبخ أو يمكن الاستمتاع بتناوله منفردًا.";
const halomCheese_des =
    "تمتلك جبنة الحلوم ملمساً شبه صلب، ومرناً، ومضغوطاً، وقشرة خارجية خفيفة، ولا تحتوي على الثقوب أو الفتحات، ويمكن تقطيعها بسهولة، ويختلف لونها من الأبيض عند صناعتها باستخدام حليب الغنم أو الماعز، إلى الأصفر عند صناعتها باستخدام حليب البقر، و تعد جميع منتجات الألبان بما فيهم جبن الحلوم غنية بالكالسيوم، الذي يساعد على تكوين العظام والأسنان، والحفاظ على قوة الجسم، ومساعدة العضلات على حركتها، ونقل السيالات العصبية من الدماغ إلى باقي أجزاء الجسم.";
const rekotaCheese_des =
    "الريكوتا من أقدم أنواع الأجبان، يعود تاريخ صنعها إلى العصر البيزنطي، تعد من أنواع الأجبان الصحية وفوائد جبنة الريكوتا الصحية كثيرة وفيها نسبة الدهون والملح أقل نسبيًا، وهي جبنة إيطالية تصنع من المصل أو الجزء السائل من الحليب بعد فصله أثناء صناعة أنواع أجبان أخرى، سواءًا كان حليب بقر أو غنم أو ماعز وتصنع الريكوتا في بعض الأحيان من حليب الجاموس الإيطالي، الريكوتا من الأجبان الطازجة غير المعتقة التي تحتوي نسبة عالية من الماء وذات القوام الكريمي الطري والطعم الخفيف المائل للحلاوة مثل اللبنة أو جبنة القريش والجبن الكريمي والمسكربوني.";
const fetaCheese_des =
    "جبنة فيتا هي الجبنة الأشهر في اليونان، تصنع من حليب الغنم أو الماعز وحديثا من حليب البقر، وهي من الأجبان الطازجة غير المصنعة لونها ابيض وقوامها طري ونكهتها منعشة مالحة نتيجة وجودها في محلول ملحي، تعد فيتا الجبن الوطني في اليونان وهي معروفة منذ القدم ويعد بوليفيمس رائد الفيتا وكان يعتقها في كهفه، انتشرت جبنة فيتا في جميع أنحاء العالم ولاتزال تصنع بالطريقة التقليدية القديمة من قبل المزارعين الجبليين في اليونان حيث يبقى الجبن فيها محفوظة لأشهر.";
const creemCheese_des =
    "تعد الجبنة مصدرًا جيدًا للكالسيوم والبروتين، ولكنها تحتوي أيضًا على نسبة عالية من الدهون المشبعة والصوديوم، وهي غذاء يومي في جميع أنحاء العالم، حيث تشير الإحصاءات إلى أن الاستهلاك تضاعف ثلاث مرات من 1970 إلى 2009، وعلى الرغم من ذلك فهناك بعض الأشخاص يتجنبون الجبنة البيضاء بسبب الحساسية من الحليب أو عدم تحمل اللاكتوز، أو لأنهم يتبعون نظامًا غذائيًا لإنقاص الوزن أو يتبعون نظامًا غذائيًّا نباتيًّا، والجدير بالذكر أن الجبنة البيضاء تقدم عددًا من الفوائد الصحية.";
const mozarellaCheese_des =
    "جبنة الموزاريلا تكون باللون الابيض في الغالب ، ولكن قد يتغير لونها باللون المائل إلى الاصفر ، إعتماداً على الغذاء الذي يعطى للحيوان ، وهي شبه لينة بسبب الرطوبة العالية بها ، يمكن الاحتفاظ بالموزاريلا المنخفضة الرطوبة بشكل مبرد لمدة شهر ، وقد تكون متماسكة أو مبشورة بفترة صلاحية تصل إلى ستة شهور ، حيث تستخدم جبنة الموزاريلا في صناعة البيتزا ، والكثير من أنواع الباستا كالازانيا ، فيما يتعلق بالنوع الاول من أنواع جبنة الموزاريلا فهي تصنع من حليب جاموس الماء والتي تربى في إيطاليا ولاتسيو بالإضافة إلى كامبانيا ، أما النوع الثاني منها وهي الجبنة المصنوعة من حليب البقر وليس جاموس وهي قليلة التكلفة .";
const barameleCheese_des =
    "تساهم الجبنة في نمو العظام عند الأطفال والشباب، وفي الوقاية من هشاشة العظام، وذلك بسبب محتواها من البروتين، والكالسيوم، والمغنيسيوم، والفيتامينات A و D و K، والزنك، تعمل الجبنة البيضاء على خفض ضغط الدم، وعلى الرغم من أنها غنية بالدهون والصوديوم، إلا أن الكالسيوم يعمل على خفض الضغط الدموي، ومع ذلك ينصح بالجبن قليل الدسم وقليل الصوديوم.";
const rekfordCheese_des =
    "تحتوي الجبنة الزرقاء على نسبة عالية من الكالسيوم، وهو أحد العناصر الغذائية الضرورية للمحافظة على صحة العظام، لذا فإن إضافتها إلى النظام الغذائي يمكن أن يساعد على تقليل خطر الإصابة بالمشاكل الصحية المتعلقة بالعظام، إذ يرتبط تناول كمية كافية من الكالسيوم بانخفاض خطر الإصابة بهشاشة العظام، و يعد الجبن من المصادر الجيدة للبروتينات، كما يعد مصدراً جيداً لفيتامين ب12 للأشخاص الذين لا يتناولون اللحوم، إذ تحتوي 28 غراماً تقريباً من الجبنة الزرقاء على 14% من احتياجات الجسم اليومية لفيتامين ب12.";
const swissCheese_des =
    "الجبن السويسري  هو أحد أكثر أنماط الجبن شهرة في العالم في حين أن هناك العديد من الجبن التي تعود أصولها إلى سويسرا فإن معظم الأمريكيين يستخدمون “سويسري” كمنتج عام لجميع أنواع الجبن على الطراز السويسري المرقط بالثقوب ويطلق عليها أيضاً اسم “العيون” وهي ضرورية جداً للجبن السويسري.";
const oldCheese_des =
    "يتسبب الإفراط في تناول الجبنة القديمة بشكل يومي الكثير من مشكلات المعدة مثل الإصابة بالانتفاخات والغازات وعسر الهضم وكذلك الإمساك خاصة لدى الأشخاص الذين يعانون من مشكلة عدم تحمل اللاكتوز، كما أن الجبن منخفض الدهون أو عديم الألياف مما يصعب عملية هضم الطعام ما يتسبب في مشكلات المعدة المزعجة.";
const kareeshCheese_des =
    "يعرف جبن القريش بأنه جبن مصنوع من خثارة اللبن الرائب، ويمتلك نكهة خفيفة، ويمكن خلط هذا الجبن واستخدامه مع المكونات الحلوة كالفواكه، أو المكونات المالحة كالمعكرونة مع صلصة الطماطم، وتحتوي جبنة القريش على نسبة عالية من الفسفور الذي يساهم في المحافظة على صحة العظام، كما أنها تحتوي على الأحماض الأمينية التسعة الأساسية، والتي يجب الحصول عليها من الغذاء لأن جسم الإنسان لا يستطيع صنعها.";
const romyCheese_des =
    "تعد الجبنة الرومي من الأطعمة التي تحتوي على البروبيوتيك أو ما يعرف بالمعززات الحيوية بكميات كبيرة؛ ويعتقد أن فوائد الجنبة الرومي لتعزيز صحة الأمعاء تأتي بشكل أساسي من احتوائها على البروبيوتيك، ومن أهم هذه الفوائد المساهمة في خفض مستوى الحموضة في القولون مما قد يساعد على تخفيف الإمساك، و المساعدة على تخفيف الإسهال المرتبط باستخدام المضادات الحيوية، وذلك بإعادة تعزيز البكتيريا النافعة في الأمعاء.";
const tofoCheese_des =
    "جبن التوفو من الأطعمة الغنية بالبروتين المصنوعة من بقايا فول الصويا؛ والذي يعد من الأطعمة قليلة السعرات الحرارية والعالية بالكالسيوم والحديد، ويستطيع الشخص المعلومات الغذائية في الأسفل، ومن الأطعمة الخالية من الغلوتين التي يستطيع من يعانون من حساسية تجاه الغلوتين تناولها.";
const falamankCheese_des =
    "الجبنة الفلمنك أو الإيدام كما يطلق عليها، هي أحد افضل انواع الاجبان،  من حيث الطعم، إذ تتميز بمذاق فريد، فتجمع بين الطعم الكريمي الغني مع طعم مالح بسيط، وتعتبر الجبنة الفلمنك هولندية المنشأ، حيث بداية الصناعة، ويوجد منها عدة أنواع فالإيدام القديمة اي التي تركت فترة طويلة قبل الاستخدام ويكون الطعم فيها مركز أكثر واثقل، و تعتبر الجبنة الفلمنك أو الايدام أحد أهم مصادر فيتامين أ، كما إنها غنية جدا به فدوما ينصح به الأطباء.";
const kwarikCheese_des =
    "الكوارك هو جبن تقليدي دسم نباتي غير ناضج يتتبع أصله إلى البلدان الناطقة بالألمانية ودول أوروبا الشرقية. يتم تحضير هذا الجبن الأبيض الناعم والطازج من حليب البقر المبستر مع كمية صغيرة من المنفحة المضافة للحصول على خثارة جيدة وثابتة، و تعرف الأجبان بشكل عام بأنها مفيدة للجسم، حيث تحتوي على كم كبير من البروتينات والفيتامينات لأنها مستخلصة من الألبان.";
const akawiCheese_des =
    "انتشرت جبنة عكاوي بسهولة في منطقة الشرق الأوسط من البحر الأبيض المتوسط، وذلك بسبب طبيعتها السلسة، ونكهتها المالحة، وتصنع بطريقة خاصة من التمليح والتغميس، وسميت هذه الجبنة على اسم مدينة عكا في شمال فلسطين، وتعد قبرص ولبنان وسوريا المناطق الرئيسية لإنتاج جبنة العكاوي.";
const labnaCheese_des =
    "تعد اللبنة أحد منتجات اللبن المخمر الشهيرة في الشرق الأوسط، التي تميزت منذ آلاف السنين بنكهتها الغنية، وقوامها الخفيف، وتُعد منتجاً وسيطاً بين اللبن المخمر، والأجبان غير الناضجة، وهي ذات محتوى عالي من الماء.";
const cowMilk_des =
    "يعد الحليب مصدراً للعديد من الفيتامينات والمعادن، كالكالسيوم، وفيتامين د، وفيتامين ب12، والبوتاسيوم، وفيتامين أ، والزنك، والمغنيسيوم، وفيتامين ب1، بالإضافة إلى أنه يعد مصدراً ممتازاً للبروتين، والمئات من الأحماض الدهنية المختلفة، بما في ذلك الأوميغا 3، وحمض اللينولييك.";
const camelMilk_des =
    "حليب الإبل غني بالعديد من العناصر الغذائية المهمة للصحة العامة، عندما يتعلق الأمر بالسعرات الحرارية والبروتينات ومحتوى الكربوهيدرات، فإن حليب الإبل يمكن مقارنته بحليب البقر كامل الدسم، ومع ذلك، فهو يحتوي على نسبة أقل من الدهون المشبعة ويوفر المزيد من فيتامينC  وفيتامين  B والكالسيوم والحديد والبوتاسيوم، كما أنه مصدر جيد للدهون الصحية، مثل الأحماض الدهنية وحمض اللينوليك والأحماض الدهنية غير المشبعة، والتي تدعم صحة الدماغ والقلب.";
const sheepMilk_des =
    "على الرغم من الانتشار الكبير لحليب البقر في العالم، إلا أن استخدام حليب الأغنام ينتشر في بعض المناطق، كمناطق الشرق الأوسط، وذلك بسبب المناخ الذي يعد مناسباً أكثر لتربية الأغنام أو الماعز، ومن الجدير بالذكر أن حليب الأغنام يعد غنياً بالبروتينات، مما يجعله مناسباً لصنع الجبن، كما أن مصل حليب الأغنام يوفر العديد من الفوائد الصحية للإنسان، فهضم هذه البروتينات يوفر بعض أنواع الببتيدات التي تحتوي على خصائص مخفضة للضغط، ومضادة للأكسدة.";
const goatMilk_des =
    "يعد حليب الماعز مصدراً غنياً بالكالسيوم والفوسفور، ويتميز هذان العنصران بتوافرهما الحيوي العالي، وترسبهما في المطرس العظمي العضوي، مما يؤدي إلى تحسن تكوين العظام، كما يعد مصدراً جيّداً للزنك والسيلينيوم، وهي من العناصر الغذائية الأساسية التي تساهم في عمل مضادات الأكسدة، وتقليل خطر الإصابة بالأمراض التنكسية العصبية.";
const yoghurt_des =
    "يعرف اللبن الرائب بأنه سائل ناتج عن عملية إزالة طبقة الدهن بعد تمخيض القشدة في الزبدة، وتتم عملية صنع اللبن من خلال تحضير اللبن الرائب من الحليب الخالي من الدسم، أو قليل الدسم عن طريق تخميره بالبكتيريا التي تنتج حمض اللاكتيك الذي يضيف إلى اللبن الكثافة بشكل أكبر مقارنة مع اللبن العادي.";
const yogurt_des =
    "الزبادي يمكن أن يساعد على فقدان الوزن بسرعة أكبر، فالبكتيريا الجيدة في اللبن البروبيوتيك تساعد على تحسين عملية الأيض والهضم، وتعطي الشعور بالشبع لفترة أطول، بالإضافة إلى ذلك فإن وجود كمية عالية من الكالسيوم في اللبن يحث الخلايا الدهنية على ضخ كمية أقل من الكورتيزول، مما يسهل عملية إنقاص الوزن، أيضًا فإن الأحماض الأمينية في الزبادي تساعد على حرق الدهون.";
const kegda_des =
    "القشدة بالعامية قشطة أو قشطة الحليب ، هي إحدى منتجات الألبان وهي المادة المتزبدة على سطح الحليب بعد تسخينه تسخيناً هادئاً وجيداً (مدة طويلة) دون غليان، وسبب هذه المادة المتزبدة هو الدهون في الحليب التي تكون ذات كثافة قليلة لذا تطفوا على سطح الحليب بعد فترة من إبقاء الحليب ساكناً. يتم تعجيل هذه العملية في مصانع الألبان باستخدام أجهزة اسمها «الفواصل» التي تقول بعملية دوران سريع لقناني الحليب لكي يتم فصل مكونات الحليب حسب الكثافة وبالتالي يتم الحصول على طبقة القشدة.";
///////////////////// -- Bakery List -- ///////////////////////
///////////////////////////////////////////////////////////////
const egyptionBread_des =
    "يزود الخبز الجسم بالسعرات الحرارية من الكربوهيدرات بشكل رئيسي، وتعد الكربوهيدرات مصدر الطاقة الذي يفضله الجسم، ولذلك فإن تناول الخبز يمد الجسم بالطاقة اللازمة لممارسة الأنشطة اليومية، كما أن الخبز يساهم في موازنة مستويات السكر في الدم، وذلك بحسب إحدى الدراسات التي نشرت في مجلة Journal of Pharmacy and Pharmacology عام 2017.";
const whiteBread_des =
    "يحتوي الخبز على فيتامينات ب، التي تساهم في عمليات أيض البروتينات، وفيتامين هـ والسيلينيوم اللذين يمتلكان خصائص مضادة للأكسدة، وبعض المعادن الأخرى مثل الحديد المهم لنمو الخلايا وإيصال الأكسجين لها، والبوتاسيوم الذي يحافظ على صحة عمل خلايا الجسم، بالإضافة إلى الكالسيوم الذي يساهم في زيادة كثافة العظام.";
const fenoBread_des =
    "يعد الخبز من أهم الأطعمة التي يجب أن تتواجد على مائدة الطعام؛ فهو غني بالعديد من العناصر الغذائية المهمة، ويشكل غذاء أساسياً لدى الكثيرين، كما يعد المكون الأساسي في صنع السندويشات، فهنالك أنواع من الخبز مخصصة لإعداد السندويشات أبرزها خبز الصامولي، والذي يمتاز بشكله الأسطواني وإمكانية حشوه من الداخل بأي من المكونات المرغوب بها.";
const frenchBread_des =
    "يحكى أنه يعود أصل الخبز الفرنسي للبوادي النابولية، حيث أن هذه البوادي هي الأولى التي قامت بصنع الخبز بتلك الطريقة، حيث أن هذا الشكل صنعه الخباز نابليون الأول وذلك قصد جعل الخبز سهل النقل للجنود، من خلال وضعه في جيوب العسكر. ثم بعد ذلك تطورت صناعة هذا النوع من الخبز في باريس خلال سنوات العشرينيات من القرن العشرين.";
const kayzarBread_des =
    "يحتوي الخبز على عنصر الصوديوم بكمية جيدة، وعلى الرغم من أن تناول قطعة واحدة من الخبز لا يؤثر بشكل كبير في زيادة الكمية المتناولة يومياً من الصوديوم، إلّا أن تناول كميات كبيرة من الخبز بأنواعه المختلفة في أغلب الوجبات قد يؤدي إلى ارتفاع الصوديوم.";
const nokhalaBread_des =
    "أشارت إحدى الدراسات التي نشرت في مجلة Diabete & Metabolisme إلى أن تناول الخبز المرتفع بمحتواه من النخالة يساعد على التقليل من مستوى سكر الدم، وانخفاض جرعات الإنسولين، وذلك مقارنة مع استهلاك الخبز قليل النخالة أو الخبز العادي.";
const tamees_des =
    "خبز التميس هو أحد أنواع الخبز الشهية واللذيذة، ويعرف أيضًا باسم الخبز الأفغاني، ويعود في أصوله إلى أفغانستان وباكستان، ومنها أنتقل إلى السعودية وإلى الكثير من دول العالم العربي، ويعد الخبز بكل أنواعه من أهم المواد الغذائية التي تتوفر في جميع الوجبات، فهو من المواد الغذائية التي يحتاج إليها الناس بشكل يومي ولا يمكن الاستغناء عنها، فهو يحتوي على الكربوهيدرات والسعرات الحرارية التي تعد ضرورية لجسم الإنسان لإمداده بالطاقة اللازمة للقيام بوظائفه الحيوية.";
const korwasonCheese_des =
    "يعود أصل الكرواسون إلى فيينا عاصمة النمسا، وذلك عندما كانت فيننا واقعة تحت ضغط الحصار العثماني، الذي كان يحاول احتلال المدينة وذلك في عام 1683، وقد تمت صناعتها احتفالا بانتصار النمساويين على الحكم العثماني فصنعوا حلوى من الطحين على شكل هلال، ومن ثم انتشرت هذه الحلوى إلى كافة أنحاء المدن النمساوية، ومع تمازج الحضارات وانتقال العديد من الطباخين والخبازين النمساويين إلى فرنسا، وصلت تلك الفطيرة اللذيذة إلى فرنسا في عام 1889، وبدأت الفرنسيون بالتفنن بصناعتها وإضافة أفضل النكهات إلى حشوتها وسموها الكرواسون أي الهلال.";
const korwasonBudder_des =
    "يعود أصل الكرواسون إلى فيينا عاصمة النمسا، وذلك عندما كانت فيننا واقعة تحت ضغط الحصار العثماني، الذي كان يحاول احتلال المدينة وذلك في عام 1683، وقد تمت صناعتها احتفالا بانتصار النمساويين على الحكم العثماني فصنعوا حلوى من الطحين على شكل هلال، ومن ثم انتشرت هذه الحلوى إلى كافة أنحاء المدن النمساوية، ومع تمازج الحضارات وانتقال العديد من الطباخين والخبازين النمساويين إلى فرنسا، وصلت تلك الفطيرة اللذيذة إلى فرنسا في عام 1889، وبدأت الفرنسيون بالتفنن بصناعتها وإضافة أفضل النكهات إلى حشوتها وسموها الكرواسون أي الهلال.";
const donut_des =
    "الأمريكى هانسون جريجورى هو أول من اخترع الدونات عام 1847 حين كان عمره 16 عامًا وكان يعمل على متن سفينة لنقل الجير. وقيل إنه كان غير راض عن شكل الكعكة التى تقدم لهم فقرر أن يصنع هذه الكعكة ويضيف إليها جوزة الطيب والقرفة وقشر الليمون ويضع البندق أو الجوز فى منطق الكعكة.";
const cinnabon_des =
    "يتمتع الأشخاص بتناول لفائف القرفة في السويد خلال استراحة شرب القهوة أو ما يسمى بالفيكا والتي تمثل لقاء الأصدقاء. و يحتفل باليوم الوطني للسينابون في 4 أكتوبر.";
const mafin_des =
    "تشير بعض المصادر إلى ارتباط كعك المافن بنوع يوناني الأصل من المخبوزات كان يسمى مافولا وهي الكلمة اليونانية التي تشير إلى الكعكة المخبوزة على موقد أو صينية، كما ترجح مصادر أخرى ارتباطها بالخبز الفرنسي الطري الذي كان يعرف باسم موبان وقد حرفت الكلمة فيما بعد لتصبح مافن.";
const pancake_des =
    "تعود وصفة البان كيك إلى سيدة من أصل أفريقي “نانسي غرين” والتي كانت تعرف باسم “العمة جميما”، والتي تبنتها شركة مطاحن “Pearl Milling Company”، وأطلقت على منتجاتها “Aunt Jemima”. أما في معرض شيكاغو فكانت العمة جميما مسئولة عن تحضير البان كيك أمام الناس.";
const poksomat_des =
    "البقسماط هو نوع من الكعك المحمص مرتين ومجفف تماماً. للكلمة تنوعات إقليمية، أي حسب اللهجة ويختلف الباحثون على تحديد أصل الكلمة فمنهم من يقول أنها تركي عثماني نقلت عن اليونانية ومنهم من يقول يوناني ومنهم من يقول بأن اليونان اشتقوها من لفظ مصري قديم. يؤكل البقسماط، أو القرشلة، مع الشاي أو الحليب.";
const cookies_des =
    "تعتبر الكوكيز حلوى أصلها من بلاد فارس وبدأ ظهوره في القرن السابع الميلادي. وانتقل لبلاد أوروبا عن طريق الفتح الإسلامي للأندلس. ثم انتقل بعدها إلى أميركا في القرن السادس عشر. يعرف الكوكيز في عدد كبير من البلدان منها الولايات المتحدة على أنه نوع من البسكويت المقرمش.";
const pitzaCheese_des =
    "صُنعت البيتزا لأول مرة في مدينة نابولي الإيطالية خلال القرنين الثامن عشر والتاسع عشر، وكانت تعد حينها من الوجبات السريعة منخفضة التكلفة لتناسب العمال أثناء عملهم وتنقلهم، وانتشرت بسرعة في مدينة نابولي الساحلية بسبب مكوناتها البسيطة وسهولة حملها، إذ أجبر الاكتظاظ السكان المحليين على إيجاد طرق سهلة وسريعة لإطعام عائلاتهم.";
const feteer_des =
    "الفطير المشلتت طبق من المطبخ المصري وهو عبارة عن طبقات من العجين الرقيق مدهونة بالسمنة والزيت والزبدة والمحمرة في الفرن ويقدم إلى جانبها السكر الناعم والعسل ويعشقها الكبار والصغار وأصبحت مشهورة ولها محلات خاصة في أغلب الدول العربية.";
const bati_des =
    "هو أحد أنواع المخبوزات التي تكون ملفوفة الشكل، ينتشر تحضيرها بشكل كبير في معظم دول العالم؛ حيث تقدم كطبق جانبي خفيف إلى جانب الأطباق الرئيسية الأخرى. هناك العديد من الحشوات التي يمكن استخدامها لحشو الباتيه، وإذا أردت إعداد الباتيه كطبق رئيسي حضريه بعدة حشوات.";
const maamool_des =
    "المعمول له تاريخ يمتد إلى عهد الفراعنة، فالنقوشات التي تحملها حبة المعمول في ذلك الوقت ما هي إلا رسمة للشمس، التي عرفت عند الفراعنة بالإله آتون، أحد آلهة الفراعنة، كما تشير كتب التاريخ. حيث كان الفراعنة يضعون المعمول مع الموتى داخل المقابر، وقد استمر المصريون في صنعه وتقديمه في الأعياد أو عند زيارة الموتى والقبور إلى أيامنا هذه.";
const sable_des =
    "سابليه وصفة من المطبخ الفرنسي ، اشتهرت في معظم أنحاء العالم. وهي عبارة عن قطع صغيرة من البسكويت. تحضر السابليه من الطحين، السكر، الزبدة، البيض، الفانيليا، قشر حامض مبشور، بايكنغ باودر.عادة تحشى السابليه بمربى المشمش أو مربى الفريز ويرش فوقها سكر ناعم للتزيين.";
const batonsale_des =
    "الباتون ساليه عبارة عن نوع من المعجنات التي تعرف أيضاً بأصابع الكمون، وتمتاز بسهولة تحضيرها وسرعة إعدادها كما يمكن صنعها باستخدام العديد من المكونات مثل الكمون والزعتر والجبنة، وتمد جسم الإنسان بالأملاح والكربوهيدرات والمعادن والألياف والبروتينات.";
const biscets_des =
    "يعرف البسكويت بأنه من المخبوزات الغربية، حيث يعود أصل الاسم في اللغة الإيطالية إلى كلمة بيسكوتي (biscotti) تعني أي نوع من الكعك الصغير المحلى أو المقرمشات، التى تقدم عند تناول وجبة الإفطار، واشتهر بعد ذلك فى جميع الدول العربية، بنفس المكونات مع بعض الإضافات المختلفة .";
const kahk_des =
    "يرغب الكثير من الأشخاص بتناول كعك العيد، ولكن قد يخشى البعض من تأثيره في النظام الغذائي المتبع لخسارة الوزن، ولكن بشكل عام؛ يمكن تناول أطعمة العيد المفضلة التي لا تتوفر في أي وقت آخر من العام، مثل كعك العيد، شرط تناولها بكميات صغيرة فقط، كما يجب التأكد من احتسابها ضمن السعرات الحرارية المحددة للنظام الغذائي لذلك اليوم.";
const kahkDates_des =
    "يرغب الكثير من الأشخاص بتناول كعك العيد، ولكن قد يخشى البعض من تأثيره في النظام الغذائي المتبع لخسارة الوزن، ولكن بشكل عام؛ يمكن تناول أطعمة العيد المفضلة التي لا تتوفر في أي وقت آخر من العام، مثل كعك العيد، شرط تناولها بكميات صغيرة فقط، كما يجب التأكد من احتسابها ضمن السعرات الحرارية المحددة للنظام الغذائي لذلك اليوم.";
const betifor_des =
    "البيتيفور من الحلويات اللذيذة، التي تقدم في العديد من المناسبات الاجتماعية، والأعياد، وهي ذات أصول غير عربية، فالبتيفور من الحلويات فرنسية المنشأ، التي صنعت إبان الثورة الفرنسية في القرن الثامن عشر، وأصل تسميتها جاء من طريقة خبزها، وتعني الأفران الصغيرة.";
const tost_bread_des =
    'يعود تاريخ خبز التوست إلى مصر القديمة منذ حوالى 6000 سنة، حيث كان يلجأ المصريون إلى تحميص الخبز كسبيل للمحافظة عليه. نشر بعدها الرومان فكرة التوست في بريطانيا قبل أن تصل إلى أميركا. وتأتي كلمة "توست" من الكلمة اللاتينية “Tostum” التي تعني الحرق وبالتالي فإن معنى التوست هو "الخبز المحروق". كان يحمص التوست في القدم عبر إمساكه فوق النار أو عبر وضعه على حجر ساخن قبل أن يتم اختراع محمصة الخبز الكهربائية في التسعينيات.';
///////////////////// -- Dessert List -- ///////////////////////
///////////////////////////////////////////////////////////////
const basbosa_des =
    "البسبوسة هي أحد أنواع الحلويات الشرقية التي اشتهرت في المطبخ الشامي، ثم انتقلت منه لتصل إلى العديد من المطابخ العربية، ولعلّ أبرز ما يميزها مذاقها اللذيذ وطعمها الخفيف، إضافة لإمكانية إعدادها وحشوها بنكهات متنوعة مثل: الشوكولاتة، والقشطة، والكريمة، والكاسترد.";
const konafa_des =
    "يقال ان صانعي الحلوى في الشام هم من اخترعوا وابتكروا الكنافة بجانب القطائف، وقدموهما خصيصًا إلى معاوية بن أبي سفيان، حينما كان واليًا على الشام، حيث يُقال إن معاوية كان أول من صنع الكنافة من العرب حتى إن اسمها ارتبط به فقالوا «كنافة معاوية». و كان معاوية يحب الأكل، فشكا إلى طبيبه ما يلقاه من جوع في الصيام، فوصف له الطبيب الكنافة التي كان يتناولها في فترة السحور حتى تمنع عنه الجوع في نهار رمضان.";
const kataef_des =
    "بعض الروايات تقول ان القطايف تعود للعصر العباسي ومنهم من يقول الأموي، ويقال أن أول من تناول القطايف هو الخليفة الأموي سليمان بن عبد الملك سنة (98 هجري) في رمضان، وهناك العديد من الرويات حول تسمية القطايف بهذا الاسم، حيث إن هذه الرواية تعود للعصر الفاطمي، حيث إن الطهاة كانوا يتنافسون في تحضير أنواع الحلويات في الشهر الفضيل، وكانت فطيرة القطايف من ضمن هذه الحلويات، وتم تحضيرها بشكل جميل ومزينة بالمكسرات ومقدمة بطبق كبير، وكان الضيوف يتقاطفونها بشدة للذتها، بينما يرجع بعض المؤرخين أصل تسمية القطائف بهذا الاسم لتشابه ملمسها مع ملمس قماش القطيفة.";
const zenb_des =
    "القصة تبدأ من منطقة السيدة زينب: الأخت الكبرى للإمام الحسين ابن الإمام على بن أبى طالب، زوج فاطمة ابنة النبى محمد عليه السلام. أثناء زيارتها مصر، قدمت لها هذه الحلوى كنوع من حسن الاستقبال. ومنذ ذلك اليوم عُرفت «أصابع زينب» بهذا الاسم.";
const remoshElset_des =
    "يقال إن هذه الحلوى المصنوعة من الدقيق والسمن والسكر تعود إلى فترة ولاية مصطفى بربر أغا المولود في عام 1767 على طرابلس والذي أقام حفلاً في قصره وقدم الطاهي حلوى على شكل رموش النساء فاقترح أحد الحاضرين أن تتم تسميتها رموش الست.";
const baklawa_des =
    "التسمية العربية جاءت مُشتقة من أصلها التركي ولكن حسب قاموس هانز فير فإن التأثيل الشعبي لكلمة بقلاوة العربية نسبت من كلمة بقوليات، بسبب دخول الفول السوداني في إعداد هذه الحلوى. ومن الممكن أن تكون مشتقة من كلمة بايلاو من اللغة المنغولية والتي تعني الربط واللف.";
const sugar_des =
    "عندما تزيد نسبة السكريات يقوم الجسم بإفراز هرمون الأنسولين الذي يعمل على تنظيم السكريات في الدم، ولكنه يعمل أيضا على وقف حرق الدهون في الجسم، وهو يعمل بذلك على وقف صرف السعرات الحرارية. وعند قلة إنتاج الأنسولين يرتفع معدل حرق الدهون في الجسم ، ومن المهم ملاحظة أن السكر لا يسبب زيادة الوزن والسمنة في حد ذاته، ولكنه يعد أحد الأسباب العديدة لزيادة الوزن أو السمنة، إذ إنه ينتج عن النظام الغذائي، والنشاط البدني، والوراثة، والعوامل الاجتماعية والبيئية، ولكن يعد التقليل من كمية السكر في النظام الغذائي أحد أبسط الطرق لتقليل زيادة الوزن.";
const balahElsham_des =
    "بلح الشام هو حلوى سورية المنشأ ويرجع سبب تسميتها إلى سبب ابتكارها، وقام صانعوا الحلوى بإنتاج صنف يشبه البلح في تشكيله، ومن هنا أطلق عليه بلح الشام، حيث تشكل العجينة وتسقى بالقطر، وينتشر تناولها في السعودية مصر وبلاد الشام والعراق وتركيا والسودان.";
const gollash_des =
    "الجلاش من المأكولات الخفيفة الشهية المحببة للكثيرين والتي اشتهرت في بلاد الشام ومصر. والجلاش هو عبارة عن رقائق عجين تحضر بطريقة معينة ويتم حشو هذه العجينة بحشوات مختلفة؛ فيمكن حشوها بالمكسرات، أو الجبن، أو القشطة؛ وبذلك نحصل على طبق حلوى يسمى الجلاش الحلو (الكلاج). وقد يتم حشوها باللحم المفروم ويسمى الجلاش المالح، وبذلك نحصل على صنف من أصناف الطعام، وبكلا النوعين يعتمد الجلاش بشكل كبير على العجينة، فإذا تم تحضير عجينة جيدة حصلنا على الجلاش اللذيذ.";
const omAli_des =
    '"أم على" هى الزوجة الثانية للملك عز الدين أيبك الذى تزوجته "شجر الدر" ليكون ملك البلاد ظاهريا لرفض الشعب بأن يتولى زمام الأمور امرأة وظلت تدير البلد تحت غطاء عز الدين أيبك إلى أن قتلته، وهنا ظهرت زوجته الثانية أم "على" لتأخذ بثأر زوجها ووالد طفلها فدبرت لقتلها وأبرحتها ضربا بالنعال إلى أن قتلتها، وبمناسبة مقتل شجر الدر صنعت "أم على" أكلة من الدقيق والسكر والسمن والرقائق ووزعتها على الكافة احتفالا بموت شجر الدر ومن هنا أطلقوا عليها أكلة "أم على".';
const keremKaramel_des =
    "كريم كراميل هو نوع من أنواع الكاسترد العادي (crème) حيث يُسكب شراب السكر المطبوخ إلى مرحلة الكراميل في القالب قبل إضافة خليط الكاسترد. وبعد إضافة خليط الكاسترد يتم طهيه في حمام مائي إما على الموقد أو في الفرن عادة. بعد ان ينضج يجب تركه في البراد مدة كافية حتى يتماسك قوامه جيداً.";
const kaster_des =
    "من الحلويات التي يفضلها شريحة كبير من الناس على اختلاف فئات أعمارهم ، هي حلى الكاسترد ، التي من الممكن تحضيرها إما من خلال شراء مسحوق الكاسترد الجاهز من السوق ، أو من خلال تحضيرها في المنزل ، بالإضافة لإمكانية إعداد الكاسترد بنكهات مختلفة مثل الكاسترد بالشوكولاته أو الكاسترد بالقهوة.";
const lokmetElkadi_des =
    "سبب تسميتها بلقمة القاضي يعود للقرن الثالث عشر وبالتحديد في مدينة بغداد، حيث كانت تقدم للقضاة، ويتناولونها كلما أحسوا بالجوع، فتوفر عليهم الوقت، إذ أنها عبارة عن لقيمات صغيرة سريعة الالتهام.";
const rozBelaban_des =
    "الأرز باللبن هو طبق يتكون بشكل أساسى من الأرز، والماء أو الحليب، إضافة إلى مكونات أخرى كالقرفة والزبيب، يتم تقديمه على أنه طبق حلوى أو وجبة غداء رئيسية؛ حيث يضاف إليه السكر فى حال كان حلوى، ويشتهر بكونه من الحلويات فى مناطق الدول العربية وتركيا.";
const chocolate_des =
    'تبرز الشوكولاته المرة أو الداكنة كأفضل أنواع الشوكولاته ذات القدرة الفائقة على تحسين المزاج وتقليل الاكتئاب، كونها تحوي الكاكاو بكمية عالية إضافة لبعض القلويات مثل مادتين "الثيوبرومين" والفينيثليمين"، وهو مواد مرتبطة بمادة "السيروتونين" أو ما يعرف بهرمون السعادة في الجسم، ويساعد تناول الشوكولاته على إفراز هرمون "الأندرومورفين" وهو هرمون فعال يهدئ الجسم ويحسن الحالة المزاجية ويخفف من حدة الإكتئاب. كما أن الشوكولاته غنية بمادة التربتوفان، التي تسهم في رفع مستويات هرمون السعادة، وتقليل نسبة الاكتئاب عن طريق التأثير على الناقلات العصبية المرتبطة بالحالة المزاجية في الدماغ.';
const honey_des =
    "عسل النحل هو مادة حلوة يخرجها النحل من بطونه مما يجمعه من رحيق الأزهار، وهو غذاء هام يحتوي على سكريات أغلبها أحادي وخمائر وأحماض أمينية وفيتامينات متنوعة ومعادن. ويصنع العسل من رحيق الأزهار الذي تجمعه شغالات النحل من الأزهار المتنوعة ،ويعزز تناول العسل الطبيعي من مضادات الأكسدة، مثل البوليفينول، والتي تلعب دوراً في الوقاية من الأمراض القلبية. و يساعد استخدام العسل موضعياً في علاج الجروح والحروق.";
