import 'package:food_app/constants.dart';

class DietTypesAssets {
  int id;
  final String title, subtitle, image, des;
  final int proteinPer, carbPer, fatPer;

  DietTypesAssets(
      {required this.id,
      required this.title,
      required this.subtitle,
      required this.image,
      required this.des,
      required this.proteinPer,
      required this.carbPer,
      required this.fatPer});
}

List<DietTypesAssets> dietTypesList = [
  DietTypesAssets(
      id: 1,
      title: "دايت الكيتو",
      subtitle: keto_diet_subtitle,
      image: "assets/images/keto_diet.jpg",
      des: '''
مبدأ عمل دايت الكيتو:
يهدف هذا النظام الغذائي إلى تحويل الجسم إلى آلة حرق للدهون وذلك بإجباره على استخدام الدهون كمصدر للطاقة بدلًا من سكر الجلوكوز المتواجد في الكربوهيدرات، إذ تتحطم هذه الدهون في الكبد وتتحول إلى كيتونات تنتقل عن طريق الدم إلى الأعضاء الداخلية والعضلات وحتى الدماغ لتستخدمها كمصدر بديل للطاقة، ويتحقق ذلك بتقليل كمية الكربوهيدرات المتناولة لتصل إلى 5 % من اجمالي الاحتياج اليومي من السعرات.

في أنظمة الدايت الأخرى , عندما يتناول الشخص الاكلات الغنية بالكربوهيدرات( النشويات و السكريات) تتحول الكربوهيدرات الى جلوكوز فيرتفع سكر الدم, فيقوم الجسم بإفراز هرمون الأنسولين الذي يعمل على تنظيم السكريات في الدم، ولكنه يعمل أيضا على وقف حرق الدهون في الجسم.
ولكن المميز في نظام الكيتو هو ان مستوى الانسولين في الدم دائما منخفض ,بالتالي يتم حرق الدهون المخزنة في الجسم و الدهون الزائدة بشكل مستمر.

مميزات دايت الكيتو:
1-انقاص الوزن: يحتوي نظام الكيتو على نسبة دهون كبيرة (من 70% الى 80%) من اجمالي السعرات وكما تعلم ان الدهون تأخذ وقتا أطول في عملية الهضم , فبالتالي يقل احساسك بالجوع و الرغبة في الاكل بشكل كبير مما يؤدي الى نقصان في الوزن.
2- النشاط الدائم , تحسين الذاكرة والادراك.
3- التقليل من فرصة الإصابة ببعض الامراض مثل: السكري , و مرض ألزهايمر.
4- التقليل من فرصة الإصابة ببعض أنواع السرطان.

سلبيات دايت الكيتو:
عندما يبدأ الشخص في اتباع نظام الكيتو يدخل في حالة تسمى keto flu وتتراوح بين يومين الى 10 أيام , تختلف المدة والاعراض من شخص الى اخر وعندما تنتهي الاعراض يكون الشخص قد دخل في مرحلة ketosis (اخذ الطاقة من الدهون بدل من الكربوهيدرات).
أعراض الكيتو فلو او بمعني أصح انسحاب الكاربوهيدرات من الجسم:
- الصداع.
- الدوخة.
- الم في المعدة.
- غثيان.
- خفقان القلب او زيادة ضربات القلب.
- الم بالجسم او العضلات
- الرغبة الشديدة للسكريات او مايسمي بالكريفنج.
- عدم التركيز.
- الارق وعدم القدرة علي النوم.
- الشعور بالاجهاد والرغبة في النوم.

للتغلب على اعراض الكيتو فلو وتجاوز هذه المرحلة بأمان يجب عليك:
- المحافظة علي تناول كميات كافية من المياة لتعويض الجسم الكميات الكبيرة المفقودة .
- زيادة ملح الصوديوم في الطعام لتعويض النقص .
- الاهتمام بتناول مكمل المغنسيوم يوميا .
- تناول الخضروات الورقية والافوكادو لتعويض نقص البوتاسيوم بالجسم.

الأطعمة التي يجب تجنبها:
يجب خلال دايت الكيتو الحد من الأطعمة السكرية، والحبوب، والنشويات، والفواكه، والبقوليات حيث أن جميع هذه الأطعمة تحتوي على نسبة عالية من الكربوهيدرات.
''',
      proteinPer: 20,
      carbPer: 5,
      fatPer: 75),
  DietTypesAssets(
      id: 2,
      title: "الدايت المتوازن",
      subtitle: balanced_diet_subtitle,
      image: "assets/images/balanced_diet.jpg",
      des: '''
هو اسهل أنواع الأنظمة الغذائية لأنه يحتوي على جميع العناصر الغذائية من بروتين وكربوهيدرات ودهون صحية و يعتمد بشكل الأساسي على حساب السعرات للوصول لهدفك.
اذا كنت تريد الحصول على كتلة عضلية و زيادة الوزن يتم اضافة من 300 الى 1000 سعرة الى الاحتياج الاساسي من السعرات, اما اذا كنت تريد خسارة الوزن يتم انقاص من 500 الى 1000 سعرة من الاحتياج الأساسي من السعرات.
ويقوم هذا التطبيق بعمل جميع الحسابات الدقيقة و الازمة للتأكد من تقديم الرقم الصحيح من احتياجك اليومي من السعرات والبروتين والكربوهيدرات والدهون الصحية للوصول لهدفك.
و يجب عليك الحرص على اختيار نوعية الاكل المناسبة للوصول الى هدفك في اسرع وقت و زيادة الصحة العامة للجسم , كالحرص على تناول الخضروات للحصول على الفيتامينات والمعادن و تجنب السكريات والحلويات و الوجبات السريعة.
''',
      proteinPer: 25,
      carbPer: 40,
      fatPer: 35),
  DietTypesAssets(
      id: 3,
      title: "الدايت منخفض الكربوهيدرات",
      subtitle: lowCarb_diet_subtitle,
      image: "assets/images/low_carb_diet.jpg",
      des: '''
هو نظام غذائي يهدف إلى الحد من تناول الكربوهيدرات كتلك الموجودة في الأطعمة السكرية، والخبز، والمعكرونة، في حين يشجع على تناول الأطعمة الغنية بالبروتين، والدهون الصحية.

الكربوهيدرات هي أحد أنواع العناصر الغذائية الرئيسية التي يحتاجها الجسم للعمل بشكل سليم، حيث يكسر الجسم الكربوهيدرات لتزويد الجسم بالطاقة فوراً، أو تخزينها في الكبد، والعضلات، حتى يحتاجها الجسم، فإن لم يتم استخدامها، يقوم الجسم بتحويلها لدهون، وبالتالي فإن فكرة عمل نظام لو كارب الغذائي تقوم على أساس أن يحرق الجسم بعض الدهون المخزنة بدلاً من الكربوهيدرات، مما يعزز فقدان الدهون، وانخفاض الوزن.

وجدت الأبحاث التي أجريت في مجلة نيو إنجلاند الطبية عام 2003 أن الأشخاص الذين اتبعوا نظاماً غذائياً منخفض الكربوهيدرات قد فقدوا وزناً أكبر مقارنة بالأشخاص الذين اتبعوا نظاماً غذائياً قليل الدهون.

عندما يتجنب الفرد السكر، والنشويات، تميل مستويات السكر في الدم إلى الاستقرار، وتقل مستويات الهرمون المسؤول عن تخزين الدهون. يساعد هذا في زيادة حرق الدهون، ويجعل الفرد يشعر بمزيد من الشبع، مما يجعله يقلل بشكل تلقائي من تناول الطعام، ويؤدي في النهاية إلى فقدان الوزن.

بعض النصائح التي يجب مراعتها عند اتباع الدايت منخفض الكربوهيدرات:
1- يجب التقليل من عدد مرات اكل النشويات خلال اليوم وليس تقليل الكمية فقط.
2 - يفضل عمل صيام متقطع بجانب هذا النظام لتحقيق افضل النتائج.
3- النشويات المسموحة هي: البقوليات ، البطاطس، البطاطا، الفاكهة، الشوفان.
4- يجب تجنب اكل السكريات.
5 - النشويات التي يفضل تجنبها: المعكرونة، الخبز والمعجنات.
6 - يفضل عدم تناول الفواكه بشكل يومي.
''',
      proteinPer: 25,
      carbPer: 20,
      fatPer: 55),
  DietTypesAssets(
      id: 4,
      title: "الصيام المتقطع",
      subtitle: fasting_diet_subtitle,
      image: "assets/images/fasting_diet.jpg",
      des: '''
يعد الصيام المتقطع (Intermittent Fasting) طريقة لتنظيم الدايت و ليس نوع دايت، بمعنى انه يمكن ان تتبع نظام غذائي اخر وبجانبه تقوم بعمل الصيام المتقطع.
و ينصح أخصائيين التغذية بإتباع نظام صيام المتقطع و خصوصا بجانب دايت الكيتو او الدايت منخفض الكربوهيدرات لتحقيق افضل النتائج و زيادة الصحة العامة.
الصيام المتقطع يشبه الصيام الاسلامي و لكن يسمح خلال فترة الصيام بتناول سوائل خالية من السكر فقط، مثل الماء، والقهوة، والشاي.
وتكون ساعات النوم ضمن ساعات الصيام.

فوائد الصيام المتقطع:
1- خسارة الوزن: يساعد الصيام المتقطع على خسارة الوزن ودهون البطن، دون الحاجة إلى التقليل من السعرات الحرارية بشكل كبير، ولكن من خلال تحفيز حرق دهون الجسم المخزنة من أجل الحصول على الطاقة، بالإضافة تحسين عملية الأيض.

2- السيطرة على سكر الدم والوقاية من السكري: يقلل نظام الصيام المتقطع من مقاومة الأنسولين، ويخفض مستوى السكر في الدم بما يعادل 3 – 6%، ومستوى الأنسولين أثناء الصيام بما يعادل 20 – 31%، والذي يحمي بدوره من الإصابة بالسكري من النوع الثاني.

3- تحسين صحة القلب: يقلل من مستوى الكوليسترول، والدهون الثلاثية، والسكر في الدم، وكل هذه الأمور تشكل خطراً على صحة القلب.

4- تحسين صحة الدماغ: يساعد على إعادة بناء خلايا عصبية جديدة في الدماغ ويسهم في الوقاية من الزهايمر.

5- محاربة الشيخوخة: يرجح أن يزيد رجيم الصيام المتقطع من متوسط عمر الفرد حيث أظهرت بعض الأبحاث أن متوسط عمر الفئران يزيد بما يعادل 36- 83 %، وما زال هناك حاجة للمزيد من الدراسات على البشر لتأكيد ذلك.

6- الوقاية من الالتهابات: يقلل هذا النوع من الحميات الغذائية من مستوى الالتهاب في الجسم؛ وبالتالي يقي من العديد من الأمراض المزمنة.

انواع الصيام المتقطع:
نذكر فيما يلي أساليب الصيام المتقطع الأكثر شيوعاً:
- الصيام المتقطع 12 ساعة:
وهو الصيام المتقطع للمبتدئين إذ يعد نظام الصيام 12 ساعة والإفطار 12 ساعة خياراً جيداً لمن يريد البدء باتباع حمية الصيام المتقطع لأن فترة الصيام قصيرة نسبياً، و تكون فترة النوم ضمن ساعات الصيام.

- نظام الصيام المتقطع 16/8:
تعد هذه الطريقة من الصيام المتقطع الأكثر شهرة، وتقوم على الصيام لمدة 16 ساعة، واقتصار فترة تناول الطعام على 8 ساعات خلال اليوم، فمثلاً يمكن تناول الطعام من الساعة الواحدة ظهراً وحتى الساعة التاسعة مساء، ومن ثم يصوم الشخص لمدة 16 ساعة.

- الصيام لمدة 24 ساعة (الاكل – التوقف – الاكل):
يتضمن هذا النظام الامتناع عن الطعام مدة 24 ساعة كاملة، مثلاً، عدم تناول الطعام من بعد وجبة العشاء في يوم ما حتى موعد وجبة العشاء في اليوم التالي. ويسمح خلال فترة الصيام بتناول سوائل خالية من السكر فقط، مثل الماء، والقهوة، والشاي. ويمكن تطبيق هذه الطريقة مرة أو مرتين في الأسبوع.

- نظام 5:2 
يشمل هذا النظام اختيار يومين غير متتاليين خلال الأسبوع، وتناول ما لا يزيد عن 500 - 600 سعرة حرارية خلالهما، وتناول الطعام بالشكل الاعتيادي المعتدل خلال باقي أيام الأسبوع.

- الصيام يوم بعد يوم:
يطلق على هذا النظام اسم حمية المحارب أو الأسلوب العسكري، ويعد من أوائل الأنظمة الغذائية التي تتضمن الصيام المتقطع، ويشمل تناول كميات صغيرة من الفاكهة والخضروات النيئة أثناء النهار، وتناول وجبة كبيرة في المساء خلال فترة تتراوح 4 ساعات فقط.

تاثير الصيام المتقطع على الجسم:
فيما يلي بعض التغييرات التي يمكن أن تطرأ على الجسم عند اتباع هذا النظام الغذائي:
1- هرمون النمو: يرتفع هرمون النمو، والذي بدوره يفيد في خسارة الدهون وبناء العضلات.
2- الأنسولين: تتحسن حساسية الجسم للأنسولين مما يقلل من مستوى الأنسولين الذي يسهم بدوره في التخلص من دهون الجسم المخزنة.
3- الإصلاح الخلوي: يدخل الجسم خلال الصيام في عملية الإصلاح الخلوي، ويتضمن هذا ما يسمى بالتهام الذات، حيث تقوم الخلايا بالتهام وإزالة البروتينات القديمة التي لا تعمل والتي تتراكم داخل الخلايا.
4- التعبير الجيني: تحدث تغييرات في وظيفة الجينات المرتبطة بطول العمر والحماية من المرض.
''',
      proteinPer: 0,
      carbPer: 0,
      fatPer: 0),
  DietTypesAssets(
      id: 5,
      title: "دايت PSMF",
      subtitle: psmf_diet_subtitle,
      image: "assets/images/psmf_diet.jpg",
      des: '''
نظام PSMF الغذائي، وهو اختصار (protein-sparing Modified Fast) أي حمية الصوم المعدل الحافظة للبروتين، وجد هذا النظام منذ السبعينات، وذلك عندما بدأ الأطباء بالتوجه، والبحث عن الأنظمة الغذائية كوسيلة لمساعدة المرضى الذين يعانون من السمنة المفرطة في إنقاص الوزن.
اكتسب دايت PSMF انتشاراً واسعاً خلال العقود القليلة الماضية، حيث يعد أحد أسرع الأنظمة الغذائية في تحقيق نزول الوزن مقارنة مع غيره من الأنظمة الغذائية، ولكن خضع نظام PSMF لعدة تعديلات على مدى السنوات القليلة الماضية، وأصبح العديد من الأشخاص يبدأون باتباع هذا النظام الغذائي دون إشراف طبي؛ الأمر الذي قد يكون خطراً عليهم لما قد يسببه هذا النظام الغذائي من المشاكل الصحية، مثل نقص التغذية.
يعرف نظام PSMF بأنه عبارة عن نظام غذائي منخفض السعرات الحرارية للغاية، يهدف إلى إنقاص الوزن وفقدان الدهون، مع مراعاة الحفاظ على كتلة العضلات.
يقيد دايت PSMF استهلاك السعرات الحرارية بشدة، بالإضافة إلى تقليل كمية الكربوهيدرات، والدهون على نحو كبير، وفي المقابل زيادة تناول الأطعمة الغنية بالبروتين.
و يعد هذا النظام غذائي مناسب لفئتين من الناس:
1-اذا كان الشخص يعاني من الوزن الزائد بشكل كبير.
2- لاعبي كمال الاجسام الذين يريدون الوصول لأفضل شكل قبل الدخول في البطولة وفي اسرع وقت ممكن.

يتضمن نظام PSMF مرحلتين، وفي ما يلي توضيح لكل مرحلة:
المرحلة الاولى
- تسمى المرحلة المكثفة من دايت PSMF، يسمح فيها بتناول أقل من 800 سعرة حرارية في اليوم، مع مراعاة أهمية أن تأتي معظم هذه السعرات الحرارية من الأطعمة الغنية بالبروتين، مثل: الدجاج، أو بياض البيض، أو التوفو، أو السمك.
- الأصل في اتباع نظام PSMF أن يتم تحت إشراف طبي، وأخصائي تغذية، وذلك حتى يتم تحديد الكمية المناسبة من البروتين لكل شخص حسب حاجته ووزنه.
- يسمح دايت PSMF بتناول 20 – 50 غراماً فقط من الكربوهيدرات يومياً، وهذا يعادل حوالي قطعتين من الخبز، أو حبتين إلى ثلاث حبات من الفاكهة، ولا يسمح بالدهون المضافة مثل الزيوت.

المرحلة الثانية 
- تسمى مرحلة إعادة التغذية، أو إعادة التجهيز، حيث يتم زيادة السعرات الحرارية من الكربوهيدرات والدهون تدريجياً، وفي المقابل تقليل البروتين.
- تصل زيادة مستويات الكربوهيدرات إلى 45 غراماً خلال الشهر الأول، وتصل إلى 90 غراماً خلال الشهر الثاني.
- يتم تقليل البروتين اليومي بنحو 40 غراماً شهرياً.
- لا يوجد تقليل صارم للسعرات الحرارية اليومية خلال هذه المرحلة من مراحل دايت PSMF، ولكن على العكس هناك زيادة في السعرات الحرارية بشكل طبيعي مع إضافة الكربوهيدرات والدهون، مع الحرص على التوازن في كمية الأطعمة المتناولة.
- يسمح بالأطعمة البروتينية، والحبوب الغنية بالألياف، والفواكه، والخضروات، والأطعمة قليلة الدسم خلال مرحلة إعادة التغذية.

سلبيات نظام PSMF :
قد تحقق الأنظمة الغذائية منخفضة السعرات الحرارية مثل حمية PSMF فقداناً سريعاً للوزن، ولكنها تنطوي غالباً على مخاطر أخرى واحتمالية عالية لاستعادة الوزن بمجرد التوقف عن اتباع النظام الغذائي.
و يعد اتباع نظام PSMF يكون خياراً فعالاً لفقدان الوزن، ولكنه يعتبر نظام غذائي مقيد للغاية، وذات سعرات حرارية منخفضة للغاية، لذلك يمكن أن يكون مصدر خطر حقيقي في التسبب بنقص التغذية المرضي إذا لم يتم اتباعه على نحو صحيح، ومتابعته تحت إشراف وتوجيه أخصائي تغذية.
هناك بعض الآثار الجانبية التي قد يسببها نظام PSMF نظراً لقلة السعرات الحرارية اليومية، ومنها:
صداع الرأس.
الشعور بالإعياء.
الدوخة عند الوقوف.
تشنجات العضلات.
حساسية للبرد.
إمساك.
إسهال.
رائحة فم كريهة.
تغيرات في الحيض عند النساء.
تساقط الشعر وتغير في كثافته.
تغير في المزاج.
انخفاض في الطاقة.
''',
      proteinPer: 0,
      carbPer: 0,
      fatPer: 0),
  DietTypesAssets(
      id: 6,
      title: "دايت Carb Cycle",
      subtitle: carbCycle_diet_subtitle,
      image: "assets/images/carb_cycle.jpg",
      des: '''
يميل لاعبي كمال الأجسام الى هذا النظام الغذائي و خصوصا قبل البطولات لأنه يساعد بشكل كبير على طرد المياه المخزنة في الجسم.
هناك قاعدة أساسية يجب عليك معرفتها وهي انه اذا توافرت هذه العناصر الثلاثة في الجسم يبدأ الجسم في حبس المياه تحت الجلد و هي :
1-الكربوهيدرات  2- الملح  3-المياه
ونظام الكارب سايكل يعتمد على انك تقوم بأخذ كمية قليلة من الكربوهيدرات و بتالي يقوم الجسم بطرد المياه الزائدة المخزنة فيه.
وهو قريب من حيث المبدأ من الدايت المتوازن , لانه يحتوي على كمية كربوهيدرات معقولة ولا يوجد فيه حرمان من أي نوع من أنواع العناصر الغذائية.
الدورة تتم على مدار 5 الى 6 أيام وهي كالاتي:
يتم تقليل نسبة الكربوهيدرات بشكل تدريجي مع شرب الكثير من المياه
اليوم الذي ترفع فيه نسبة الكربوهيدرات ,تقلل فيه نسبة الدهون , وتكون نسبة البروتين ثابتة
واليوم الذي ترفع فيه نسبة الدهون, يجب ان تقلل فيه نسبة الكارب , وتكون نسبة البروتين ثابتة.
ويجب عليك الحصول على اشراف من قبل مختص اذا اردت اتباع هذا النوع من أنواع الأنظمة الغذائية.
''',
      proteinPer: 0,
      carbPer: 0,
      fatPer: 0),
];
