class ArticleImage {
  static const String article1 = "assets/images/articlesImages/article1.jpg";
  static const String article2 = "assets/images/articlesImages/article2.jpg";
  static const String article3 = "assets/images/articlesImages/article3.jpg";
  static const String article4 = "assets/images/articlesImages/article4.jpg";
  static const String article5 = "assets/images/articlesImages/article5.jpg";
  static const String article6 = "assets/images/articlesImages/article6.jpg";
  static const String article7 = "assets/images/articlesImages/article7.jpg";
  static const String article8 = "assets/images/articlesImages/article8.jpg";
  static const String article9 = "assets/images/articlesImages/article9.jpg";
  static const String article10 = "assets/images/articlesImages/article10.jpg";
  static const String article11 = "assets/images/articlesImages/article11.jpg";
  static const String article12 = "assets/images/articlesImages/article12.jpg";
  static const String article13 = "assets/images/articlesImages/article13.jpg";
  static const String article14 = "assets/images/articlesImages/article14.jpg";
  static const String article15 = "assets/images/articlesImages/article15.jpg";
  static const String article16 = "assets/images/articlesImages/article16.jpg";
  static const String article17 = "assets/images/articlesImages/article17.jpg";
  static const String article18 = "assets/images/articlesImages/article18.jpg";
  static const String article19 = "assets/images/articlesImages/article19.jpg";
  static const String article20 = "assets/images/articlesImages/article20.jpg";
  static const String article21 = "assets/images/articlesImages/article21.jpg";
  static const String article22 = "assets/images/articlesImages/article22.jpg";
  static const String article23 = "assets/images/articlesImages/article23.jpg";
  static const String article24 = "assets/images/articlesImages/article24.jpg";
  static const String article25 = "assets/images/articlesImages/article25.jpg";
  static const String article26 = "assets/images/articlesImages/article26.jpg";
  static const String article27 = "assets/images/articlesImages/article27.jpg";
  static const String article28 = "assets/images/articlesImages/article28.jpg";
  static const String article29 = "assets/images/articlesImages/article29.jpg";
  static const String article30 = "assets/images/articlesImages/article30.jpg";
}

class ArticleDescription {
  static const String article1 = '''
يعتبر البروتين واحد من العناصر الغذائية الأساسية في جسم الإنسان، وواحد من المكونات الأساسية في تكوين نسيج الجسم، يتكون البروتين بصورة رئيسة من مجموعة أحماض أمينية متصلة ببعضها البعض عبر روابط ببتيدية، ويمكن أن نقسم الأحماض الأمينية حسب أهميتها الغذائية وتوفرها إلى 3 اقسام:
1- احماض امينية اساسية : لا يصنعها الجسم، ويجب تناولها في الغذاء.
وهي (فالين ، تربتوفان ،ثريونين ،فينيل ألانين ،مثيونين، لايسين، ليوسين، آيزوليوسين).\n
2- احماض امينية شبه اساسية: يستطيع الجسم تخليقها ولكن ليس بكميات كافية، خاصة في مرحلة النمو؛ ويحبذ أن تتوفر في الغذاء.
وهي (أرجنين ، هستيدين).\n
3- احماض امينية غير اساسية: متوفرة في الجسم السليم بكميات دائمة، ويمكن للجسم تصنيعها، ولا تستلزم حضورها في الغذاء.
وهي (ألانين، أسباراجين، حمض الأسبارتيك، سيستين، جلوتامين، جلوتاميت، جلايسين، برولين، سيرين، تيروسين).\n
الفرق بين البروتين النباتي والبروتين الحيواني هو ان البروتين الحيواني يحتوي على جميع الأحماض الأمينية التي يحتاجها الجسم ويمكن الحصول على البروتين الحيواني من اللحوم والأسماك والدواجن والبيض ومنتجات الألبان على العكس تمامًا من البروتين النباتي الذي يفتقر إلى واحد أو أكثر من الأحماض الأمينية ويمكن الحصول على البروتين النباتي من الفول والعدس والمكسرات.\n
ويعد تناول البروتين النباتي مهم إذ يحتوي على عناصر مغذية مختلفة عن البروتين الحيواني، والتي تؤثر بصورة مختلفة على صحة الجسم، ومن أبرز فوائد البروتين النباتي؛ تقليل مخاطر ارتفاع نسبة الكولسترول في الجسم.\n
لذلك ينصح الخبراء بأحتواء كلا من البروتين الحيواني والنباتي في النظام الغذائي وينصح ايضا ب تنوع مصادر البروتين النباتي للحصول على الاحماض الامينية كاملة.
''';
  static const String article2 = '''
تعرف الأحماض الدهنية أوميغا 3، أو أوميجا 3 (بالإنجليزية: Omega-3)، بأنها إحدى أنواع الدهون المتعددة غير المشبعة التي يحتاجها الجسم لأداء العديد من الوظائف المهمة؛ كبناء خلايا الدماغ، كما أنها تشكل جزءاً رئيسياً من الأغشية الخلوية في الجسم، وعلى الرغم من أن جسم الإنسان يمكنه صناعة معظم أنواع الدهون؛ إلا أنه لا يستطيع صنع الأوميغا 3، وإنما يحصل عليها من مصادره الغذائية.\n
و من فوائد الأحماض الدهنية أوميغا 3:
الحفاظ على صحة الكلى.
التقليل من فرط كوليسترول الدم.
 التخفيف من الاكتئاب.
 التقليل من خطر التصلب المتعدد.
التخفيف من الالتهاب المفصلي الروماتويدي .\n
يؤثر نقص أوميغا 3 في صحة الجسم، وقد يسبب هذا النقص بعض المشاكل الصحية، والتي نذكر منها ما يأتي:
الإكتئاب : حيث أشارت مراجعة نشرتها مجلة Journal of Nutrition & Intermediary Metabolism عام 2016 إلى أن نقص أحماض أوميغا 3 الدهنية الأساسية بما فيها حمض الإيكوسابنتاينويك، وحمض الدوكوساهيكسانويك يزيد من خطر الإصابة بالاضطراب الاكتئابي. 
الأمراض الجلدية: إذ ان نقص بعض الأحماض الدهنية الأساسية؛ كأوميغا 3 يمكن أن يتسبّب بحدوث مشاكل جلدية، مثل: تقشر الجلد، وخشونته، بالإضافة إلى التهاب الجلد.
''';
  static const String article3 = '''
النوم هو عملية بيولوجية معقدة، تساعد الجسم على معالجة المعلومات الجديدة والشعور بالراحة والحفاظ على صحة جيدة، فبينما يكون الشخص نائمًا تكون وظائف أعضاء الجسم المختلفة بما في ذلك الدماغ نشطة.
 وهناك خمس مراحل للنوم، وتختلف عن بعضها باختلاف نمط موجات الدماغ خلال كل مرحلة، وقد يتغير معدل التنفس وضربات القلب ودرجة الحرارة من مرحلة لأخرى، ويعتمد مقدار أو عدد ساعات النوم الذي يحتاجه الجسم على عدة عوامل، بما في ذلك العمر ونمط الحياة والصحة بشكل عام، وما إذا كان الشخص قد حصل على قسط كاف من النوم مؤخرًا.\n
يساعد الحصول على ساعات كافية من النوم الصحي على تحسين صحة الجسم عمومًا، ويشتمل ذلك على تعزيز التركيز والذاكرة ووظائف الدماغ جميعها، كما قد يُسهم ذلك تعزيز صحة القلب والأوعية الدموية، وفيما يأتي سيتم ذكر أهمية النوم الصحي:
1- التحكم بالوزن وتحسين الأداء الرياضي: يميل الأشخاص الذين لا يحصلون على قسط كاف من النوم إلى تناول الكثير من السعرات الحرارية، كما يكون لديهم شهية أكبر لتناول الطعام، حيث يزيد ذلك على مستويات هرمون الجريلين، وهو الهرمون الذي يحفز الشهية، ويقلل من مستويات هرمون الليبتين، وهو الهرمون الذي يكبح الشهية، وبالتالي يساعد النوم الصحي على تقليل السعرات الحرارية المستهلكة، كما يعمل على تحسين الأداء الرياضي، ففي دراسة أجريت على لاعبي كرة السلة، تبين أن النوم لفترات أطول يحسن بشكل ملحوظ من السرعة والدقة والإنتاجية للاعبين.\n
2- تحسين تركيز وإنتاجية الشخص: يعد النوم مهمًا جدًا لوظائف الدماغ المختلفة، ويتضمن ذلك الإدراك المعرفي والتركيز والإنتاجية والأداء بشكلٍ عام، وجميع الوظائف تلك تتأثر بشكل سلبي في حال تم الحرمان من النوم، وفي دراسة أجريت على المتدربين الطبيين بحيث اتبع المتدربون جدول زمني مع ساعات عمل طويلة لأكثر من 24 ساعة، تبين أنهم تسببوا بأخطاء طبية أكثر خطورة بنسبة 36 % من أولئك الذين اتبعوا جدولا يسمح لهم بالحصول على مزيد من ساعات النوم.\n
3- تحسين المزاج والصحة القلبية: يقوم الدماغ أثناء النوم بمعالجة المشاعر أيضًا، وعندما لا يحصل الشخص على ساعات كافية من النوم الصحي، تنتج ردود فعل عاطفية سلبيةً على المواقف التي يواجهها الشخص في حياته اليومية، ويمكن أن تزيد قلة النوم المزمنة خطر الإصابة باضطراب المزاج، مما قد يزيد من احتمالية إصابة الشخص بالاكتئاب، وبالإضافة إلى ذلك، يسهم النوم في تعزيز صحة القلب، إذ ينخفض ضغط الدم أثناء النوم، ممّا يمنح القلب والأوعية الدموية قسطًا من الراحة، وكلما قلت ساعات النوم كلما ارتفع ضغط الدم خلال دورة مدتها 24 ساعة، الأمر الذي يمكن أن يؤدي إلى الإصابة بأمراض القلب المختلفة، بما في ذلك السكتة الدماغية.
''';
  static const String article4 = '''
يقضي الإنسان تقريبًا ثلث حياته نائمًا ويجب الحصول على قسط جيد من النوم في الليل وقد تكون الساعات الثمانية للنوم ليلا أولوية لمن يعانون من قلة النوم ويعتبر النوم مؤشر على الرفاهية والصحة العامة وهناك معلومات قد لا تعرفها عن النوم وهي كالآتي:
1 . الإنسان هو الكائن الثديي الوحيد الذي يعمل على السهر وتأخير نومه.
2. كلما زاد الارتفاع عن سطح الأرض زاد تزداد اضطرابات النوم وذلك لنقص مستويات الأكسجين.
3. ممارسة الرياضة تحسن من النوم ولكن ممارسة الرياضة بشكل متقطع أو قبل النوم مباشرة إلى الإصابة بالأرق.
4  . يحتاج الأشخاص الأصحاء إلى النوم لمدة تتراوح بين 7إلى 9 ساعات يوميًا في حين اكتفاء بعض الأشخاص بستة ساعات وحاجة بعض الأشخاص للنوم أكثر من عشر ساعات.
5.الحاجة إلى القيلولة تختلف من شخص لآخر.
6 . السبب الرئيسي للنوم المفرط هو الحرمان الذاتي للنوم.
7. كلما قل الحصول على قسط كاف من النوم تزيد الشهية لارتفاع هرمون الليبتين.
8. ترتبط زيادة معدلات الأرق بالعمر.
9. الشخير من الأسباب الرئيسية لاضطراب النوم.
10. العامل الذي يعمل في مناوبات أكثر عرضة للإصابة بالأمراض المزمنة كأمراض القلب والأوعية الدموية واضطرابات الجهاز التنفسي.
''';
  static const String article5 = '''
للحصول على نوم صحي ومريح طول الليل يجب التفكير في العوامل التي تسبب الأرق والتقلب على الجنبين وذلك من خلال اتباع بعض النصائح البسيطة وتجنب العوامل التي تؤثر على النوم وذلك من خلال معلومات قد لا تعرفها عن النوم وبناء عادات صحية للتشجيع على النوم بصورة أفضل وهذه النصائح كلآتي :
- الالتزام ببرنامج النوم وذلك بالحفاظ على عدد ساعات نوم محددة ومواعيد نوم واستيقاظ ثابتة.
- الحذر من الطعام والشراب بمعنى عدم الذهاب للنوم في حالة الجوع أو تناول وجبات دسمة قبل النوم وتجنب النيكوتين والكافيين.
- البحث عن بيئة مريحة للنوم مثلا تعمل الغرفة الهادئة والمظلمة على تسهيل النوم .
- التقليل من الغفوات خلال النهار حيث تكون غفوة واحدة في وقت مبكر من النوم ولا تتجاوز 30 دقيقة وتجنب الغفوة المتأخرة.
- تحويل ممارسة الأنشطة البدنية إلى روتين يومي .
- اعتماد الأنشطة التي تبعث على الهدوء كالاستحمام والاسترخاء قبل النوم.
- قضاء الوقت خارج المنزل.
- التخفيف من القلق والتفكير الزائدين قبل النوم.
''';
  static const String article6 = '''
1- حرق الدهون: تقسم أنواع الدهون داخل الجسم إلى قسمين؛ دهون بيضاء وهي مضرة ويجب التخلص منها، ودهون بنية تكون مفيدة للجسم في إنتاج الطاقة وإعطائه الدفء، حيث إن الاستحمام بالماء البارد يخفف من درجة حرارة الجسم، وبالتالي تقوم الدهون البنية بحرق السعرات الحرارية من أجل تدفئته وتزويده بالطاقة، وبالتالي يساعد على حرق الدهون والمساعدة في تخسيس الوزن.\n
2- تقوية عضلات الرياضيين: عادة ما يستحم اللاعبون الرياضيون بالماء البارد بعد التدريب، مما يساعد على علاج التهاب العضلات وعودتها إلى وضعها الطبيعي.\n
3- تحسين المزاج وزيادة النشاط: حيث إن الماء البارد يعمل على تضييق الأوعية الدموية، ويحتاج بعدها الجسم إلى إعادة ضخ الدم من القلب إلى هذه الأوعية كي تعود إلى وضعها الأصلي، وهذا يساعد على القضاء على السموم والشوائب الموجودة في هذه الأوعية، ويحقق النشاط للجسم، وهذا ملائم لأولئك الذين يشعرون بالكسل في الصباح عند الذهاب إلى عملهم.\n
4- تقوية الجهاز المناعي: حيث إن الاستحمام بالماء البارد يعمل على رفع معدلات الأيض، ويزيد من خلايا الدم الحمراء في الدم، وهذا يحمي الجسم من الأمراض مثل الإنفلونزا، ويعزز الحهاز المناعي أيضاً.\n
5- مفيد للشعر وللبشرة: حيث إنه يحد من ظهور حب الشباب، ويعمل على تضييق مسامات البشرة وشدها، كما أنه يعطي الشعر لمعاناً جميلاً، بعكس الماء الساخن الذي يعمل على تجفيف البشرة والشعر والأظافر.\n
يوجد المزيد من الفوائد للاغتسال بالماء البارد، منها:
- تقليل الاكتئاب: حيث إنه يعمل على تحفيز الدماغ، وبالتالي إنتاج هرمون النورادرينالين الذي يحد من الاكتئاب.
- تحسين عملية التنفس: حيث إن الماء البارد يعمل على فتح الرئتين، مما يسمح بدخول كمية أكبر من الأكسجين وتعميق التنفس.
- زيادة إفراز الهرمونات وتحسينها: مثل زيادة أعداد الحيوانات المنوية عند الرجل، كذلك يعمل على زيادة إفراز الإنسولين في الدم الذي يرفع من معدل حرق السكر.
- تنظيم درجة حرارة الجسم وتنشيط أجهزة الإصلاح الموجودة فيه.
- زيادة نشاط عضلة القلب ويقويها.
''';
  static const String article7 = '''
1- تنشيط الدورة الدموية: يساعد الماء الساخن المندفع نحو الجلد في تنشيط حركة الدماء المارة عبر الأوعية الدموية القريبة من الجلد، وذلك من خلال توسيع حجمها والسماح للدم بالتدفق بحرية وسرعة أكبر بداخلها، كما يساعد الماء الساخن في التخفيف من حدة أوجاع العظام والمفاصل وأربطتها، وعلى الرغم من أن العلم لم يتوصل بعد إلى علاج نهائي لآلام المفاصل إلا أن حمام ساخن يساعد في التخفيف منها.\n
2- تنقية الجلد: يتسبب انسداد المسامات لفترات طويلة في تراكم السموم وتكاثر الفطريات والبكتيريا بداخلها، مما يؤدي إلى ظهور البثور وغيرها من التهابات الجلد المختلفة، ويمكن للبخار المنبعث من الحمام الساخن فتح هذه المسامات وتنظيفها من السموم المتراكمة بداخلها، كما تساعد المياه الباردة بعد ذلك في غلق هذه المسامات بشكل فوري ومنع تراكم السموم فيها مرة أخرى.\n
3- الاسترخاء: يساعد الحمام الساخن في استرخاء العضلات والتخلص من التشنج الحاصل بها، خاصةً بعد ممارسة التمارين الرياضية الشاقة أو النوم على مرتبة قاسية لساعات طويلة، حيث تساعد سخونة المياه في زيادة حجم الأنسجة وانفتاحها عن بعضها البعض خاصةً في أماكن التشنجات.\n
4- تخفيف تصلب العنق والأكتاف: يستخدم الحمام الساخن في التخفيف من التصلب الحادث في منطقة العنق والأكتاف كبديل فعال عن التدليك والمساج، وذلك من خلال ترك المياه الساخنة تندفع على تلك المناطق لعدة دقائق مع البدء بتنفيذ بعض حركات المساج الدائرية هناك للمساعدة على استرخاء العضلات المتصلبة فيها.\n
5- التخفيف من حالات الرشح والكحة: يساعد بخار الماء المتصاعد أثناء الاستحمام على التخلص من البلغم المسبب للكحة والسعال، كما يساعد في تنقية فتحات الأنف والقضاء على مسببات الرشح الموجودة فيها، وذلك عن طريق استنشاق أكبر قدر من بخار الماء خلال الاستحمام، كما يمكن فتح الفم للسماح لبخار الماء بالدخول بكميات أكبر إلى الرئتين.\n
6- التخلص من الإجهاد والتوتر: يعتبر الحمام الساخن من المهدئات الطبيعية للأعصاب وخلايا الدماغ، وذلك لقدرته على التخلص من حالات الإجهاد والتوتر والحفاظ على الجسم مسترخياً.
''';
  static const String article8 = '''
يوفر الكافيين (Caffeine) العديد من الفوائد الصحية لجسم الإنسان، وفيما يأتي بيان بعض هذه الفوائد حسب درجة فعاليتها بشيء من التفصيل:
- تحسين حالة المصابين بالصداع النصفي: إذ أشارت إحدى الدراسات التي نُشرت في مجلة (The Journal of Headache and Pain) عام 2017 أن استخدام الأدوية التي تحتوي على الكافيين مع أدوية أخرى مستخدمة لتخفيف الصداع كالباراسيتامول، أن الكافيين كان آمنًا وفعالًا في السيطرة على ألم الصداع النصفي الحاد.\n
- تحسين القدرات المعرفية التي تقل مع التقدم في السن: إذ أظهرت إحدى الدراسات التي نشرت في مجلة (The journal of nutrition, health & aging) عام 2015 أن استهلاك الكافيين قد ساهم في الحفاظ على الوظائف الإدراكية للدماغ لدى الأفراد المصابين بالخرف أو الزهايمر، إلا أنه يجدر التنويه إلى ضرورة إجراء المزيد من الدراسات للتحقق من صحة هذه النتائج.\n
- تقليل خطر الإصابة بالسكري من النوع الثاني: يُشار إلى أن شرب القهوة والكافيين قد يقلل من خطر الإصابة بمرض السكري من النوع الثاني، إذ أظهرت إحدى الدراسات التي نشرت في مجلة (Nutrition, Metabolism and Cardiovascular Diseases) عام 2018 أن تأثير الكافيين على مرضى السكري مرتبط بالجرعة المستخدمة، إذ إن شرب كوبين من القهوة يوميًا قلل من خطر الإصابة بمرض السكري من النوع الثاني بنسبة أعلى من شرب كوب من القهوة.\n
- المساهمة في تعزيز الذاكرة: أظهرت إحدى الدراسات التي نُشرت في مجلة (Frontiers in psychology) عام 2016 أن القهوة تمتلك تأثير إيجابي على ذاكرة الطلاب عند شربها في الصباح الباكر، ويُشار أن التأثير كان ملحوظا على الطلاب عند تقديمهم للامتحانات في الصباح الباكر.\n
- تخفيف أعراض مرض باركنسون: أظهرت إحدى الدراسات التي نُشرت في مجلة (Neurology) عام 2017 أن شرب القهوة ساعد على تحسين بعض الأعراض التي تظهر على الأفراد المصابين بمرض باركنسون كتعزيز المعرفة، إلّا أنّه لم يقلل من شلل الرعاش المرتبط بمرض باركنسون.
''';
  static const String article9 = '''
لمحة عامة حول القهوة:
تمتلك شجرة القهوة أوراقاً تنمو مقابل بعضها البعض في أزواج، وتنمو حبوب البن على طول الفروع، وعادة ما تقلم أشجار القهوة بشكل قصير للحفاظ على قوتها، وتسهيل حصادها، ونظراً لأنَّها تنمو في دورة مستمرة فيمكن رؤية الزهور، والثمار الخضراء، والثمار الناضجة في وقت واحد على شجرة واحدة، وتستغرق الثمار ما يقارب عاماً بعد الإزهار الأول، وحوالي 5 سنوات من النمو للوصول إلى الإنتاج الكامل للثمرة.\n
الآثار الجانبية لشرب القهوة بكثرة:
- زيادة اليقظة والأرق؛ فهذا هو التأثير الرئيسي للكافيين في الجسم، وقد يسبب أعراضاً أخرى غير مريحة.
- الاهتياج العصبي والتوتر.
- الارتعاش.
- النوم المتقطع.
- سرعة ضربات القلب أو عدم انتظامها.
- الصداع.
- الدوخة.
- الإصابة بالجفاف.
- حرقة المعدة.
- رعاش العضلات.
- اعتماد الجسم على القهوة للاستيقاظ والحركة.\n
الكميات التي يمكن استهلاكها من القهوة:
 يعد الاستهلاك اليومي المعتدل للكافيين في حدود 300-400 مليغرام، أو حوالي 3-4 أكواب بسعة 263 مليلتراً من القهوة المخمّرة منزليّاً.
ووفقاً لإدارة الغذاء والدواء الأمريكية، والهيئة الأوروبية لسلامة الأغذية، ووزارة الصحة الكندية فإنَّ استهلاك الكافيين الذي يصل إلى 400 مليغرام يومياً لا يرتبط بآثار صحية ضارة بالنسبة لمعظم الأشخاص الأصحاء من البالغين.
أما بالنسبة للمراهقين الذين تتراوح أعمارهم بين 12-18 عاماً؛ فيجب الحد من استهلاكهم للكافيين إلى 100 مليغرام يومياً، أو حوالي كوب واحد من القهوة.
''';
  static const String article10 = '''
تقع عضلات البطن بين الأضلاع والحوض في الجزء الأمامي للجسم، إذ تقدم هذه العضلات فوائد عديدة للجسم، كدعم العمود الفقري والحفاظ على استقرار الجسم وتوازنه، وحماية العمود الفقري، والسماح بالحركة، وتثبيت الأعضاء في مكانها.\n
ما فائدة عضلات البطن؟
تتمثل فائدة عضلات البطن في مجموعة من الأمور التي نوضحها بالتفصيل كما يلي:
- تساعد على القيام ببعض الوظائف الجسدية الأساسية؛ كالتبول والتبرز والسعال والعطس والتقيؤ، علاوة على دورها في زيادة الضغط داخل البطن من أجل تسهيل الولادة وإنجاب الأطفال عند النساء.
- تثبيت الأعضاء الداخلية في مكانها، وحمايتها، بما في ذلك المعدة والأمعاء والبنكرياس والكبد والمرارة.
- الحفاظ على الضغط الداخلي في البطن ثابتًا.
- دعم العمود الفقري، وتثبيت الجسم في وضعيته؛ إذ إنها الأساس الداعم لعضلات وسط وأسفل الظهر.
- دعم العمود الفقري والجسم، أثناء الجلوس والوقوف والالتواء والتمرين .\n
تشريح عضلات البطن
تنقسم عضلات البطن إلى 4 مجموعات رئيسية، والتي تتحد مع بعضها لتشكل عضلات البطن بأكمله، وهي:
1- عضلات البطن المستعرضة: هي أعمق طبقة عضلات في البطن، ويتمثل دورها الرئيس في تثبيت العمود الفقري والحفاظ على ضغط البطن الداخلي.\n
2- عضلات البطن المستقيمة: هي العضلات الممتدة من الأضلاع وصولاً إلى عظم العانة في مقدمة الحوض، وعند الانقباض ستتشكل نتوءات أو انتفاخات يُشار إليها بعضلات البطن الست، وتتمثل الوظيفة الرئيسة لعضلات البطن المستقيمة في دعم حركة الجسم وبالتحديد ما بين القفص الصدري والحوض.\n
3- العضلات المائلة على الجانب الخارجية: تتواجد هذه العضلات على كل جانب من جوانب عضلات البطن المستقيمة، والتي تسمح للجذع بالالتواء، فمثلاً تتقلص عضلات الجانب الأيمن عند تمدد الجسم نحو اليسار.\n
4- العضلات المائلة على الجانب الداخلية: تحيط هذه العضلات بالعضلات المستقيمة وتمتد إلى داخل الفخذ، وتعمل بطريقة معاكسة للعضلات المائلة على الجوانب الخارجية.\n
هنالك مجموعة من الأسباب التي قد تكون وراء عدم ظهور عضلات البطن، والتي يمكن توضيحها كما يلي:
ارتفاع مستوى الدهون في الجسم.
عدم اتباع نظام غذائي صحي ومناسب.
عدم الحصول على قسط كاف من الراحة.
عدم التركيز على عضلات البطن خلال القيام بالتمارين الرياضية.
''';
  static const String article11 = '''
حقن العضلات يميل الكثير من الشباب خاصة لاعبو كمال الأجسام وغيرهم ممن يرغبون في اتباع طريق مختصر للحصول على عضلات ذات حجم كبير، إلى حقن عضلاتهم بحقن خاصة ذات نتائج فورية تقريبًا، على الرغم من كونها لا تزيد من قوة الشخص بل وقد تكون خطيرًة جدًا، ومن هذه الحقن حقن السينثول (Synthol Injections).\n
مكونات حقن العضلات:
تتكون حقن العضلات في الغالب من العديد من المواد التي لم يتم تحليلها واختبار مدى أمانها من قبل إدارة الغذاء والدواء، لذلك تحذر من استخدامها، وتتضمن مكونات حقن العضلات الآتي:
- زيت مصنوع بواسطة سلاسل متوسطة الطول من الدهون الثلاثية بنسبة 85%، للحصول على أفضل التأثيرات.
- كحول بنسبة 7.5%، لتعقيم الخليط.
- ليدوكائين بنسبة 7.5%، وهو عبارة عن مخدر موضعي يستخدم لتقليل الألم أو الانزعاج.\n
أضرار حقن العضلات:
بشكل عام يمكن أن تتسبب حقن العضلات بالعديد من الآثار الجانبية، منها ما هو خطير ويحتاج للتدخل الطبي الفوري ومنه ما هو بسيط مثل الانتفاخ والشعور بالضغط والاحمرار في موقع الحقن، وتتضمن الآثار الجانبية الأخرى الآتي:
أضرار وضعف أيضاً في الدورة الدموية في العضلة والجزء الذي تعرض للحقن.
تشوهات واضحة وظاهرة في الشكل العام للعضلة المحقونة.
يمكن أن يحدث احتشاء في عضلة القلب.
تضرر الأعصاب.
الانسداد الرئوي، أو انسداد في الشريان الرئوي.
حدوث تقرحات في العضلة المحقونة.
زيادة معدل الإصابة بالسكتة الدماغية، حيث يمكن للمادة أن تنتقل إلى أجزاء أخرى من الجسم وتسد الأوعية الدموية في الدماغ والقلب والرئتين.
تمزق الجلد.
العدوى.
التوقف الكامل لتجديد العضلات الطبيعي.
تكون الندبات الكيسية.
التهاب الأوعية الدموية.
تلف الأنسجة الضامة.
تأثر الجهاز الليمفاوي.\n
كيف يمكن إزالة مادة السينثول من العضلات؟
في الواقع لا يمكن التخلص من مادة السينثول بطريقة طفيفة التوغل، وذلك نظرًا لأن هذه المادة تنتشر عبر مناطق واسعة من العضلات والأنسجة عند حقنها، وهذا يعني أن الجراحة هي الخيار الوحيد، للتخلص منها، إذ يتم إجراء تصوير بالرنين المغناطيسي لتحديد الأنسجة العضلية التي تضررت بشكل دائم، وأثناء الجراحة يقوم الطبيب الجراح بإجراء شق بالقرب من المنطقة المصابة، وبعد ذلك يتم إزالة النسيج التالف، ثم إغلاق الشق.
''';
  static const String article12 = '''
1- مصدر غني بالبروتينات:
يسعى لاعبو كمال الأجسام إلى حمل الأوزان الثقيلة وتناول الأطعمة عالية السعرات الحرارية والغنية بالبروتينات، بهدف بناء عضلات أجسامهم، وتعد زبدة الفول السوداني مصدرًا نباتيًا غنيًّا بالبروتين إلى حد ما، وهو ما يجعلها خيارا غذائيا ملائما أثناء فترة التمرين، غير أنها لا تحتوي على كافة الأحماض الأمينية الأساسية التي يحتاجها الجسم، لذلك يجب الاهتمام بمصادر البروتينات الموجودة في أصناف الأغذية الأخرى.\n
2- مصدر عالي السعرات الحرارية:
كما أسلفنا سابقا، فإن لاعب كمال الأجسام يميل إلى تناول الأغذية عالية السعرات الحرارية خلال فترة بناء عضلات الجسم، ويتم التركيز على تناول الكربوهيدرات والدهون الصحية كونها مصدرا أساسيا لطاقة الجسم عند ممارسة التمارين، خاصة تمارين الكارديو (التمارين القلبية)، حيث تعتبر زبدة الفول السوداني مصدر غني السعرات الحرارية وتحتوي على الدهون الجيدة، والكربوهيدرات التي تفيد هذه الفئة من اللاعبين.\n
3- السيطرة على وزن الجسم:
نظرًا لاحتواء زبدة الفول السوداني على كمية كبيرة من السعرات الحرارية والدهون والبروتينات، فهي تساعد على الشعور بالشبع، وبالتالي الحد من تناول الطعام، ومن جهة أخرى فإن احتواءها على سعرات حرارية مرتفعة يمكن أن يتسبب في زيادة الوزن، لذا يمكن إضافة زبدة الفول السوداني لوجبات الطعام اليومية أثناء تدريبات كمال الأجسام بهدف إنقاص الوزن أو زيادته، وذلك حسب كمية وكيفية استخدامها في النظام الغذائي.\n
4- تحتوي على نسبة عالية من مضادات الأكسدة:
تعد زبدة الفول السوداني من الأطعمة الغنية بمضادات الأكسدة، مثل: بارا-حمض الكوماريك (p-Coumaric acid)، ومركّب الريسفيراتول (Resveratrol)، حيث تساعد مضادات الأكسدة على تخليص الجسم من الجذور الحرة التي تضر بالجهاز المناعي ووظائف أعضاء الجسم، ولأجل ذلك، قد يميل لاعبو كمال الأجسام إلى تناول الأطعمة الغنية بمضادات الأكسدة مثل زبدة الفول السوداني خلال فترة التمرين؛ حيث تعزز تعافي العضلات بعد التمرين، وربما  تحمي الأغشية الخلوية في العضلات من أضرار الجذور الحرة.\n
5- تحتوي على الفيتامينات والمعادن المتنوعة:
تحتوي زبدة الفول السوداني على نسبة عالية من العناصر الغذائية التي قد تساعد على توفير الكميات اليومية المرجعية من الفيتامينات والمعادن، مثل: فيتامين ب 1 ، فيتامين ب 3 ، فيتامين ب 5 أو حمض البانتوثنيك، فيتامين ب 6 أو البيريدوكسين، حمض الفوليك، النحاس، الحديد، فيتامين هـ، المغنيسيوم، المنغنيز، البوتاسيوم، الزنك.
''';
  static const String article13 = '''
يعتبر تمرين الضغط من أقدم التمارين الرياضية التي كانت تمارس لتقوية العضلات ، فهي عبارة عن مجموعة من التمارين مرتكزة بالأساس على ثقَل الجسم، ومقدرته على مقاومة جاذبية الأرض، وذلك بإنزال الجسم نحو الأرض ثم الرجوع إلى الحالة الأولى التي كان عليها، وتعتبر الذراعين في هذا التمرين ركائز أساسية في ممارسة العملية.\n
فوائد تمرين الضغط:
- يعمل على تقوية عضلات الصدر؛ حيث يعتبر من أفضل التمارين الجسدية لتقوية عضلات الصدر.
- يعمل على تقوية مختلف عضلات الجسم في آن واحد، ويمكن التركيز على عضلة واحدة لتقويتها.
- يعمل على تقوية عضلات اليدين والساعدين.
- يعمل على تقوية عضلات الكتفين من الجهة التي تكون بين منطقة الصدر والكتف الأمامي.
- يعمل على تقوية عضلات أعلى الظهر، وعضلات أسفل الظهر.
- يقوي عضلات البطن.
- يعمل على شد أوتار الركبة، والعضلات الرباعية (الجزء الأمامي من الفخذ)، ويشد عضلات الساق والقدمين.
- يقوم بتقوية عضلة القلب ويعمل على تنشيطها، وكذلك الحال في أي تمرين يتطلب مجهوداً عالياً.
يعتبر تمرين الضغط من التمارين البسيطة؛ حيث يمكن ممارسته بسهولة، فهو لا يتطلب التركيز العالي، ولا القوة البدنية الكبيرة.
و يمكن القيام به في أي مكان وأي زمان، فما دامت طريقة أدائه صحيحة لن يحتاج مكاناً مهيأً أو زمناً معيَّناً (مع العلم بأنه يفضل عدم تأدية أي نشاط جسدي يتطلب جهد عال بعد تناول الطعام بنصف ساعة على الأقل)، فالمكان المنبسط الواسع والمسطح هو مكان جيد لأداء هذا التمرين.
''';
  static const String article14 = '''
يعرف ضمور العضلات على أنه عبارة عن اضمحلال، أو ضعف في عضلات الجسم، كعضلة الذراع، والساق، ويلاحظ على المصابين بضمور العضلات وجود عدم تماثل بين العضلات، مثل: عضلات الذراع، إذ تكون إحدى العضلتين أصغر من الأخرى، وليس كما يعتقد البعض بكونها أقصر، ومن الناحية العلمية فإن السبب الرئيسي لضمور العضلات، هو قلة النشاط البدني الذي قد يحدث بسبب الأمراض، أو الإصابات، ويجعل من حركة عضلات الجسم، كالذراع، والقدم مستحيلة نوعاً ما.\n
أعراض ضمور العضلات:
- ضعف الأطراف.
- أن تكون إحدى الأذرع، أو القدم أصغر من الأخرى.
- خمول طويل الأمد.
- مشاكل في الحركة.\n
أسباب ضمور العضلات:
يمكن إيجاز أسباب ضمور العضلات بناءً على نوعيها، وهما:
1- ضمور عدم الاستعمال:  حيث يعاني منه الأشخاص الذين يعملون بوظائف مكتبية، أو من يعانون من مشاكل صحية تحد من الحركة، أو من يلازمون الفراش، كما أن عدم القدرة على تحريك الأطراف، سواء بسبب سكتة دماغية، أم بسبب أمراض في الدماغ، يسبب ضمور العضلات.\n
2- ضمور عصبي المنشأ:  يحدث هذا النوع شديد الخطورة بسبب إصابة، أو مرض أحد الأعصاب الموصولة مع العضلات، وعلى عكس نوع الضمور الأول، فيميل هذا النوع أن يحدث بشكل مفاجئ، ومن الأمراض التي تصيب الأعصاب، وتؤثر عليها: التصلب الجانبي الضموري (بالإنجليزية: Amyotrophic lateral sclerosis)، ومتلازمة النفق الرسغي (بالإنجليزية: carpal tunnel syndrome) التي تسبب تلف أحد الأعصاب بشكل فردي، ومتلازمة غيلان باريه (بالإنجليزية: Guillain-Barre syndrome)، وشلل الأطفال (بالإنجليزية: poliomyelitis)، بالإضافة إلى إصابة الحبل الشوكي، وتلف أحد الأعصاب بسبب السكري، أوالتسمم، أوالكحول.\n
من العلاجات الشائعة لعلاج ضمور العضلات، هي:
- التمارين الرياضية: مثل التمارين المائية التي تكون الحركة فيها أسهل.
- العلاج الفيزيائي: هو العلاج الذي يساعد المريض على التحرك بشكل سليم، وصحيح.
- العلاج بالموجات فوق الصوتية: وهو إجراء غير منتشر، يستخدم الموجات الصوتية التي تساهم في عملية الشفاء.
- الجراحة: تكون الجراحة ضرورية جداً في حالات مرضية عديدة، كالتقفع، وهي حالة مرضية تكون فيها الأوتار، أوالأربطة، أو الجلد، أو العضلات مشدودة جداً، فتمنع الحركة، وسواء كان سببها سوء التغذية، أو الوتر الممزق، فيمكن إصلاح الأمر بالتدخل الجراحي.
- تغيير الغذاء: قد يحتاج المريض إلى تغيير في الغذاء، والحصول على المغذيات، والمكملات الغذائية المناسبة.
''';
  static const String article15 = '''
1 - زيادة كمية البروتين:
يوفر البروتين الأحماض الأمينية اللازمة لبناء العضلات، ويعزز عملية الإصلاح في الجسم، كما يوفر نسبة جيدة من إجمالي السعرات الحرارية اليومية من البروتين،  كما ينبغي تقسيم كميات البروتين اللازمة على أربع أو خمس وجبات، فمثلاً يمكن تناول بيضتين مسلوقتين على الإفطار، وصدر الدجاج المشوي على الغداء، وشرائح اللحم المشوي على العشاء، وشرب اللبن قليل الدسم، أو شرائح رقيقة من الجبن مع الوجبات الخفيفة.\n
2 - تقليل كمية الكربوهيدرات:
ينصح بتقليل كمية الكربوهيدرات التي يتم تناولها؛ لأن ذلك سيساعد على حرق الدهون، وخاصة تلك الموجودة في منطقة البطن، والتي تحول دون تشكل العضلات فيها.\n
3- تجنب السكريات: 
تحتوي السكريات على الفركتوز الذي يتحول بشكل مباشر الى دهون التي تمنع ظهور عضلات البطن وتتطب مجهود اضافي لحرقها.
''';
  static const String article16 = '''
تقدر الكمية اليومية الموصى بها من البروتين للأشخاص العاديين اعتماداً على وزن الجسم، بحوالي 0.8 غرام لكل كيلوغرام من وزن الجسم يومياً، ولكن قد تكون هناك حاجة إلى تناول كميات إضافية من البروتين للاعبي كمال الأجسام والرياضيين، وهناك العديد من الدراسات التي تشير إلى كمية البروتين اللازمة للاعبي كمال الأجسام، وفي ما يأتي بعض منها:
أشارت دراسة نشرتها Journal of the International Society of Sports Nutrition عام 2018، إلى أنه يجب أن تحتوي الوجبة الواحدة للرياضيين على ما نسبته 0.4 غرام من البروتين لكل كيلوغرام من وزن الجسم، مع تناول أربع وجبات يومياً تحتوي على هذه الكمية من البروتين، وذلك بهدف الحصول على ما يعادل 1.6 غرام من البروتين لكل كيلوغرام من وزن الجسم، وهو الحد الأدنى المطلوب من البروتين يومياً، بهدف بناء وزيادة الكتلة العضلية، أو تناول 0.55 غرام لكل كيلوغرام من وزن الجسم في كل وجبة، للوصول إلى الحد الأعلى من الكمية اليومية من البروتين يومياً، البالغة 2.2 غرام لكل كيلوغرام من وزن الجسم.\n
أشارت دراسة نشرتها مجلة Sports عام 2019، إلى ضرورة تناول وجبة خلال 1- 2 ساعة قبل التمرين وبعد الانتهاء منه، حيث تحتوي كل وجبة على ما يعادل 0.4- 0.55 غرام من البروتين لكل كيلوغرام من وزن الجسم، بالإضافة إلى تناول كميات معتدلة من الدهون بمعدل 0.5- 1.5 غرام لكل كيلوغرام من وزن الجسم يومياً، والتركيز على استهلاك باقي السعرات الحرارية من الكربوهيدرات؛ لسد متطلبات الطاقة الضرورية في تمارين المقاومة، والتي يجب أن تعادل 3-5 غرامات لكل كيلوغرام من وزن الجسم يومياً.\n
أشارت دراسة نشرتها The Journal of Nutrition عام 2017، أن الكمية اليومية الموصى بها من البروتين، تختلف باختلاف مستوى تدريب لاعبي كمال الأجسام، ما بين لاعبي النخبة، والمتوسطين، والمبتدئين، مشيرةً إلى كمية 2.2 غرام لكل كيلوغرام يومياً للاعبي المستوى العالي.\n
وقد حاولت العديد من الدراسات تحديد الكمية المُثلى من البروتين لبناء العضلات، إلا أنها توصلت إلى نتائج مختلفة، وبالتالي فقد أشار أغلبها إلى أن الكمية الموصى بتناولها يومياً من البروتين، بهدف بناء العضلات تتراوح ما بين 1.6-2.2 غرام لكل كيلوغرام من وزن الجسم، وذلك لصعوبة تحديد أرقام دقيقة.\n
وعلى سبيل المثال؛ يحتاج شخص وزنه 70 كيلوغراماً إلى تناول بين 112-154 غراماً من البروتين.
''';
  static const String article17 = '''
عند ممارسة التمارين الرياضية؛ تستهلك العضلات مخزون الجلايكوجين (بالإنجليزية: Glycogen) الخاص بها كمصدر للطاقة، مما قد يؤدي إلى نفاده جزئياً، بالإضافة إلى تحلل وتلف بعض البروتينات الموجودة في العضلات، ومن الجدير بالذكر أن تمارين التحمل؛ كالركض، تستهلك كميات أكبر من الجلايكوجين مقارنة بتمارين المقاومة كرفع الأثقال، كما يحدث للعضلات بعد تمرينها تمزقات صغيرة. لذلك يحاول الجسم بعد الانتهاء من التمارين إعادة بناء مخزون الجلايكوجين، وإصلاح بروتينات العضلات، ويمكن أن يساعد تناول بعض العناصر الغذائية بعد التمرين بوقت قصير على تسريع البناء العضلي، والتقليل من تحلل بروتينات العضلات، واستعادة مخازن الجلايكوجين، وتعزيز عملية التعافي بشكل عام، وتجدر الإشارة إلى أن كلاً من البروتينات، والكربوهيدرات، والدهون ضرورية لتعافي الجسم بعد التمرين.\n
ما هو الوقت المناسب لتناول الأكل بعد التمرين:
يجب تناول كميات كافية من الطعام قبل، وبعد ممارسة التمارين الرياضية، وذلك للمحافظة على مستويات سكر الدم، والوصول إلى أفضل أداء للتمارين الرياضية، وتحسين وقت التعافي الذي يحتاجه الجسم، وتجدر الإشارة إلى أنَ فترة ما بعد التمرين هي الفترة الأهم من حيث التغذية، لأن استهلاك الكميات المناسبة من العناصر الغذائية يساعد على بناء الأنسجة العضلية التالفة، واستعادة مخزون الطاقة، إضافة إلى تحسين مكونات الجسم، وتحسين أداء التمرين.\n
حيث يُنصح بتناول ولو وجبة خفيفة في غضون 15 إلى 30 دقيقة بعد الانتهاء من التمرين، لأن التمارين الرياضية تستهلك كميات كبيرة من الطاقة، ويصعب على الجسم التعافي إذا ما لم يتم تجديد مخزون الطاقة، وفي حالة عدم قدرة الشخص على تناول الطعام في غضون 15 إلى 30 دقيقة من التمرين، فيمكنه تناوله خلال الساعة التي تلي الانتهاء من التمرين.\n
يفقد الجسم الكثير من الماء عند ممارسة الرياضة عن طريق التعرق، مما يعني ضرورة شرب كميات كافية منه، إضافة إلى ذلك فإن فقدان الجسم للماء يزداد عند ممارسة التمارين في الهواء الطلق، وفي طقس حار ورطب، لذا يُنصح بشرب الماء قبل، وبعد، وأثناء التمرين، ويحدث الجفاف عندما يفقد الإنسان سوائل أكثر من تلك التي يشربها، ممّا يؤدي إلى اضطراب في وظائف الجسم، وتتراوح درجات الجفاف من خفيف إلى شديد، ويمكن أن يؤدي إلى بعض ظهور بعض الأعراض الجانبية، ونذكر منها ما يأتي: الدوخة. الغثيان, أو القيء, تشنج العضلات, جفاف الفم, قلة التعرق.
''';
  static const String article18 = '''
الفيتامينات: هي مركبات عضوية خالية من الطاقة يحتاجها جسم الإنسان بكميات ضئيلة جداً.
المعادن: هي مركبات غير عضوية خالية من الطاقة وضرورية لاستمرار الحياة.\n
تنقسم الفيتامينات إلى:
1- فيتامينات ذائبة في الدهون:
- يحتاجها الجسم بكميات ضئيلة جداً
- فيتامين  A, D,E,K
- 90 % من الكميات الزائدة تخزن في الكبد والمتبقي في الأنسجة الدهنية ولا تطرح خارج الجسم لذلك الإفراط بتناولها يسبب السمية.
- لا تفقد في ماء الطهي ولا تتكسر خلال عملية الطهي لأنها لا تذوب في الماء.
- يجب أن يتم الحصول عليها من خلال الغذاء لأنه لا يتم تصنيعها في الجسم ما عدا فيتامين ك يمكن تصنيعه بواسطة بكتيريا القولون وفيتامين د يمكن تصنيعه تحت الجلد بواسطة أشعة الشمس.\n
2- فيتامينات ذائبة في الماء:
- تطرح الكمية الزائدة منها في البول لذلك لا تعتبر سامة.
- قابلة للذوبان في الماء لذلك يفقد جزء كبير منها خلال الطهي 
- يجب أن يتم الحصول عليها من خلال الغذاء لأنه لا يتم تصنيعها بالجسم. 
- مجموعة فيتامين B (الثيامين، الريبوفلافين،النياسين، البيريدوكسين، حمض الفوليك،الكوبالامين، البيوتين،حمض البانتوثينيك ، B6، B12)  , فيتامين C.\n
تنقسم المعادن إلى:
1- العناصر المعدنية الكبرى: ويحتاج منها الإنسان يومياً أكثر من 100 مليجرام.( الكالسيوم، الفوسفور، المغنيسيوم، البوتاسيوم،الكبريت،الصوديوم،الكلوريد)
2- العناصر المعدنية الصغرى: ويحتاج منها الإنسان يومياً أقل من 100 مليجرام.( الحديد، الزنك، النحاس، اليود،الفلور،…)\n
أهم وظائف الفيتامينات والمعادن: 
- لها دور فعال في إنتاج الأنزيمات والهرمونات والمواد الأخرى اللازمة للنمو الطبيعي. 
- مهمة في أداء وظائف الجسم بشكل سليم في جميع المراحل العمرية. 
- تنظم السوائل داخل وخارج الخلايا في الجسم .
- مهمة لتجنب امراض او اعراض معينة ناتجة عن النقص او الزيادة في الفيتامينات و المعادن.  
- تساهم في تعزيز الجهاز المناعي.
- تساعد بعض الفيتامينات والمعادن على مقاومة الالتهابات والمحافظة على صحة الجهاز العصبي.
- تكوين العظام والأسنان( الكالسيوم، الفوسفور)
- المساعدة على انقباض العضلات(الكالسيوم)
- المساعدة على ارتخاء العضلات( مغنيسيوم،بوتاسيوم)
''';
  static const String article19 = '''
يعد الليل أفضل وقت للنوم؛ حيث تصل طاقة الإنسان الجسدية والعقلية لأدنى مستوياتها عند حلول الليل، كما أنه يجب النوم مبكراً؛ حيث أثبتت دراسة أُجريت على عينة من 1197 موظفاً في اليابان لقياس فائدة النوم مبكراً أن الأشخاص الذين ينامون متأخراً لا يحصلون على ساعات نوم كافية مما يجعلهم أكثر عرضة للإصابة بالاكتئاب، ووجدت دراسة أخرى أن ممارسة التفكير السلبي كاسترجاع الذكريات أو التجارب السيئة يزداد لدى الأشخاص الذين يخلدون إلى النوم في وقت متأخر من الليل؛ وذلك لعدم حصولهم على وقت كاف من الراحة.\n
يعد وقت الظهيرة وقتاً مناسباً لأخذ قيلولة؛ فعلى الرغم من أن الليل هو الوقت الأنسب للذهاب إلى النوم إلا أن قيلولة الظهيرة التي لا تتجاوز النصف ساعة لها العديد من الفوائد الإيجابية، ومن هذه الفوائد ما يأتي:
- تقوية الذاكرة.
- تحسين المزاج.
- الاسترخاء وتهدئة الجهاز العصبي، مما يساعد على التحكم بالغضب والانفعال.
- زيادة القدرة على التركيز والشعور باليقظة.
- خفض ضغط الدم بطريقة طبيعية.
- تسريع عملية الشفاء لمن أجرى عمليات جراحية.\n
عدد ساعات النوم:
تتفاوت عدد ساعات النوم من شخص إلى آخر، ويعتمد ذلك بشكل رئيسي على التركيب الوراثي وجودة النوم، ويوضح الجدول الآتي عدد ساعات النوم التي يحتاجها الشخص حسب فئته العمرية:
3-0 شهور/  14-17 ساعة
11-4 شهر/ 12-15 ساعة
2-1 سنة /   11-14 ساعة
5-3 سنوات/  10-13 ساعة
13-6 سنة/   9-11 ساعة
17-14 سنة/ 8-10 ساعات
25-18 سنة/ 7-9 ساعات
64-26 سنة/ 7-9 ساعات
65 سنة فما فوق/	7-8 ساعات
''';
  static const String article20 = '''
يحذر الأطباء من أضرار قلة النوم لما يترتب على ذلك من آثار سلبية على صحة الإنسان النفسية والجسدية، وتقسم هذه المخاطر إلى ما يأتي:
المخاطر على المدى القصير:
- انعدام التركيز؛ حيث يُمكن أن يتأثر تركيز الإنسان بمجرد التأخر عن موعد النوم مدة ساعة ونصف فقط.
- النعاس المفرط، بحيث يشعر الشخص بالتعب والنعاس طوال اليوم.
- ضعف الذاكرة وعدم القدرة على التفكير أو استرجاع المعلومات.
- توتر العلاقات؛ وذلك بسبب المزاجية واحتمالية وقوع الشخص في مشاحنات مع الأشخاص من حوله.
- جودة حياة سيئة؛ حيث يفقد الشخص الرغبة في ممارسة الأنشطة اليومية أو ممارسة الرياضة.
- حوادث السيارات؛ وذلك لأن الشخص يُصبح أكثر عرضة لحوادث الطريق بسبب فقدان التركيز أثناء القيادة.\n
المخاطر على المدى الطويل:
- ظهور التجاعيد والهالات السوداء.
- زيادة إفراز هرمون التوتر؛ وهو هرمون الكورتيزول، والذي يؤدي إلى تكسير الكولاجين؛ وهو البروتين المسؤول عن الحفاظ على نعومة البشرة، بالتالي يؤدي إلى خشونتها، كما تؤدي زيادة الكورتيزول إلى تضيُّق الشرايين وبالتالي ارتفاع ضغط الدم.
- الإصابة بأمراض عدة من أهمها: النوبة القلبية، أو الجلطة الدماغية، أو فشل في القلب، أو الاكتئاب، أو ضعف القدرة الجنسية، أو السكري، أو السمنة.
''';
  static const String article21 = '''
تمثل الألياف الغذائية أحد الأجزاء الصالحة للأكل من النباتات أو مستخلصاتها، وهي غير قابلة للهضم أو الامتصاص في الأمعاء الدقيقة، وعادة ما تمر بالتخمير الكامل أو الجزئي في الأمعاء الغليظة، ويُعرِّف الدستور الغذائي لعام 2013 الألياف الغذائية على أنها مبلمرات الكربوهيدرات المرتبطة مع عشر وحدات أحادية أو أكثر، والتي لا تتحلل بواسطة إنزيمات الأمعاء الدقيقة للإنسان.\n
وتتميز الألياف الغذائية بالعديد من الخصائص الفيزيائية والكيميائية، المسؤولة عن سلوكها الوظيفي مثل، الذائبية، والتخمر، واللزوجة، وامتصاص الماء، كما تجدر الإشارة إلى أن الألياف تقسم إلى الألياف الغذائية الموجودة بشكل طبيعي في الأغذية، والألياف الوظيفية، وهي الألياف المستخرجة أو المعزولة من الأطعمة الكاملة، ومن ثمّ تُضاف إلى الأطعمة المصنعة.\n
أنواع الألياف الغذائية:
تُصنف الألياف الغذائية وفقا لتركيبها، إلى سكريات مُتعدّدة بجزيئات خطية أو غير خطية، أو تصنف وفقاً للذائبية، إلى قابلة للذوبان أو غير قابلة للذوبان، ويعد هذا التصنيف الأكثر شيوعًا وتداولاً، وفي ما يأتي توضيح لذلك:
1- الألياف الذائبة في الماء: تتكون الألياف الذائبة في الماء من السكريات المتعددة غير السليلوزية، مثل البكتين، والصمغ، والهلام النباتي، وتمتص هذه الألياف الماء، وتشكل مادة هلامية في الجهاز الهضمي، ويمكن أن يتخمر بعضها بفعل البكتيريا النافعة الموجودة في الأمعاء الغليظة، مثل: الشوفان، والشعير، وصمغ الغوار النيء (بالإنجليزية: Guar gum)، والمكسرات، والبذور، وبعض البقوليات مثل العدس والبازيلاء، والفاصولياء، بالإضافة إلى بعض الفواكه والخضراوات، وبعضها الآخر يمتّص الماء ولكن لا يمكن أن يتخمر، مثل بذر القطونة (بالإنجليزية: Psyllium)، وهو من الألياف المكونة من قشور بذور نبات لسان الحمل البيضوي (بالإنجليزية: Plantago ovata).\n
2- الألياف غير الذائبة في الماء: تتكون الألياف غير الذائبة في الماء من مكونات جدار الخلية، مثل: السليلوز، واللغنين (بالإنجليزية: Lignin)، والهيميسليلوز (بالإنجليزية: Hemicellulose)، ولا تذوب هذه الألياف في الماء أو تحتفظ به، كما أنَّها لا تتخمّر بشكل جيد، ومنها نخالة القمح، والسليلوز، واللغنين، وطحين القمح الكامل، وبعض أنواع الخضراوات، مثل: القرنبيط أو الزهرة، والفاصولياء الخضراء، والبطاطا، ومن الجدير بالذكر أن معظم النباتات تحتوي على الألياف الذائية، وغير الذائبة في الماء بكميات مختلفة، والتي تُعد جزءاً مهماً من النظام الغذائي الصحي، الضروري لدعم العديد من أنظمة الجسم.
''';
  static const String article22 = '''
يساهم استهلاك الكافيين في توفير العديد من الفوائد الصحية، إذ يساعد على تحفيز الجهاز العصبي، مما يساهم في زيادة تركيز ونشاط الجسم، والتقليل من الشعور بالنعاس، بالإضافة إلى أنه يساعد على تحسين الأداء الجسدي والذهني، وزيادة مستويات الطاقة لدى الرياضيين خاصة عند استهلاكه قبل أداء التمارين الرياضية، ومن فوائد الكافيين للرياضيين ما يأتي:
1- رفع مستويات الطاقة:
يحفز الكافيين مناطق محددة في الدماغ والجهاز العصبي ممّا يُساهم في تحسين التركيز وزيادة مستويات الطاقة في الجسم، والتقليل من الشعور بالنعاس، والمساعدة على تحسين الأداء الرياضي، وذلك عند دخول الكافيين إلى مجرى الدم، إذ يستجيب الجسم بعدة طرق لارتفاع مستوياته في الجسم من خلال رفع مستويات ضغط الدم ومعدل ضربات القلب، وزيادة معدلات أيض الدهون، وإطلاق الأحماض الدهنية في مجرى الدم.\n
2- زيادة مستويات التمثيل الغذائي:
يُعزز الكافيين معدلات التمثيل الغذائي أي قدرة الجسم على إنتاج الطاقة، وقد يستمر تأثير الكافيين لفترة تصل إلى 3 ساعات، ممّا يُمكن أن يُساهم في تحسين قدرة الجسم على حرق الدهون أثناء التمرين لعدة ساعات بعد التمرين، بالإضافة إلى مساعدة الرياضيين على الحفاظ على الوزن وتجنب زيادة نسبة الدهون، بالإضافة إلى أنَّها تقلل من الشهية.\n
3- تحسين الأداء الرياضي:
الكافيين فعال في تعزيز الأداء عند تناوله بجرعات منخفضة إلى معتدلة، إذ يمكن للرياضي من التدرب لفترة أطول مع إنتاج طاقة أكبر، ويحسن من مستويات التحمل ومقاومة التعب خاصة لدى الرياضيين الذين يمارسون تمارين المقاومة ورفع الأثقال، إذ يُحفز الجسم على استخدام مخازن الدهون بدلاً من الجليكوجين العضلي أو السكر المخزن في العضلات أثناء التدريبات الطويلة، ممّا يسمح باستخدام العضلات لأطول فترة ممكنة دون الشعور بالإرهاق.\n
4- تقليل ألم العضلات:
يمكن أن يقلل الكافيين من آلام العضلات أثناء أداء التمرين، إذ يمكن أن تتسبب التمارين الرياضية في تراكم حمض اللاكتيك المؤلم عند تعرض العضلات للإجهاد، ممّا يُمكن أن يدفع البعض إلى التوقف عن ممارسة الرياضة بسبب الألم، بالإضافة إلى أنَّها تقلل من وقت تعافيه في اليوم الثاني والثالث بعد التمارين المكثفة.
''';
  static const String article23 = '''
قد يعاني أي فرد من أوجاع الظهر، ولكن توجد بعض العوامل التي قد تزيد من فرصة الشعور بأوجاع أسفل الظهر، وفيما يأتي ذكر لبعض منها:
العمر: يبدأ ألم أسفل الظهر عادة في عمر يتراوح بين 30 و50 سنة، ويصبح أكثر شيوعًا لدى الأفراد مع التقدم في العمر، ويعود السبب في ذلك إلى حدوث مجموعة من التغيّرات الجسمية أهمها:
- بداية فقدان السوائل والمرونة في الأقراص الفقريّة، الأمر الذي يؤدي إلى تناقص قدرتها على دعم الفقرات وتلطيف حركتها.
- تراجع مرونة العضلات وقوتها.
- فقدان قوة العظام؛ نتيجة هشاشة العظام (بالإنجليزية: Ostoporosis) التي قد تؤدي إلى كسور العظام.
- زيادة خطر الإصابة بالتضيّق الشوكي.\n
العامل الوراثي: قد تلعب العوامل الوراثيّة دورًا في حدوث أوجاع الظهر، ومن الأمثلة على ذلك التهاب الفقار المقسط (بالإنجليزية: Ankylosing spondylitis)؛ وهو أحد أشكال التهاب المفاصل والذي يتمثّل باندماج مفاصل العمود الفقري، مما يؤدي إلى نوع من فقدان الحركة فيه.\n
طبيعة الوظيفة: قد تساهم وظيفة الأفراد في حدوث إصابات وآلام الظهر، مثل: الوظيفة التي تتطلّب الجلوس على المكتب لفترات طويلة لا سيّما بوضعيات غير سليمة أو على كرسي لا يوفر دعمًا جيّدًا للظهر، وكذلك الوظيفة التي تتطلب رفع أو دفع أو سحب أشياء ثقيلة، لا سيّما عند الحاجة إلى إحداث التواء أو اهتزاز للعمود الفقري.\n

الصحة النفسية: قد تؤثر الاضطرابات النفسيّة في الصحة الجسدية والشعور بالألم؛ إذ قد يسبب التوتر العصبي زيادة توتر وإجهاد العضلات، كما قد يزيد القلق والاكتئاب من تركيز المصاب على الألم ومدى إدراك شدته، وفي الواقع فإن الألم المزمن قد يساهم في تطور هذه العوامل النفسية أيضًا.\n
السمنة: يؤدي ارتفاع مؤشر كتلة الجسم (بالإنجليزية: Body mass index) أو البدانة إلى زيادة الضغط على العمود الفقري مما يسبب المزيد من التآكل والاحتكاك، وفي الحقيقة ترتبط البدانة مع العديد من آلام الجسم المزمنة بما فيها ألم أسفل الظهر.\n
حمولة حقيبة الظهر الزائدة: قد يسبب ارتداء الأطفال لحقيبة الظهر ذات الحمل الزائد، والتي تحتوي على الكتب المدرسية ومستلزمات المدرسة إلى إجهاد الظهر والعضلات.
''';
  static const String article24 = '''
تشنج عضلات الرقبة، أو تشنج الرقبة، أو شد الرقبة هو الانقباض المفاجىء واللاإرادي لعضلات الرقبة، أو الشد والارتعاش غير المسيطر عليهما لتلك العضلات، وقد يحدث ذلك نتيجة لعدة أسباب منها: تعرضها للالتواء، أو الإجهاد، أو الإرهاق، أو بسبب الشعور بألم في عضلات الرقبة مرتبط بحدوث إصابة أو ظهور مشكلة صحية، وفي هذا السياق؛ يذكر أن بعض العضلات المعرضة للتشنج قد تكون قريبة من الحبل الشوكي أو الجذور العصبية؛ مما يتسبب بزيادة الضغط على الأعصاب الحسية الموجودة في المنطقة، وقد يتسبب ذلك بالشعور بألم شديد في بعض الأحيان، ويعد تشنج عضلات الرقبة، أو التواء وشد فقرات العنق من مشاكل الجهاز العضلي الهيكلي الأكثر شيوعا، والتي يكثر عرضها على الأطباء.\n
تتعدد الأسباب الشائعة المؤدية لإصابة عضلات الرقبة بالتشنج، وفيما يأتي ذكر لبعض هذه الأسباب:
- تحريك عضلات الرقبة بشكل متكرر أو لفترة طويلة.
- حمل أوزان ثقيلة باستخدام يد واحدة أو في حقيبة محمولة على كتف واحد.
- الجلوس أمام شاشة الحاسوب لفترات طويلة.
- الالتفاف المُفاجئ للرقبة أثناء النوم.
- التحدث بالهاتف النقال بإمالة الرأس دون استخدام اليد.
- التعرض للالتواء في عضلات الرقبة أثناء ممارسة التمارين الرياضية.
- التوتر العاطفي.
- الوضعيات غير السليمة للجسم.
- الإصابة بالجفاف.\n

الأسباب الخطيرة: قد تكون أسباب إصابة عضلات الرقبة بالتشنج أكثر خطورة، وفيما يأتي ذكر لبعض هذه الأسباب:
- التهاب السحايا (بالإنجليزية: Meningitis).
- التضيُّق الشوكي (بالإنجليزية: Spinal stenosis).
- اعتلالات المفاصل التي قد تؤثر في الفك.
- الانزلاق الغضروفي (بالإنجليزية: Herniated disc).
- التهاب الفقار اللاصق (بالإنجليزية: Ankylosing spondylitis)، وهو مشكلة صحية
تتعرض فيها فقرات العمود الفقري للالتهاب.\n
علاج تشنج عضلات الرقبة
الخيارات المنزلية: قد تُسرع بعض الممارسات المنزلية من عملية الشفاء، و قد تمنع حدوث تشنجات أُخرى، ومن هذه الممارسات ما يأتي:
- تمارين التمدد؛ فقد تساعد على استرخاء العضلات في حال ممارستها بانتظام قبل وبعد التمارين الرياضية، وقبل النوم.
- تدليك الرقبة؛ حيث يخفف من تشنج العضلات وذلك بالضغط على الأجزاء المشدودة من الرقبة وتحريك الأصابع بحركات دائرية، وقد يستطيع الشخص نفسه القيام بذلك، كما يُمكنه أيضًا الاستعانة بصديق أو مُعالج مختص.
- تطبيق ثلج مغطى بقطعة من القماش على الرقبة لمدة عشرين دقيقة، ويمكن تكرار ذلك كل ثلاث أو أربع ساعات.\n
العلاجات الدوائية والإجراءات الطبية: قد يلجأ مقدم الرعاية الصحية إليها في حال عدم تحسن الشخص المصاب بعد اتباعه العلاجات المنزلية، ومن أبرزها ما يأتي:
- استشارة أخصائي العلاج الطبيعي؛ لتقوية عضلات الرقبة ومساعدتها على الاسترخاء.
- السيطرة على التوتر والضغط النفسي؛ فكما ذكر سابقًا فقد يتسبب التوتر بحدوث تشنجات عضلية في منطقة الرقبة.
- استخدام الأدوية المُرخية للعضلات، أو الأدوية المسكنة للألم، أو مضادات الالتهاب، مثل: آيبوبروفين (بالإنجليزية: Ibuprofen)، ونابروكسين (بالإنجليزية: Naproxen)‏، ويُنصح باستشارة الطبيب قبل استخدامها خاصة في حال المعاناة من مشكلة صحية أخرى أو في حال كان المصاب يأخذ أدوية أخرى.
''';
  static const String article25 = '''
يعد التهاب أوتار الكوع، أو ما يعرف باسم مرفق لاعب التنس، أو التهاب لقيمة العضد الوحشية من الحالات الطبية المؤلمة التي تحدث في حال وجود جهد زائد على أوتار مفصل الكوع، وينتج غالباً عن التكرار في حركة الرسغ، والذراع، ويحدث الألم عند ملامسة أوتار عضلات ساعد اليد بنتوء عظمي خارج الكوع؛ بحيث ينتشر الألم إلى الساعد والرسغ.\n
أسباب التهاب أوتار الكوع:
- عدم تسخين مفصل الكوع بشكل جيد قبل البدأ بالتمارين الرياضة الخاصة بكمال الاجسام.
- تؤدي الأنشطة وبعض أنواع الوظائف التي تتطلَب استخدام الساعد بشكل متكرر وقوي إلى الإصابة بالتهاب أوتار الكوع.
- العمر: حيث إن معظم الأشخاص الذين تتراوح أعمارهم بين 30 إلى 50 سنة معرضون للإصابة به.\n
علاج التهاب أوتار الكوع :
- اذا كنت من لاعبي كمال الاجسام فيجب الراحة والتوقف عن التمارين بضعة ايام حتى يعود المفصل الى حالته الطبيعية.
- وضع كمادات الثلج، واستخدام تقنيات تحفيز العضلات: حيث يساعد على شفاء العضلات.
-  ربط منطقة الساعد أو وضع الجبيرة: بحيث يفيد في إعادة تنظيم ألياف العضلات، وتخفيف الضغط على منطقة الإصابة.
- استخدام جيل مسكن لالام المفاصل ومضاد للإلتهابات.
''';
  static const String article26 = '''
تحتوي بعض النباتات الصالحة للأكل على مركبات تسمى بالإستروجين النباتي (بالإنجليزية: Phytoestrogens)، وهي تتشابه مع هرمون الإستروجين من الناحية الهيكلية والوظيفية، وتتوفر هذه المركبات بكثرة في فول الصويا، وقد اختلفت الدراسات حول تأثير هذه المركبات في الهرمونات والحيوانات المنوية عند الرجال، فقد أشار بعضها إلى أنّ هناك تأثيراً لهذه المركبات، في حين أشارت دراسات أخرى إلى عدم وجود تأثير لها، وفي الآتي تفصيل لذلك:
هناك آراء تشير إلى وجود تأثير لمركبات الإستروجين النباتي في الرجال: أشار تقرير إلى وجود علاقة عكسية بين تناول الأطعمة التي تحتوي على الصويا وتركيز الحيوانات المنوية لدى الرجال.

وهناك آراء تشير إلى عدم وجود تأثير لمركبات الإستروجين النباتي في الرجال: أشارت مراجعة نشرتها مجلة Fertility and Sterility عام 2010، إلى أن تأثير أطعمة الصويا، أو مركبات الإيزوفلافون (بالإنجليزيّة: Isoflavones) لا يغير من مستويات هرمون التستوستيرون لدى الرجال.\n
وتجدر الإشارة هنا إلى أن تأثير الصويا في الرجال يحدث فقط عند استهلاك كميات كبيرة جداً منه، فقد أشارت دراسة نشرتها مجلة Nutrients عام 2016، إلى أن التأثير التأنيثي لفول الصويا ظهر على الرجال الذين تناولوه بكميات أكثر بـ 9 مرات من متوسط تناول الرجال الذين يتبعون أنظمة غذائية غنية بفول الصويا، والتي من الصعب أن يحصل عليها معظم الناس حتى عند تناول الكثير من فول الصويا يومياً.
''';
  static const String article27 = '''
تعد البروتينات النباتية من البروتينات غير الكاملة التي تفتقد إلى واحد أو أكثر من الأحماض الأمينية الأساسية، وتعد معظم الأغذية النباتية مصدراً للبروتين غير الكامل، ومن الجدير بالذكر أن الأحماض الأمينية الأساسية التي لا تتوفر بشكل كاف في المصادر النباتية هي: الميثيونين (بالإنجليزية: Methionine)؛ إذ إن كمياته في البقوليات تعد منخفضة، واللايسين (بالإنجليزية: Lysine)؛ حيث تكون كمياته في الحبوب والبذور منخفضة، والتريبتوفان (بالإنجليزية: Tryptophan)، ومن الجدير بالذكر أن انخفاض استهلاك هذه الأحماض الأمينية يرتبط بانخفاض مستويات إنتاج البروتين في الجسم، وذلك حسب دراسة أُجريت في الجامعة الطبية السلوفاكية (بالإنجليزية: Slovak Medical University) عام 2005، والتي أجريت بهدف معرفة الفوائد والمحاذير المرتبطة بالبروتينات النباتية.\n
يجدر الذكر أن هناك نوع آخر من البروتينات وهي البروتينات الكاملة التي تحتوي على جميع الأحماض الأمينية الأساسية بكميات الكافية، ومن الأمثلة عليها؛ الأطعمة الحيوانية كمنتجات الألبان، والبيض، واللحوم، والدواجن، والمأكولات البحرية، بالإضافة إلى فول الصويا. وتقسم الأحماض الأمينية إلى نوعين رئيسيّين، وهما: الأحماض الأمينية الأساسية (بالإنجليزية: Essential amino acids)، والتي لا يمكن للجسم صنعها ويجب الحصول عليها من الطعام، وعددها تسعة، أما النوع الثاني فهو الأحماض الأمينية غير الأساسية، والتي يستطيع الجسم تصنيعها من الأحماض الأمينيّة الأساسية الموجودة في الطعام، أو عن طريق التحلل الطبيعي للبروتين داخل الجسم.\n
و من الجدير بالذكر انه لا يمكن الاعتماد على البروتين النباتي كلياً لأن ذلك يؤدي الى نقص العناصر الغذائية المهمة للجسم، إذ تتميز مصادر البروتين الحيواني بارتفاع محتواها من مجموعة من العناصر الغذائية التي غالباً ما تفتقر إليها الأغذية النباتية، وعلى العكس تتوفر الكثير من العناصر الغذائية في المصادر النباتية، والتي تفتقر إليها المصادر الحيوانية، لذلك يُعد تناول كميات متوازنة من المصدرين أفضل طريقة للحصول على جميع العناصر الغذائية التي يحتاجها الجسم، والنقاط الآتية تبين العناصر التي يفتقر إليها البروتين النباتي:
فيتامين ب12: الذي يوجد بشكل خاص في المنتجات الحيوانية كالأسماك، واللحوم، والدواجن، ومنتجات الألبان، لذا فإن عدداً كبير من الأشخاص الذين يتجنبون الأطعمة الحيوانية يكونون مصابين بنقص فيتامين ب12.
فيتامين د: إذ إنه يتوفر في الأسماك الغنية بالزيوت، والبيض، ومنتجات الحليب، والذي يستخدمه الجسم بشكل أفضل من فيتامين د الموجود في أنواع قليلة جداً من المصادر النباتيّة.
حمض الدوكوساهيكسانويك: وهو أحد أنواع دهون أوميغا-3 الأساسية، والتي توجد في الأسماك الدهنية، ومن الصعب الحصول عليها من المصادر النباتية، وتعتبر دهون أوميغا-3 مهمّةً جداً لصحة الدماغ.
الحديد الهيمي: (بالإنجليزية: Heme iron) الذي يوجد في اللحوم، وبشكل خاص اللحوم الحمراء، ويتميز هذا النوع من الحديد بأنَّ الجسم يمتصه بشكل أفضل من الحديد غير الهيمي الموجود في الأطعمة النباتية.
الزنك: حيث يوجد بشكل رئيسي في مصادر البروتين الحيواني، كلحم البقر والضأن، كما يتم امتصاصه واستخدامه بسهولة أكبر من الزنك الموجود في المصادر النباتية.
''';
  static const String article28 = '''
الفكرة الرئيسة في استخدام الكرة المطاطية لبعض التمارين الرياضية هي في كونها تتطلب الكثير من التوازن، إذ أن عدم استقرارها وضرورة الحفاظ على توازن الجسم عند أداء أبسط التمارين عليها يحفز العضلات أكثر، ويستهدف عضلات أكثر مقارنة بما يمكن للتمرين تحقيقه للجسم بدونها، ولذا فهي تضيف فوائد أُخرى للجسم عند استخدامها للرياضة، ويُذكر من أبرز هذه الفوائد ما يأتي:
1- الحفاظ على توازن العضلات، الذي يُساهم في دعم وضعية الجسم أثناء الوقوف أو الجلوس، وتقليل احتمالية الإصابة بآلام الظهر المختلفة المرتبطة بعدم توازن عضلات الجسم الأمامية والخلفية، وهو ما يحصل غالبًا لدى الأفراد الذين يستهدفون عضلات المعدة بالتمارين ويغفلون عن تقوية عضلات الظهر، فيختل توازن القوى ما بينهم، بالإضافة إلى أن أنشطة الحياة اليومية تتركز في العضلات الأمامية أيضًا، ولذا فإن استعمال الكرة المطاطية يضمن تنشيط العضلات بما يُحقق التوازن المطلوب بينهما.
2- تقوية العمود الفقري والظهر، وقد كان الاستخدام الأكثر شيوعا للكرة المطاطية منذ اختراعها في الستينات من القرن الماضي، إذ أنها تقوي من عضلات الظهر، وتُخفف من آلامه.
3- ثبات وتقوية وسط الجسم، أو عضلات المنطقة الوسطى فيه، التي ترتكز عليها حركات كامل الجسم، وتعتمد عليها في ثباتها، وتتمثل عضلات المنطقة الوسطى فيما يأتي:
- عضلات أسفل الظهر (Tultifidus)، أو ما يُعرف بالعمود الفقري القطني.
- عضلات البطن العميقة (Transverse Abdominus).
- عضلات الظهر السفلية الداعمة للعمود الفقري والحوض (Quadratus Lumborum).
4- تحسين وضعية الجسم، الناجم عن تقوية عضلات المنطقة الوسطى، وتحقيق التوازن ما بين العضلات الأمامية والخلفية، وبذلك يستعيد الجسم انحناء عموده الفقري الطبيعي، ويحميه من مشاكل الظهر المحتلفة.
''';
  static const String article29 = '''
1- التعرق أساسي للاستفادة من التمارين الرياضية: فالاستفادة من التمارين الرياضية عند تحريك الجسم وزيادة معدل نبضات القلب، وبغض النظر عن التعرق، إذ إن التعرق ما هو إلّا عملية لتبريد الجسم، وقد تقل كمية التعرق مع تقدم العمر.\n
2- تحويل ممارسة التمارين الرياضية الدهون إلى عضلات: الخلايا لا تتحول من نوع لآخر، لكن تسهم التمارين الرياضية في بناء العضلات، الأمر الذي يزيد من حرق السعرات الحرارية في الجسم؛ وبالتالي خسارة الدهون.\n
3- تمارين البطن تفقد دهون منطقة البطن: عند عمل التمارين الرياضية لا يتحكم الشخص بالمنطقة التي يراد فقد الدهون منها؛ إذ تلعب الوراثة دورًا مهمًّا في شكل الجسم وتوزيع الدهون، لكن تفقَد الدهون من عدة مناطق من الجسم من ضمنها دهون البطن.\n
4- عمل تمارين الاستطالة قبل التمرين مهم: تجب ممارسة الإحماء على الأقل مدة خمس دقائق قبل تمارين الاستطالة، ويعزز الإحماء التروية الدموية الواصلة إلى العضلات، والزيادة التدريجية على معدل نبضات القلب، ويفضل عمل تمارين الاستطالة بعد الانتهاء من النشاط الجسدي؛ إذ تصبح العضلات مهيئة لذلك بصورة أفضل.\n
5- عمل التمارين بسرعة بطيئة ولمدة طويلة يزيد حرق السعرات الحرارية: كلما زادت سرعة أداء التمرين زادت عملية حرق السعرات الحرارية في الجسم.\n
6- التقليل من السلوكيات اليومية لا يكفي لتحسين اللياقة البدنية: يؤدي التقليل من بعض السلوكيات؛ مثل: مشاهدة التلفاز والألعاب الإلكترونية التي تجعل الشخص يتحرك أكثر، وبالتالي يفقد الشخص بعض الوزن.\n
7- التقنين من السعرات الحرارية في الطعام أحسن طريقة لإنقاص الوزن: يعد تغيير عادات الأكل وتقنين السعرات الحرارية جنبًا إلى جنب ممارسة التمارين الرياضة الطريقة الأفضل لإنقاص الوزن، والتمارين الرياضية تحرق السعرات الحرارية، كما تبني العضلات التي بدورها تزيد حرق السعرات الحرارية.
''';
  static const String article30 = '''
1- فقد جسم المرأة أنوثته عند ممارسة لعبة كمال الاجسام: لا يصبح جسم المرأة ضخمًا وغير أنثوي وشبيهًا بجسم الرجل؛ لأنها تفتقد للمستويات نفسها من الهرمون المسؤول عن ذلك عند الرجال، وهو هرمون التستوستيرون.\n
2- تناول البروتين بعد التمرين مباشرة : وجدت الابحاث انه من الافضل بعد الانتهاء من التمرين بنصف ساعة وليس بعد التمرين مباشرة تناول وجبة ما بعد التمرين التي تحتوي بشكل اساسي على البروتين والكاربوهيدرات.\n
3- حمل أوزان خفيفة وتكرار التمرين كثيرًا يبرزان العضلات: لكي تبدو العضلات بارزة يجب امتلاك كتلة عضلية أكثر والقليل من دهون الجسم، ولا تُبنى العضلات بالاعتماد على حمل الأوزان الخفيفة فقط، إذ لن يحرق الجسم الدهون نتيجة عدم وجود الكتلة العضلية.\n
4- زيادة العضلات بعد عمر الأربعين لا تحدث: على الرغم من نقص الهرمونات يستطيع الشخص بناء العضلات وزيادته في جسمه، لكن مع بعض الصعوبة.\n
5- التمرين غير كاف إذا لم يوجد ألم في العضلات في اليوم التالي: يبدو الشعور بألم العضلات نتيجة وجود التهاب، ولا يحكم على التمرين من خلال الألم بعد التمرين، لكن تقارن النتائج فقط عن طريق الأهداف المرجوة.\n
6- العضلات الكبيرة قوية: هناك اختلاف بين تمرين العضلة لتصبح كبيرة وتمرين العضلة لتصبح قوية، والعضلة كبيرة وغير قوية، والعكس صحيح.
''';
}

class ArticleResources {
  static const String article1 = '''
1- "Plant foods have a complete amino acid composition", Archived from the original on August 24, 2020.\n
2- The only exception is proline, because its amino radical is linked to a {\displaystyle R}R residue (chemistry) in the form of a ring.\n
3- Not to be confused with {displaystyle R}R, which is the side group, and R, which is a designation for the right optical counterpart.\n
4- Pisarewicz K, Mora D, Pflueger F, Fields G, Marí F (2005), "Polypeptide chains containing D-gamma-hydroxyvaline.", J Am Chem Soc, 127 (17): 6207–15, PMID 15853325.\n
5- van Heijenoort J (2001), "Formation of the glycan chains in the synthesis of bacterial peptidoglycan.", Glycobiology, 11 (3): 25R–36R, PMID 11320055, archived from the original on 01 July 2009.\n
6- "What Is Protein?", www.livescience.com, Retrieved 28-11-2019. Edited. \n
7- "How much protein does a person need?", www.medicalnewstoday.com, Retrieved 28-11-2019. Edited. \n
8- "Animal vs Plant Protein - What's the Difference?", www.healthline.com, Retrieved 28-11-2019. Edited.
''';
  static const String article2 = '''
1- Emily Wax (23-4-2018), "Omega-3 fats - Good for your heart"، www.medlineplus.gov, Retrieved 7-3-2020. Edited.\n
2- "Omega-3 Fatty Acids: An Essential Contribution", www.hsph.harvard.edu, Retrieved 7-3-2020. Edited.\n
3- Luc Djoussé, Donna Arnett, Jeffrey Carr and others (6-2005), "Dietary Linolenic Acid Is Inversely Associated With Calcified Atherosclerotic Plaque in the Coronary Arteries", American Heart Association, Issue 22, Folder 111, Page 2921-2926. Edited.\n
4- S Lundbye-Christensen, A Tjoenneland, K Overvad and others (21-10-2019), "P3425 Alpha-linolenic acid may lower the rate of atherosclerotic cardiovascular disease in subjects with a low intake of marine n-3 fatty acids", European Heart Journal, Issue Supplement_1, Folder 40, Page ehz745.0299. Edited.\n
5- Jennifer Fleming, Penny Kris-Etherton (3-11-2014), "The Evidence for α-Linolenic Acid and Cardiovascular Disease Benefits: Comparisons with Eicosapentaenoic Acid and Docosahexaenoic Acid", Advances in Nutrition, Issue 6, Folder 5, Page 863S–876S. Edited.\n
6- "ALPHA-LINOLENIC ACID (ALA)", www.webmd.com, Retrieved 13-3-2020. Edited.\n
7- Hiroyuki Takeuchi, Chika Sakurai, Ryuuji Noda and others (2007), "Antihypertensive Effect and Safety of Dietary α-Linolenic Acid in Subjects with High-Normal Blood Pressure and Mild Hypertension", Journal of Oleo Science, Issue 7, Folder 56, Page 347-360. Edited.\n
8- Vida Mohammadi, Sirous Dehghani, Gholamreza Askari (2017), "Does Alpha-lipoic Acid Supplement Regulate Blood Pressure? A Systematic Review of Randomized, Double-blind Placebo-controlled Clinical Trials", International Journal of Preventive Medicine, Issue 33, Folder 8, Page 1-5. Edited.\n
9- "Alpha-Linolenic Acid", www.medicinenet.com,18-9-2019، Retrieved 13-3-2020. Edited.\n
10- "ALPHA-LINOLENIC ACID", www.rxlist.com,17-9-2019، Retrieved 14-3-2020. Edited.
''';
  static const String article3 = '''
1- "Healthy Sleep", www.medlineplus.gov, Retrieved 24-02-2020. Edited.\n
2- Reasons Why Good Sleep Is Important", www.healthline.com, Retrieved 24-02-2020. Edited.\n
3- "Surprising Reasons to Get More Sleep", www.webmd.com, Retrieved 24-02-2020. Edited.\n
4- "النوم الصحي", www.youtube.com, Retrieved 24-02-2020.
''';
  static const String article4 = '''
1- "WHAT IS SLEEP AND WHY IS IT IMPORTANT", www.sleepassociation.org, 2020-04-24, Retrieved 2020-04-24. Edited.\n
2- "National Sleep Foundation has created a list of 25 random facts about sleep. But were not restricting this information to our 25 closest friends. Share it with everyone you know", www.sleepfoundation.org, 2020-04-24, Retrieved 2020-04-24. Edited.\n
3- "Sleep tips: 6 steps to better sleep", www.mayoclinic.org, 2020-04-24, Retrieved 2020-04-24. Edited.\n
''';
  static const String article5 = '''
1- "WHAT IS SLEEP AND WHY IS IT IMPORTANT", www.sleepassociation.org, 2020-04-24, Retrieved 2020-04-24. Edited.\n
2- "National Sleep Foundation has created a list of 25 random facts about sleep. But were not restricting this information to our 25 closest friends. Share it with everyone you know", www.sleepfoundation.org, 2020-04-24, Retrieved 2020-04-24. Edited.\n
3- "Sleep tips: 6 steps to better sleep", www.mayoclinic.org, 2020-04-24, Retrieved 2020-04-24. Edited.
''';
  static const String article6 = '''
1- Sara Lindberg (2018-5-10), "Cold Showers vs. Hot Showers: Which One Is Better?"، healthline, Retrieved 2018-7-10. Edited.\n
2- Kathryn Watson (2017-4-11), "Cold Shower Benefits for Your Health"، healthline, Retrieved 2018-7-10. Edited.\n
3- Daniel Wallen, "5 Surprising Benefits of Cold Showers"، lifehack.org, Retrieved 2018-7-10. Edited.
''';
  static const String article7 = '''
1- Diane Koopman, "10 Scientifically Proven Health Benefits of Taking a Bath"، www.lifehack.org, Retrieved 13-5-2018. Edited.\n
2- DEBORAH DUNHAM (18-7-2017), "Hot Shower Benefits"، www.livestrong.com, Retrieved 13-5-2018. Edited.
''';
  static const String article8 = '''
1- "Caffeine in the management of patients with headache", biomedcentral, Retrieved 4/8/2021. Edited.\n
2- "Caffeine dosing strategies to optimize alertness during sleep loss", wiley, Retrieved 4/8/2021. Edited.\n
3- "Coffee, tea, and caffeine consumption and prevention of late-life cognitive decline and dementia: A systematic review", springer, Retrieved 4/8/2021. Edited.\n
4- "Wake up and smell the coffee: caffeine supplementation and exercise performance—an umbrella review of 21 published meta-analyses FREE", bjsm, Retrieved 17/7/2021. Edited.\n
5- "Caffeine for asthma", ncbi, Retrieved 17/7/2021. Edited.\n
6- "Long-term effects of coffee and caffeine intake on the risk of pre-diabetes and type 2 diabetes: Findings from a population with low coffee consumption", sciencedirect, Retrieved 4/8/2021. Edited.\n
7- "Caffeine", emedicinehealth, Retrieved 17/7/2021. Edited.\n
8- "Systematic review with meta-analysis: coffee consumption and the risk of gallstone disease", wiley, Retrieved 4/8/2021. Edited.\n
9- "Caffeine", webmd, Retrieved 17/7/2021. Edited.\n
10- "Caffeine", emedicinehealth, Retrieved 17/7/2021. Edited.\n
11- "Caffeine Enhances Memory Performance in Young Adults during Their Non-optimal Time of Day", ncbi, Retrieved 17/7/2021. Edited.\n
12- "Coffee Intake and Obesity: A Meta-Analysis", ncbi, Retrieved 17/7/2021. Edited.\n
13- "The Role of Caffeine in Pain Management: A Brief Literature Review", ncbi, Retrieved 17/7/2021. Edited.\n
14- "Caffeine as symptomatic treatment for Parkinson disease (Café-PD)", ncbi, Retrieved 4/8/2021. Edited.
''';
  static const String article9 = '''
1- "Coffee", www.webmd.com, Retrieved 10-3-2021. Edited.\n
2-"Coffee", www.emedicinehealth.com, Retrieved 10-3-2021. Edited.\n
3- "COFFEE", www.rxlist.com, Retrieved 10-3-2021. Edited.\n
4- "Coffee", www.medicinenet.com, Retrieved 10-3-2021. Edited.\n
5- Hannah Nichols (16-10-2017), "What does caffeine do to your body?"، www.medicalnewstoday.com, Retrieved 10-3-2021. Edited.\n
6- RE Dixon, SJ Hwang, FC Britton, and others (2011), "Inhibitory effect of caffeine on pacemaker activity in the oviduct is mediated by cAMP‐regulated conductances", British Journal of Pharmacology, Issue 4, Folder 163, Page 745-754. Edited.\n
7- "Caffeine intake linked to urinary incontinence", www.uab.edu, Retrieved 25-3-2010. Edited.\n
8- Ann I Scher , Walter F Stewart, Richard B Lipton (2004), "Caffeine as a risk factor for chronic daily headache: a population-based study", Neurology, Issue 11, Folder 63, Page 2022-2027. Edited.
''';
  static const String article10 = '''
1- "Abdominal muscles", www.betterhealth.vic.gov.au, Retrieved 28/4/2022. Edited.\n
2- "Abdominal Muscles", my.clevelandclinic.org, Retrieved 28/4/2022. Edited.\n
3- "Abdominal muscles", www.betterhealth.vic.gov.au, Retrieved 28/4/2022. Edited.\n
4- "Abdominal Muscles Location and Function", www.verywellfit.com, Retrieved 28/4/2022. Edited.\n
5- "Abdominal Muscles", my.clevelandclinic.org, Retrieved 28/4/2022. Edited.\n
6- "5 reasons you can't see your six-pack", www.menshealth.com, Retrieved 28-04-2022. Edited.\n
7- "Abdominal muscles", www.betterhealth.vic.gov.au, Retrieved 28/4/2022. Edited.\n
8- "The Best Ways to Get Abs (With or Without a Six-Pack)", www.healthline.com, Retrieved 28-04-2022. Edited.
''';
  static const String article11 = '''
1-"What You Should Know About Synthol Injections", healthline, Retrieved 27/4/2022. Edited.\n
2- "Why Are Bodybuilders Using Synthol?", verywellfit, Retrieved 27/4/2022. Edited.\n
3-"Shocking Side Effects of Site Enhancement Oils", gethow, Retrieved 27/4/2022. Edited.\n
4- "7 Muscle-Building Strategies for Guys", webmd, Retrieved 27/4/2022. Edited.
''';
  static const String article12 = '''
1-"Bodybuilding Meal Plan: What to Eat, What to Avoid", healthline, Retrieved 21/8/2021. Edited.\n
2- "Is Peanut Butter Good or Bad for Your Health?", healthline, Retrieved 21/8/2021. Edited.\n
3- "Peanuts Can Fuel Your Fitness, Sports & Fitness Nutrition Expert says", nationalpeanutboard, Retrieved 21/8/2021. Edited.\n
4- "Can peanut butter affect weight gain?", medicalnewstoday, Retrieved 21/8/2021. Edited.\n
5- "Peanuts Can Fuel Your Fitness, Sports & Fitness Nutrition Expert says", nationalpeanutboard, Retrieved 21/8/2021. Edited.\n
6- "Is peanut butter good for you?", medicalnewstoday, Retrieved 20-7-2021. Edited.\n
7- "Is Peanut Butter Good or Bad for Your Health?", healthline, Retrieved 20-7-2021.\n
8- "THE PROS OF ANTIOXIDANTS", muscleandfitness, Retrieved 21/8/2021. Edited.
''';
  static const String article13 = '''
1- James Cerbie, "The Greatest Push-up Article In The History of Ever"، Tony Gentilcore, Retrieved 12-11-2016. Edited.\n
2- Jody Braverman (10-11-2016), "What Are the Benefits of Push-Ups?"، LIVESTRONG, Retrieved 12-11-2016. Edited.\n
3- Nora Tobin (26-5-2015), "5 Reasons To Do Push-Ups Everyday"، mindbodygreen, Retrieved 12-11-2016. Edited.\n
4- Dan Harriman (7-8-2016), "Do push-ups or sprinting make your heart beat faster?"، LIVESTRONG, Retrieved 12-11-2016. Edited.\n
5- John Berardi (3-4-2015), "The Importance Of Post Workout Nutrition!"، BodyBuilding.com, Retrieved 12-11-2016. Edited.\n
6- Elizabeth Quinn (20-6-2016), "Should You Warm Up Before Exercise?"، verywell, Retrieved 12-11-2016. Edited.\n
7- Sarah Klein (19-9-2014), "Why The Pushup Is The World's Greatest Exercise"، THE HUFFINGTON POST, Retrieved 12-11-2016. Edited.ted.
''';
  static const String article14 = '''
1- George Krucik, "What Causes Muscle Wasting?"، www.healthline.com, Retrieved 22-3-2018. Edited.\n
2- "Muscular atrophy", www.webmd.boots.com, Retrieved 22-3-2018. Edited.\n
3- "Muscle atrophy", www.medlineplus.gov, Retrieved 22-3-2018. Edited.
''';
  static const String article15 = '''
1- BILLY RESTREPO (11-9-2017), "How to Get Ripped Abs & Gain Muscle Weight"، www.livestrong.com, Retrieved 22-12-2017. Edited.\n
2- "Slide show: Exercises to improve your core strength", www.mayoclinic.org,20-7-2017، Retrieved 22-12-2017. Edited.\n
3- "Slide show: Exercises to improve your core strength", www.mayoclinic.org,20-7-2107، Retrieved 22-12-2017. Edited.\n
4- Brook Jimenez (2-11-2016), "5Ways To Gently Begin Strengthening Your Core"، www.prevention.com, Retrieved 22-12-2017. Edited.
''';
  static const String article16 = '''
1- "When it comes to protein, how much is too much?", www.health.harvard.edu,5-2018، Retrieved 13-10-2020. Edited.\n
2- Brad Jon Schoenfeld, Alan Albert Aragon (27-2-2018), "How much protein can the body use in a single meal for muscle-building? Implications for daily protein distribution", Journal of the International Society of Sports Nutrition, Issue 10, Folder 15, Page 1-6. Edited.\n
3- Juma Iraki, Peter Fitschen, Sergio Espinar and others (26-6-2019), "Nutrition Recommendations for Bodybuilders in the Off-Season: A Narrative Review", Sports, Issue 7, Folder 7, Page 1-19. Edited.\n
4- Douglas Paddon-Jones (15-3-2017), "Protein Recommendations for Bodybuilders: In This Case, More May Indeed Be Better", The Journal of Nutrition, Issue 5, Folder 147, Page 723-724. Edited.\n
5- Kris Gunnars (5-7-2018), "Protein Intake – How Much Protein Should You Eat Per Day?"، www.healthline.com, Retrieved 14-10-2020. Edited.\n
6- "Protein", www.betterhealth.vic.gov.au,3-2020، Retrieved 14-10-2020. Edited.\n
7- Paul Rogers (28-7-2020), "How Much Protein Is Too Much in Bodybuilding?"، www.verywellfit.com, Retrieved 14-10-2020. Edited.\n
8- Alexandra Caspero (20-7-2020), "Protein and the Athlete — How Much Do You Need?"، www.eatright.org, Retrieved 14-10-2020. Edited.
''';
  static const String article17 = '''
1- Arlene Semeco (20-9-2016), "Post-Workout Nutrition: What to Eat After a Workout"، www.healthline.com, Retrieved 24-5-2021. Edited.\n
2- Lana Barhum (24-1-2021), "What should you eat after working out?"، www.medicalnewstoday.com, Retrieved 24-5-2021. Edited.\n
3- "Pre and Post Workout: What to Eat and Drink", www.recreation.gsu.edu,9-10-2020، Retrieved 25-5-2021. Edited.\n
4- Stephanie Eckelkamp (25-4-2018), "What to Eat Before and After Your Workout"، www.everydayhealth.com, Retrieved 25-5-2021. Edited.\n
5- "Eating and exercise: 5 tips to maximize your workouts", www.mayoclinic.org,17-10-2019، Retrieved 25-5-2021. Edited.\n
6- "Food as Fuel Before, During and After Workouts", www.heart.org,2-6-2015، Retrieved 26-5-2021. Edited.\n
7- Alan Aragon, Brad Schoenfeld (29-1-2013), "Nutrient timing revisited: is there a post-exercise anabolic window?", Journal of the International Society of Sports Nutrition, Issue 1, Folder 10, Page 1-11. Edited.\n
8- " What to Eat Before and After a Worko
''';
  static const String article18 = '''
1- "Vitamins and Minerals", kidshealth.org, Retrieved 9-6-2018. Edited.
2- "Vitamins and Minerals", www.helpguide.org, Retrieved 9-6-2018. Edited.
3- ELANA GOLDBERG (30-10-2013), "11 Essential Vitamins and Minerals Your Body Needs", www.goodnet.org, Retrieved 9-6-2018. Edited.''';
  static const String article19 = '''
1- Jon Johnson (2020-5-5), "What are the best times to sleep and wake up?"، www.medicalnewstoday.com, Retrieved 2021-4-17. Edited.\n
2- "Is sleeping during daytime good or bad? Here are five things you need to know about napping!", www.timesnownews.com,2018-6-25، Retrieved 2021-4-17. Edited.\n
3- Taylor Jones (2020-12-8), "How Many Hours of Sleep Do You Really Need?"، www.healthline.com, Retrieved 2021-4-17. Edited.\n
4- Eric Suni (2021-3-9), "How Much Sleep Do We Really Need?"، www.sleepfoundation.org, Retrieved 2021-4-17. Edited.
''';
  static const String article20 = '''
1-"Here’s What Happens When You Don't Get Enough Sleep (And How Much You Really Need a Night)", health.clevelandclinic.org,2020-6-16، Retrieved 2021-4-17. Edited.''';
  static const String article21 = '''
1- "Dietary Fibre", www.nrv.gov.au,9-5-2019، Retrieved 2-6-2020. Edited.\n
2- "Dietary fibre", www.ifst.org, Retrieved 2-6-2020. Edited.\n
3- Deepak Mudgil (2017), "Dietary Fiber"، www.sciencedirect.com, Retrieved 2-6-2020. Edited.\n
4- Joe Leech (4-6-2017), "Good Fiber, Bad Fiber - How The Different Types Affect You"، www.healthline.com, Retrieved 2-6-2020. Edited.\n
5- Fan-Jhen Daia, Chi-Fai Chau (1-2017), "Classification and regulatory perspectives of dietary fiber"، www.sciencedirect.com, Retrieved 2-6-2020. Edited.\n
6- Tim Newman (27-4-2020), "Why do we need dietary fiber?"، www.medicalnewstoday.com, Retrieved 3-6-2020. Edited.\n
7- "Fiber", www.lpi.oregonstate.edu, Retrieved 3-6-2020. Edited.\n
8- "Soluble vs. insoluble fiber", www.medlineplus.gov, Retrieved 3-6-2020. Edited.
''';
  static const String article22 = '''
1- Rachael Link (11/1/2022), "9 Unique Benefits of Coffee", healthline, Retrieved 24/1/2022. Edited.\n
2- Rudy Mawer (10/9/2021), "How Caffeine Improves Exercise Performance", healthline, Retrieved 24/1/2022. Edited.\n
3-Darla Leal (28/9/2020), "6 Ways Coffee Can Enhance Your Athletic Performance", verywellfit, Retrieved 24/1/2022. Edited.\n
4- Joseph Nordqvist (7/12/2021), "Is coffee good for you? Health benefits, disadvantages, and more", medicalnewstoday, Retrieved 16/5/2022. Edited.\n
5- Franziska Spritzler (14/8/2017), "9 Side Effects of Too Much Caffeine", healthline, Retrieved 23/1/2022. Edited.
''';
  static const String article23 = '''
1- " Low Back Pain Fact Sheet", www.ninds.nih.gov,27-4-2020، Retrieved 16-2-2021. Edited.\n
2- Akhil Chhatre, "Lower Back Pain: What Could It Be?"، www.hopkinsmedicine.org, Retrieved 16-2-2021. Edited.\n
3- William C. Shiel Jr. (24-5-2020), "Low Back Pain"، www.emedicinehealth.com, Retrieved 16-2-2021. Edited.\n
4- John Peloza (20-4-2017), "Causes of Lower Back Pain"، www.spine-health.com, Retrieved 16-2-2021. Edited.
''';
  static const String article24 = '''
1- William C. Lloyd III, MD, FACS (3-12-2020), "Neck Spasm"، www.healthgrades.com, Retrieved 10-12-2020. Edited\n
2- Michael D Freeman, MedDr, PhD, MPH, FAAFS(11-9-2019), "Cervical Sprain and Strain"، emedicine.medscape.com, Retrieved 11-12-2020. Edited.\n
3- Lana Burgess (12-3-2018), "How do you relieve neck spasms?"، www.medicalnewstoday.com, Retrieved 11-12-2020. Edited.\n
4- "Patient education: Neck pain (Beyond the Basics)", www.uptodate.com, Retrieved 13-12-2020. Edited.\n
5- "Neck Spasm", hhma.org, Retrieved 13-12-2020. Edited.\n
6- Ron Miller, PT (27-3-2019), "Understanding Neck Spasms"، www.spine-health.com, Retrieved 13-12-2020. Edited.\n
7- "Treatment of Muscle Spasms in the Neck in NJ | Pain Management Doctor", redefinehealthcare.com, Retrieved 13-12-2020. Edited.\n
8- "Neck Spasm: Care Instructions", myhealth.alberta.ca,8-4-2020، Retrieved 13-12-2020. Edited.
''';
  static const String article25 = '''
1- "Tennis elbow", www.mayoclinic.org, Retrieved 27-4-2019. Edited.\n
2- "Tennis Elbow (Lateral Epicondylitis)", orthoinfo.aaos.org, Retrieved 27-4-2019. Edited.\n
3- "All you need to know about tennis elbow", www.medicalnewstoday.com, Retrieved 27-4-2019. Edited.
''';
  static const String article26 = '''
1- Sergei Jargin (15-12-2014), "Soy and phytoestrogens: possible side effects", German medical science, Folder 12, Page 1-6. Edited.\n
2- Jill Hamilton-Reeves, Gabriela Vazquez, Sue Duval and others (2010), "Clinical studies show no effects of soy protein or isoflavones on reproductive hormones in men: results of a meta-analysis", Fertility and sterility, Issue 3, Folder 94, Page 997-1007. Edited.\n
3- Mark Messina (2016), "Soy and Health Update: Evaluation of the Clinical and Epidemiologic Literature", Nutrients, Issue 12, Folder 8, Page 754. Edited.\n
4- "SOY", www.rxlist.com,17-9-2019، Retrieved 10-3-2021. Edited.\n
5- "Soy", www.webmd.com, Retrieved 10-3-2021. Edited.\n
6- Atli Arnarson (20-3-2019), "Soybeans 101: Nutrition Facts and Health Effects"، www.healthline.com, Retrieved 10-3-2021. Edited.\n
''';
  static const String article27 = '''
1- "Protein", www.accessdata.fda.gov, Retrieved 2019-9-25. Edited.\n
2- proteinsKrajcovicova-Kudlackova M, Babinska K, Valachovicova M (2005), "Health benefits and risks of plant proteins", Bratislava Medical Journal, Issue 106, Folder 6-7, Page 231-234. Edited.\n
3- Mary Jane Brown (2017-6-17), "Animal vs Plant Protein - What's the Difference?"، www.healthline.com, Retrieved 2019-9-25. Edited.\n
4- Michelle McMackenm, Sapana Shah (2017), "A plant-based diet for the prevention and treatment of type 2 diabetes", Journal of Geriatric Cardiology, Issue 5, Folder 14, Page 342–354. Edited.\n
5- Appel LJ, Sacks FM, Carey VJ, and others (2005), "Effects of protein, monounsaturated fat, and carbohydrate intake on blood pressure and serum lipids: results of the OmniHeart randomized trial.", The Journal of American Medical Association , Issue 294, Folder 16, Page 2455-2464. Edited.\n
6- Chesney K Richter, Ann C Skulas-Ray, Catherine M Champagne, and others (2015), "Plant Protein and Animal Proteins: Do They Differentially Affect Cardiovascular Disease Risk?", Advances in Nutrition, Issue 6, Folder 6, Page 712–728. Edited.
''';
  static const String article28 = '''
1- Charushila Biswas (08-01-2020), "30 Swiss Ball Exercises For The Upper Body, Abs, Back, And Lower Body", stylecraze, Retrieved 09-19-2020. Edited.\n
2- "Benefits of Using an Exercise Ball", healthandcare, 10-09-2018, Retrieved 09-19-2020. Edited.\n
3- Paige Waehner (09-16-2020), "How to Choose the Right Exercise Ball", verywellfit, Retrieved 09-19-2020. Edited.\n
4- Marguerite Ogle (2019-06-23), "Easy Exercise Ball Workout for Beginners", verywellfit, Retrieved 2020-09-19. Edited.
''';
  static const String article29 = '''
1- "Exercise: 7 benefits of regular physical activity", www.mayoclinic.org, Retrieved 7-24-2020. Edited.\n
2- "8 Common Myths About Exercise", secondscount, Retrieved 7-24-2020. Edited.\n
3- "8 Common Myths About Exercise", www.secondscount.org, Retrieved 7-24-2020. Edited.\n
4- Rachel Hosie (2018-4-23), "FIVE PROTEIN MYTHS DEBUNKED", independent, Retrieved 2020-7-24.Edited\n
5- Pauline Nordin (2019-4-4), "25 More Fitness Myths Crushed By Pauline Nordin!"، bodybuilding, Retrieved 2020-7-24.\n
''';
  static const String article30 = '''
1- "Exercise: 7 benefits of regular physical activity", www.mayoclinic.org, Retrieved 7-24-2020. Edited.\n
2- "8 Common Myths About Exercise", secondscount, Retrieved 7-24-2020. Edited.\n
3- "8 Common Myths About Exercise", www.secondscount.org, Retrieved 7-24-2020. Edited.\n
4- Rachel Hosie (2018-4-23), "FIVE PROTEIN MYTHS DEBUNKED", independent, Retrieved 2020-7-24.Edited\n
5- Pauline Nordin (2019-4-4), "25 More Fitness Myths Crushed By Pauline Nordin!"، bodybuilding, Retrieved 2020-7-24.\n
''';
}
