class RecipesImage {
  ////////////////////// == MainDishes == /////////////////////
  static const String mainDishe1 = "assets/images/recipes/mainDishe1.jpg";
  static const String mainDishe2 = "assets/images/recipes/mainDishe2.jpg";
  static const String mainDishe3 = "assets/images/recipes/mainDishe3.jpg";
  static const String mainDishe4 = "assets/images/recipes/mainDishe4.jpg";
  static const String mainDishe5 = "assets/images/recipes/mainDishe5.jpg";
  static const String mainDishe6 = "assets/images/recipes/mainDishe6.jpg";
  static const String mainDishe7 = "assets/images/recipes/mainDishe7.jpg";
  static const String mainDishe8 = "assets/images/recipes/mainDishe8.jpg";
  static const String mainDishe9 = "assets/images/recipes/mainDishe9.jpg";
  static const String mainDishe10 = "assets/images/recipes/mainDishe10.jpg";
  static const String mainDishe11 = "assets/images/recipes/mainDishe11.jpg";
  static const String mainDishe12 = "assets/images/recipes/mainDishe12.jpg";
  static const String mainDishe13 = "assets/images/recipes/mainDishe13.jpg";
  static const String mainDishe14 = "assets/images/recipes/mainDishe14.jpg";
  static const String mainDishe15 = "assets/images/recipes/mainDishe15.jpg";
  static const String mainDishe16 = "assets/images/recipes/mainDishe16.jpg";
  static const String mainDishe17 = "assets/images/recipes/mainDishe17.jpg";
  static const String mainDishe18 = "assets/images/recipes/mainDishe18.jpg";
  static const String mainDishe19 = "assets/images/recipes/mainDishe19.jpg";
  static const String mainDishe20 = "assets/images/recipes/mainDishe20.jpg";
  static const String mainDishe21 = "assets/images/recipes/mainDishe21.jpg";
  static const String mainDishe22 = "assets/images/recipes/mainDishe22.jpg";
  static const String mainDishe23 = "assets/images/recipes/mainDishe23.jpg";
  static const String mainDishe24 = "assets/images/recipes/mainDishe24.jpg";
  static const String mainDishe25 = "assets/images/recipes/mainDishe25.jpg";
  static const String mainDishe26 = "assets/images/recipes/mainDishe26.jpg";
  static const String mainDishe27 = "assets/images/recipes/mainDishe27.jpg";
  static const String mainDishe28 = "assets/images/recipes/mainDishe28.jpg";
  static const String mainDishe29 = "assets/images/recipes/mainDishe29.jpg";
  static const String mainDishe30 = "assets/images/recipes/mainDishe30.jpg";

  ////////////////////// == Desserts == /////////////////////
  static const String dessert1 = "assets/images/recipes/dessert1.jpg";
  static const String dessert2 = "assets/images/recipes/dessert2.jpg";
  static const String dessert3 = "assets/images/recipes/dessert3.jpg";
  static const String dessert4 = "assets/images/recipes/dessert4.jpg";
  static const String dessert5 = "assets/images/recipes/dessert5.jpg";
  static const String dessert6 = "assets/images/recipes/dessert6.jpg";
  static const String dessert7 = "assets/images/recipes/dessert7.jpg";
  static const String dessert8 = "assets/images/recipes/dessert8.jpg";
  static const String dessert9 = "assets/images/recipes/dessert9.jpg";
  static const String dessert10 = "assets/images/recipes/dessert10.jpg";
  static const String dessert11 = "assets/images/recipes/dessert11.jpg";
  static const String dessert12 = "assets/images/recipes/dessert12.jpg";
  static const String dessert13 = "assets/images/recipes/dessert13.jpg";
  static const String dessert14 = "assets/images/recipes/dessert14.jpg";
  static const String dessert15 = "assets/images/recipes/dessert15.jpg";
  static const String dessert16 = "assets/images/recipes/dessert16.jpg";
  static const String dessert17 = "assets/images/recipes/dessert17.jpg";
  static const String dessert18 = "assets/images/recipes/dessert18.jpg";
  static const String dessert19 = "assets/images/recipes/dessert19.jpg";
  static const String dessert20 = "assets/images/recipes/dessert20.jpg";
  static const String dessert21 = "assets/images/recipes/dessert21.jpg";
  static const String dessert22 = "assets/images/recipes/dessert22.jpg";
  static const String dessert23 = "assets/images/recipes/dessert23.jpg";
  static const String dessert24 = "assets/images/recipes/dessert24.jpg";
  static const String dessert25 = "assets/images/recipes/dessert25.jpg";
  static const String dessert26 = "assets/images/recipes/dessert26.jpg";
  static const String dessert27 = "assets/images/recipes/dessert27.jpg";
  static const String dessert28 = "assets/images/recipes/dessert28.jpg";
  static const String dessert29 = "assets/images/recipes/dessert29.jpg";
  static const String dessert30 = "assets/images/recipes/dessert30.jpg";

  //////////////////// == Sos == ////////////////////////
  static const String sos1 = "assets/images/recipes/sos1.jpg";
  static const String sos2 = "assets/images/recipes/sos2.jpg";
  static const String sos3 = "assets/images/recipes/sos3.jpg";
  static const String sos4 = "assets/images/recipes/sos4.jpg";
  static const String sos5 = "assets/images/recipes/sos5.jpg";
  static const String sos6 = "assets/images/recipes/sos6.jpg";
  static const String sos7 = "assets/images/recipes/sos7.jpg";
  static const String sos8 = "assets/images/recipes/sos8.jpg";
  static const String sos9 = "assets/images/recipes/sos9.jpg";
  static const String sos10 = "assets/images/recipes/sos10.jpg";
  static const String sos11 = "assets/images/recipes/sos11.jpg";
  static const String sos12 = "assets/images/recipes/sos12.jpg";
  static const String sos13 = "assets/images/recipes/sos13.jpg";
  static const String sos14 = "assets/images/recipes/sos14.jpg";
  static const String sos15 = "assets/images/recipes/sos15.jpg";
  static const String sos16 = "assets/images/recipes/sos16.jpg";
  static const String sos17 = "assets/images/recipes/sos17.jpg";
  static const String sos18 = "assets/images/recipes/sos18.jpg";
  static const String sos19 = "assets/images/recipes/sos19.jpg";
  static const String sos20 = "assets/images/recipes/sos20.jpg";
  static const String sos21 = "assets/images/recipes/sos21.jpg";
  static const String sos22 = "assets/images/recipes/sos22.jpg";
  static const String sos23 = "assets/images/recipes/sos23.jpg";
  static const String sos24 = "assets/images/recipes/sos24.jpg";
  static const String sos25 = "assets/images/recipes/sos25.jpg";
  static const String sos26 = "assets/images/recipes/sos26.jpg";
  static const String sos27 = "assets/images/recipes/sos27.jpg";
  static const String sos28 = "assets/images/recipes/sos28.jpg";
  static const String sos29 = "assets/images/recipes/sos29.jpg";
  static const String sos30 = "assets/images/recipes/sos30.jpg";

  ////////////// == Side dishes == ///////////////////
  static const String sideDishe1 = "assets/images/recipes/sideDishe1.jpg";
  static const String sideDishe2 = "assets/images/recipes/sideDishe2.jpg";
  static const String sideDishe3 = "assets/images/recipes/sideDishe3.jpg";
  static const String sideDishe4 = "assets/images/recipes/sideDishe4.jpg";
  static const String sideDishe5 = "assets/images/recipes/sideDishe5.jpg";
  static const String sideDishe6 = "assets/images/recipes/sideDishe6.jpg";
  static const String sideDishe7 = "assets/images/recipes/sideDishe7.jpg";
  static const String sideDishe8 = "assets/images/recipes/sideDishe8.jpg";
  static const String sideDishe9 = "assets/images/recipes/sideDishe9.jpg";
  static const String sideDishe10 = "assets/images/recipes/sideDishe10.jpg";
  static const String sideDishe11 = "assets/images/recipes/sideDishe11.jpg";
  static const String sideDishe12 = "assets/images/recipes/sideDishe12.jpg";
  static const String sideDishe13 = "assets/images/recipes/sideDishe13.jpg";
  static const String sideDishe14 = "assets/images/recipes/sideDishe14.jpg";
  static const String sideDishe15 = "assets/images/recipes/sideDishe15.jpg";
  static const String sideDishe16 = "assets/images/recipes/sideDishe16.jpg";
  static const String sideDishe17 = "assets/images/recipes/sideDishe17.jpg";
  static const String sideDishe18 = "assets/images/recipes/sideDishe18.jpg";
  static const String sideDishe19 = "assets/images/recipes/sideDishe19.jpg";
  static const String sideDishe20 = "assets/images/recipes/sideDishe20.jpg";
  static const String sideDishe21 = "assets/images/recipes/sideDishe21.jpg";
  static const String sideDishe22 = "assets/images/recipes/sideDishe22.jpg";
  static const String sideDishe23 = "assets/images/recipes/sideDishe23.jpg";
  static const String sideDishe24 = "assets/images/recipes/sideDishe24.jpg";
  static const String sideDishe25 = "assets/images/recipes/sideDishe25.jpg";
  static const String sideDishe26 = "assets/images/recipes/sideDishe26.jpg";
  static const String sideDishe27 = "assets/images/recipes/sideDishe27.jpg";
  static const String sideDishe28 = "assets/images/recipes/sideDishe28.jpg";
  static const String sideDishe29 = "assets/images/recipes/sideDishe29.jpg";
  static const String sideDishe30 = "assets/images/recipes/sideDishe30.jpg";

  ///////////////// == Breakfast Dishes == //////////////////////
  static const String breakfastDishe1 =
      "assets/images/recipes/breakfastDishe1.jpg";
  static const String breakfastDishe2 =
      "assets/images/recipes/breakfastDishe2.jpg";
  static const String breakfastDishe3 =
      "assets/images/recipes/breakfastDishe3.jpg";
  static const String breakfastDishe4 =
      "assets/images/recipes/breakfastDishe4.jpg";
  static const String breakfastDishe5 =
      "assets/images/recipes/breakfastDishe5.jpg";
  static const String breakfastDishe6 =
      "assets/images/recipes/breakfastDishe6.jpg";
  static const String breakfastDishe7 =
      "assets/images/recipes/breakfastDishe7.jpg";
  static const String breakfastDishe8 =
      "assets/images/recipes/breakfastDishe8.jpg";
  static const String breakfastDishe9 =
      "assets/images/recipes/breakfastDishe9.jpg";
  static const String breakfastDishe10 =
      "assets/images/recipes/breakfastDishe10.jpg";
  static const String breakfastDishe11 =
      "assets/images/recipes/breakfastDishe11.jpg";
  static const String breakfastDishe12 =
      "assets/images/recipes/breakfastDishe12.jpg";
  static const String breakfastDishe13 =
      "assets/images/recipes/breakfastDishe13.jpg";
  static const String breakfastDishe14 =
      "assets/images/recipes/breakfastDishe14.jpg";
  static const String breakfastDishe15 =
      "assets/images/recipes/breakfastDishe15.jpg";
  static const String breakfastDishe16 =
      "assets/images/recipes/breakfastDishe16.jpg";
  static const String breakfastDishe17 =
      "assets/images/recipes/breakfastDishe17.jpg";
  static const String breakfastDishe18 =
      "assets/images/recipes/breakfastDishe18.jpg";
  static const String breakfastDishe19 =
      "assets/images/recipes/breakfastDishe19.jpg";
  static const String breakfastDishe20 =
      "assets/images/recipes/breakfastDishe20.jpg";
  static const String breakfastDishe21 =
      "assets/images/recipes/breakfastDishe21.jpg";
  static const String breakfastDishe22 =
      "assets/images/recipes/breakfastDishe22.jpg";
  static const String breakfastDishe23 =
      "assets/images/recipes/breakfastDishe23.jpg";
  static const String breakfastDishe24 =
      "assets/images/recipes/breakfastDishe24.jpg";
  static const String breakfastDishe25 =
      "assets/images/recipes/breakfastDishe25.jpg";
  static const String breakfastDishe26 =
      "assets/images/recipes/breakfastDishe26.jpg";
  static const String breakfastDishe27 =
      "assets/images/recipes/breakfastDishe27.jpg";
  static const String breakfastDishe28 =
      "assets/images/recipes/breakfastDishe28.jpg";
  static const String breakfastDishe29 =
      "assets/images/recipes/breakfastDishe29.jpg";
  static const String breakfastDishe30 =
      "assets/images/recipes/breakfastDishe30.jpg";
}

class RecipesPrepare {
  static const String noodles = '''
1- اخلط الثوم مع الزنجبيل، البهار، الدجاج ونصف كمية صوص الصويا، قلب المزيج جيداً ثم قم بتغطية الوعاء وأدخله البراد لمدة ساعة، مع التحريك من حين الى آخر.\n
2- اسلق النودلز في قدر من الماء المملح مع الزيت، ثم صفّيها جيداً.\n
3- سخنيالقليل من زيت نباتي في مقلاة كبيرة غير لاصقة على نار متوسطة، أضف الدجاج وقلّبه باستمرار حتى النضج. ارفع الدجاج من المقلاة واتركه جانباً.\n
4- في نفس المقلاة، اقل الخضار على نار عالية، مع التحريك.\n
5- أضف النودلز إلى الخضار مع المتبقي من صوص الصويا، قلب المزيج برفق ثم قدَّم الطبق ساخناً مع قطع الدجاج.\n
''';
/////////////// == Main Dishes == /////////////////
  static const String mainDishe1 = '''
1. ضع مكونات البهارات في وعاء، وقلب جيدًا.\n
1. ضع الدجاج في وعاء كبير، ثم أضيف بهارات الفاهيتا والملح، وقلب جيدًا حتى تمتزج المكونات.\n
3. غط الوعاء بورق نايلون شفاف، واتركه جانبًا 30 دقيقة.\n
4. سخن نصف كمية الزيت في مقلاة كبيرة على نار متوسطة، ثم أضيف الدجاج، وقلبه من دقيقتين إلى ثلاث دقائق.
5. اخفض النار، وغطي المقلاة، واتركها من عشر دقائق إلى 15 دقيقة.\n
6. ضع الدجاج في طبق، وغطيه بورق فويل، واتركه جانبًا لتحضير الخضار.\n
7. أضيف باقي الزيت في المقلاة نفسها، ثم أضيف البصل والفلفل الملون والثوم المفروم والملح، وقلب خمس دقائق.\n
8. أضيف المرق وقلبي، ثم اتركه دقيقة.\n
9. أضيف الدجاج وقلب جيدًا، ثم أضيف عصير الليمون وقلب جيدًا.\n
10. ضع الفاهيتا في طبق التقديم، وكلها مع التورتيلا والخس والطماطم وصوص الأفوكادو.
''';
  static const String mainDishe2 = '''
1. في وعاء عميق وواسع، ضع الدقيق والبابريكا واخلطهما جيدا.\n
2. أحضر قطع الدجاج المجهزة مسبقًا والمنقوعة في محلول النقع وضعها في خليط الدقيق.\n
3. أخرج الدجاج من الدقيق وضعه قطعة قطعة في الماء المثلج.\n
4. أعيد قطع الدجاج إلى الدقيق مرة أخرى وغلفها جيدًا.\n
5. سخن كمية من الزيت الغزير في مقلاة عميقة، واقل الدجاج حتى يتخذ لونًا ذهبيًا.
''';
  static const String mainDishe3 = '''
1. ضع جميع مكونات الكريب في الخلاط الكهربائي، واخلط جيدًا حتى تمتزج المكونات.\n
2. ضع العجين في وعاء، وغلفه بورق نايلون، ثم ضعه في الثلاجة 30 دقيقة.\n
3. سخن مقلاة غير قابلة للالتصاق على نار متوسطة، وادهنها بقليل من الزبد.\n
4. وزع ربع كوب في المقلاة، وحركها بطريقة دائرية حتى يُغطي العجين قاع المقلاة.\n
5. اترك العجين دقيقة، ثم اقلبه على الجهة الأخرى، واتركه دقيقة، ثم ضعه في طبق جانبًا.\n
6. كرر الخطوات السابقة مع باقي العجين حتى تنتهي منه.\n
7. ضع جميع البهارات في وعاء كبير، ثم أضيف الماء وقلبي جيدًا.\n
8. أضيف شرائح اللحم وعصير الليمون وملعقتين من الزيت، وقلب جيدًا حتى تمتزج المكونات.\n
9. غلف الوعاء، وضعه في الثلاجة أربع ساعات.\n
10. سخن ملعقة من الزيت في مقلاة كبيرة على نار متوسطة، ثم أضيف البصل مع رشة ملح،  وقلب من خمس إلى ثماني دقائق على نار هادئة حتى يصفر لونه.\n
11. أضيف نصف كمية الزبد، وقلب البصل حتى يُصبح لونه بنيًا فاتحًا.\n
12. ارفع البصل في وعاء، واتركها جانبًا.\n
13. ضع باقي الزيت والزبد في المقلاة نفسها، واتركهما حتى يذوب الزبد.\n
14. أضيف نصف كمية اللحم، وقلبه من دقيقتين إلى ثلاث دقائق حتى يتغير لونه، ثم ارفعه مع البصل.\n
15. أضيف باقي اللحم، وقلبه دقيقتين حتى يتغير لونه، ثم ارفعه مع البصل وباقي اللحم.\n
16. أضيف الفلفل الملون في المقلاة نفسها ونصف ملعقة صغيرة من الملح، وقلب دقيقتين.\n
17. أضيف البصل واللحم وصلصة الطماطم، وقلب جيدًا دقيقة، ثم ارفعه عن النار.\n
18. افرد الكريب على طبق مسطح، ثم وزع الفاهيتا على نصف دائرة الكريب، ثم شكله إلى مثلث.\n
19. حمص كريب الفاهيتا في مقلاة غير قابلة للالتصاق على الجهتين، حتى يُصبح مقرمشًا، ثم كله ساخنًا.
''';
  static const String mainDishe4 = '''
1. في قدر كبيرة على نار متوسطة، أذيب ملعقتي سمن، ثم حمر الدجاج حتى يتغير لونه.\n
2. أضيف المستكة والفلفل الأسود وورق اللورا والحبهان والبصل والفلفل الحار، ثم قلب لدقيقة مع الدجاج.\n
3. أضيف الماء، ثم غط القدر، واتركها حتى ينضج الدجاج.\n
4، نشل الدجاج من المرق، ثم اخلط معجون الطماطم مع الزبد والملح والفلفل الأسود، ثم ادهن الدجاج بالخليط، وحمره في الفرن حتى يكتسب اللون البني.\n
5. اغسل الأرز جيدً، وانقعه 20 دقيقة في الماء، ثم صفه.\n
6. صفي المرق من البصل والبهارات، ثم ضع ثمانية أكواب في قدر مع الأرز، وتبله بالملح والحبهان المطحون، ثم غطي القدر، واتركه على نار هادئة حتى ينضج الأرز.\n
7. أضيف الحليب إلى الأرز، ثم قلب مع هرس الأرز بملعقة خشبية والتقليب من حين لآخر.\n
8. في مقلاة على نار متوسطة، أذيب السمن، ثم اضيف المستكة وقلب حتى تذوب.\n
9. صب نصف كمية السمن فوق الأرز، ثم قلب جيدًا.\n
10. اغرف السليق في طبق التقديم، ثم صب بقية خليط السمن والمستكة على الوجه، ثم رص الدجاج المحمر فوقه، وكله ساخنًا.
''';
  static const String mainDishe5 = '''
1. على نار متوسطة، سخن الزيت والزبد، ثم أضيف البصل المفروم وقلبه حتى يذبل.\n
2. أضيف الطماطم المفرومة والملح والفلفل الأسود والصلصة، واتركها على نار هادئة عشر دقائق.\n
3. أضيف الكزبرة والبقدونس والشبت والكمون، وقلب دقيقتين.\n
4. أضيف اللحم المفروم، وقلبه عشر دقائق حتى يتغير لونه.\n
5. افرد ورقة العنب حتى يكون الجزء الناعم لأسفل، ثم ضع الأرز في طرف الورقة، ولفها مع ثني جانبي الورقة إلى الداخل.\n
6. رص حلقات البصل وشرائح الطماطم في قدر كبيرة، ثم رص ورق العنب فوقها وأضيفي عصير الليمون.\n
7. اغمر ورق العنب بمرق دجاج أو لحم، ثم ضعه على نار متوسطة واتركه حتى يغلي.\n
8. غط القدر، واتركها على نار هادئة جدًا 40 دقيقة حتى ينضج.\n
9. ارفع ورق العنب عن النار، ورصه في طبق التقديم وقدمه ساخنًا.
''';
  static const String mainDishe6 = '''
1. تبل قطع الدجاج بالملح والفلفل، ثم سخن مقلاة على نار متوسطة، ثم أذيب الزبد، وضع الدجاج.\n\
2. قلب الدجاج حتى يكتسب اللون الذهبي، ثم أخرجه من المقلاة.n
3. في المقلاة نفسها ضع البصل، وقلب حتى يذبل، ثم أضيف الثوم والريحان والأوريجانو، وقلب حتى تفوح رائحتها.\n
4. ضع معجون الطماطم، وقلبه لدقيقة، ثم أضيف عصير الطماطم ونصف كوب من ماء سلق المكرونة والبابريكا والفلفل الأسود، واترك الصلصة خمس دقائق حتى تتسبك.\n
5. أضيف كريمة الطهي، وأعيد الدجاج إلى المقلاة، واترك الصلصة على النار ثلاث دقائق، ثم تبلها بالملح.\n
6. قلب المكرونة مع الصوص على النار، ثم ارفعها.\n\
7. غط صينية بايركس بورق القصدير "الألمنيوم"، ثم اغرف المكرونة بها.\n
8. وزع الجبن البارميزان والجبن الموزاريلا على الوجه، ثم غطها بورق القصدير، وأحكم إغلاقه.\n
9. ضع المكرونة في فرن ساخن على درجة حرارة 180 مئوية من 15 إلى 20 دقيقة، ثم أزيل ورق القصدير، وكلها ساخنة.
''';
  static const String mainDishe7 = '''
1. اخفق مكونات الصلصة معًا، واتركها جانبًا.\n
2. سخن قليلًا من الزيت في مقلاة، على نار متوسطة إلى عالية، أضيف الجزر والفلفل الأحمر، واطهي دقيقتين.\n
3. أضيف الجمبري والبصل الأخضر، وتبل بالملح والفلفل، واطهي ثلاث دقائق، أو حتى يتغير لون الجمبري إلى اللون الوردي.\n
4. أضيف الثوم والأناناس، واطهي 30 ثانية إلى دقيقة، مع الحرص على عدم احتراق الثوم.\n
5. صب الصلصة وقلب، لتمتزج النكهات، واطهي دقيقتين مرة أخرى، أو حتى تتكاثف الصلصة.\n
6. ارفع المقلاة عن النار، وقدم الجمبري فوق الأرز أو أرز القرنبيط.
''';
  static const String mainDishe8 = '''
1. في وعاء، اخلط الزبادي مع الكاري والبابريكا والكركم والملح والفلفل الأسود والثوم المفروم والخل وعصير الليمون والزيت لعمل تتبيلة الشيش طاووق.\n
2. قلب الدجاج في التتبيلة، واتركه منقوعًا 30 دقيقة.\n
3. اغرس أفخاذ الدجاج في أسياخ شوي خشبية، واغرس بينها مربعات البصل والفلفل الرومي.\n
4. رص أسياخ الشيش طاووق في صينية فرن، ثم اشويها في فرن مُسخن مُسبقًا على درجة حرارة 200 مئوية من 20 إلى 30 دقيقة.\n
5. في قدر على نار متوسطة، ضع الزبد والزيت وعود القرفة وورق الغار ونجمة الينسون، ثم قلب حتى تفوح الرائحة.\n
6. أضيف الأرز والكركم، وقلب ثواني، ثم أضيف الماء الساخن حتى يغطي الأرز، واتركه حتى يغلي.\n
7. غط القدر، واتركها على نار هادئة حتى ينضج الأرز.\n
8. لعمل الصوص، اخلط الزبادي مع عصير الليمون والثوم المفروم.\n
9. ضع الخبز المحمص في طبق التقديم، ثم اغرف الأرز فوقه، ثم ضع صوص الزبادي، ثم رص أسياخ الشيش طاووق فوقه.
''';
  static const String mainDishe9 = '''
1. اسلق المكرونة بالطريقة المدونة على العبوة.\n
2.  سخن الفرن على درجة حرارة 190 مئوية.\n
3. في وعاء، اخلط جبن الريكوتا مع نصف كمية جبن الموزاريلا والبيض وجوزة الطيب والملح والفلفل الأسود.\n
4. في صينية فرن، ضع نصف كوب صلصة، ووزعها جيدًا، ثم ضع طبقة من اللازانيا، ثم  وزع فوقها ثلث كمية خليط جبن الريكوتا والموزاريلا، ثم رش فوقه ثلث كمية جبن البارميزان المبشور.\n
5. ضع طبقة من اللازانيا، ثم كوبًا من صلصة المكرونة، ثم ثلث خليط جبن الريكوتا والموزاريلا، ثم جبن البارميزان، ثم كررها مرة أخرى.\n
6. ضع طبقة اللازانيا الأخيرة وكوب الصلصة المتبقي، ثم رش فوقها جبن الموزاريلا المتبقي.\n
7. اخبز اللازانيا في الفرن حتى يكتسب جبن الموزاريلا لونًا بُنيًا ذهبيًا من 45 إلى 50 دقيقة.\n
8. اترك اللازانيا تبرد عشر دقائق، ثم قطعها وقدمها.
''';
  static const String mainDishe10 = '''
1. سخن  الزيت على نار متوسطة، ثم أضيف البصل وقلب حتى يتحمر جيدًا، ثم ارفعه عن النار.\n
2. اخفق نصف مقدار البصل المحمر والزبادي والثوم والتوابل المطحونة وملح وفلفل أسود في الخلاط الكهربائي، ثم اترك الخليط جانبًا.\n
3. أضيف اللحم في القدر مكان البصل، وقلب جيدًا حتى يكتسب لونًا بنيًّا، ثم أضيف البطاطس وورق اللورا وعود القرفة والقرنفل، وقلب مرة أخرى.\n
4. أضيف خليط البصل والزبادي وقلب جيدًا حتى تمتزج المكونات، ثم غط القدر، واترك اللحم ينضج على نار هادئة مدة 60 دقيقة أو في قدر الضغط مدة 30 دقيقة.\n
5. اسلق الأرز البسمتي في ماء مع الحبهان وورق اللورا، ثم صفيه من الماء.\n
6. أضيف الأرز المسلوق إلى اللحم، ثم غطي القدر واتركي اللحم والأرز على نار هادئة 15 دقيقة، ثم ارفع القدر عن النار.\n
7. اشعل قطعة فحم ثم ضعها  في ورقة فويل فوق الأرز واللحم، وضع فوقها بعض قطرات زيت، ثم أغلق القدر عدة دقائق.\n
8. ارفع غطاء القدر وأزيل الفحم، ثم ضع ماء الزعفران على الوجه، وكل الزربيان ساخنًا.
''';
  static const String mainDishe11 = '''
1. ضعي الكمون والبابريكا والبهارات والملح والفلفل الأسود في وعاء، وقلبي جيدًا.\n
2. سخني ملعقة من الزيت في مقلاة كبيرة أو صاج، ثم أضيفي البصل وقلبيه دقيقتين.\n
3. أضيفي الفلفل الحار والفلفل الأخضر والملون، وقلبي ثلاث دقائق.\n
4. ارفعي خليط البصل والفلفل في وعاء جانبًا.\n
5. ضعي ملعقة من الزيت وملعقة من الزبد في المقلاة نفسها، واتركيهما حتى يذوب الزبد.\n
6. أضيفي اللحم وقلبيه حتى يُصبح لونه بنيًا، ثم أضيفي نصف الثوم ونصف البهارات، وقلبي دقيقة.\n
7. أضيفي الطماطم وقلبي من ثلاث إلى خمس دقائق، ثم أضيفي نصف كمية البصل والفلفل وقلبي دقيقتين.\n
8. أضيفي نصف كمية البقدونس والكزبرة وقلبي جيدًا، ثم ارفعي اللحم في طبق جانبًا.\n
9. ضعي باقي الزيت والزبد في المقلاة نفسها، واتركيهما حتى يذوب الزبد.\n
10. أضيفي الكبدة وقلبيها حتى تُصبح لونها بنيًا، ثم أضيفي نصف الثوم ونصف البهارات، وقلبي دقيقة.\n
11. أضيفي باقي البصل والفلفل وقلبي دقيقتين، ثم أضيفي عصير الليمون وقلبي حتى تمتزج المكونات.\n
12. أضيفي باقي البقدونس والكزبرة وقلبي جيدًا، ثم ارفعي الكبدة في طبق التقديم.\n
13. قدمي اللحم والكبدة في طبقين منفصلين مع الخبز أو الأرز.
''';
  static const String mainDishe12 = '''
1. سخن الزيت على نار متوسطة، ثم أضيف البصل وقلب حتى يكتسب لونًا ذهبيًّا.\n
2. أضيف الثوم المفروم والطماطم المقطعة وقلب جيدًا، ثم أضيف التوابل وقلب مرة أخرى حتى تمتزج المكونات.\n
3. أضيف الصلصلة وقلب جميع المكونات، ثم أضيف اللحم واغمر المكونات بالماء الساخن، ثم غطي القدر واتركي اللحم 30 دقيقة على نار هادئة حتى ينضج.\n
4. أضيف الملح والفلفل الأسود والبطاطس والفلفل الأخضر وقلب، ثم غطي القدر واتركي المكونات 15 دقيقة إضافية، ثم ارفع القدر عن النار.\n
5. ضع خبز البر في طبق التقديم، ثم أضيف مرق اللحم وانتظري حتى يتشربه الخبز، ثم ضع فوقه اللحم وزينيه بالخضراوات، وكله ساخنًا.
''';
  static const String mainDishe13 = '''
1. ضع الصويا وصلصة المحار والسكر والزنجبيل والثوم وزيت السمسم والفلفل الحار والفلفل الأسود، وقلب جيدًا، ثم اتركه جانبًا.\n
2. اسلق النودلز في ماء مغلي ومملح، واتركها حتى تنضج، ثم صفها من الماء، واتركها جانبًا.\n
3. سخن زيت الزيتون في مقلاة كبيرة على نار متوسطة، ثم أضيف اللحم وقلبه من ثلاث إلى أربع دقائق حتى يُصبح لونه بنيًا، ثم ارفعه عن النار.\n
4. أضيف المشروم والبروكلي والجزر في المقلاة نفسها، وقلب ثلاث إلى أربع دقائق.\n
5. أضيف النودلز واللحم وخليط الصوص، وقلب دقيقتين إلى ثلاث دقائق.\n
6. ضع النودلز باللحم في طبق التقديم، وزينه بالسمسم، ثم كلها ساخنًا.
''';
  static const String mainDishe14 = '''
1. في قدر على نار متوسطة، سخن زيت السمسم، ثم أضيف الثوم البودرة ومعجون الزنجبيل والصوص الحار والصويا صوص وملعقتين كبيرتين ماء ونصف كمية البصل الأخضر، ثم اترك المزيج يغلي دقيقتين.\n
2. أضيف النودلز ومكعب مرق الدجاج والملح، ثم صب فوقها الماء الساخن، واتركها تغلي لدقيقتين، ثم أضيف المشروم.\n
3. غطي القدر، واترك النودلز من ثلاث إلى خمس دقائق حتى تنضج.\n
4. أضيف البيضتين إلى النودلز، ثم اخفق بسرعة، ثم غطي القدر حتى تنضج.\n
5. اغرف النودلز في طبق التقديم، ثم ضع الخضراوات فوقها، ثم رش السمسم المحمص، وكلها.
''';
  static const String mainDishe15 = '''
1. سخن الزيت والزبد في مقلاة كبيرة على نار متوسطة، ثم أضيف البصل وقلبي حتى يصفر لونه.\n
2. أضيف الثوم ومشروم البورتوبيللو، ثم قلب مدة خمس دقائق أخرى.\n
3. تبل الحشو بالملح والفلفل الأسود والقرفة، واتركه على النار حتى ينضج المشروم مدة خمس دقائق، ثم اتركه يبرد تمامًا.\n
4. اقسم العجين نصفين، ثم افردهما.\n
5. ادهن قالب تارت مستطيل بالزبد، ثم ضع قطعة عجين في القالب، واضغط عليها بيديك وغطي جوانب القالب.\n
6. قلب الجبن البارميزان مع جبن الموزاريلا، ثم ضعها فوق العجين في القالب.\n
7. ضع حشو المشروم فوق الجبن، ثم ادهن أطراف العجين بالبيض.\n
8. غطي المشروم بقطعة العجين الثانية، ثم اضغط على أطراف العجين بشوكة حتى تغلقي الفطيرة.\n
9. اصنع خمسة شقوق في العجين بسكين حتى يخرج البخار من الفطيرة في أثناء الخبز.\n
10. ادهن وجه الفطيرة بالبيض. ثم رش السمسم فوقها.\n
11. سخن الفرن على درجة حرارة 190 مئوية، ثم اخبز الفطيرة من 25 إلى 30 دقيقة حتى تكتسب اللون الذهبي، ثم كلها مع سلطة وصوص المستردة.
''';
  static const String mainDishe16 = '''
1. في قدر كبيرة على نار عالية، حمر اللحم في السمن حتى يكتسب اللون الذهبي.\n
2. أضيف الماء الساخن وورق اللورا والبصل والفلفل الأسود إلى القدر، ثم غطيها واتركها على نار هادئة مدة 60 دقيقة تقريبًا.\n
3. ضع نصف كمية مرق اللحم في قدر أخرى، واتركها جانبًا.\n
4. أضيف البامية والثوم إلى اللحم والمرق المتبقي، ثم غطي القدر، واتركها على نار متوسطة عشر دقائق.\n
5. أذيب معجون الطماطم في عصير الطماطم، ثم أضيف لهما كوبين من مرق اللحم وعصير الطماطم، ثم ضع الخليط على البامية.\n
6. أضيف بقية مرق اللحم المتبقي إلى قدر البامية وملعقتين كبيرتين ملحًا، ثم غطي القدر نصف تغطية، ودعها على نار متوسطة 15 إلى 20 دقيقة.\n
7. قطع خبز التنور مربعات كبيرة الحجم في طبق التقديم، ثم صب فوقها البامية، وقدمها ساخنة.
''';
  static const String mainDishe17 = '''
1. ضع الكزبرة والفلفل الحار والثوم في محضر الطعام، واهرس الخليط ناعمًا.\n
2. ضع خليط الكزبرة في وعاء كبير، ثم أضيف إليه عصير الليمون والملح والفلفل الأسود والكمون والكزبرة والكاري، وقلب جيدًا.\n
3. أضيف السمك، وقلب جيدًا حتى تمتزج المكونات، ثم اتركه جانبًا لمدة 30 دقيقة.\n
4. ضع الدقيق والنشا في وعاء، وقلب جيدًا.\n
5. اغمس شريحة الهامور في الدقيق، ثم ضعه فورًا في زيت غزير ومغلي حتى يُصبح لونه ذهبيًّا من جميع الجهات.\n
6. كرر الخطوة السابقة مع باقي شرائح السمك، ثم ارفعه على مناديل مطبخ، لتتخلص من الزيت الزائد.\n
7. ضع سمك الهامور المقلي في طبق التقديم، وكله ساخنًا مع أرز الصيادية.
''';
  static const String mainDishe18 = '''
1. ضع جميع المقادير في وعاء كبير، وقلبها جيدًا حتى تمتزج المكونات.\n
2. غطي الوعاء، واتركه في الثلاجة ساعتين أو طوال الليل.\n
3. احشي الفينو أو الخبز الشامي بخليط اللحم، ثم غلفه بورق زبدة، ثم ورق قصدير.\n
4. جهز شواية الفحم أو الحطب الخاصة بك، ثم ضع فوقها شبكًا معدنيًّا.\n
5. ضع السجق الشامي فوق الشبكة، واتركه لمدة ثماني دقائق، ثم اقلبه على الجهة الأخرى، واتركه لمدة ثماني دقائق أخرى، ثم قدمه ساخنًا.\n
. يمكنك أيضًا تشكيل اللحم على شكل أصابع أو أقراص، وشيه على شواية الفحم، ثم حشو الخبز باللحم.
''';
  static const String mainDishe19 = '''
1. في وعاء كبير، ضع اللحم والكبد والكلاوي والأرز والبصل المفروم والطماطم والبقدونس والكزبرة والشبت والنعناع ومعجون الطماطم والزيت والتوابل، ثم قلب المكونات.\n
2. احشي العصبان "الأمعاء" بالخلطة، واحرص على عدم ملئه زيادة عن اللزوم، حتى لا ينفجر في أثناء الطهي، ثم اربط طرفيه بالخيط لإغلاقه.\n
3. في قدر كبيرة على نار متوسطة، سخن الزيت، ثم ضع البصل وقلبه حتى يتحمر قليلًا، ثم أضيف معجون الطماطم وقلبه في الزيت.\n
4. أضيف الماء الساخن والكركم والملح والفلفل الأسود، ثم انتظر حتى يغلي الماء، ثم ضع العصبان المحشي.\n
5. غطي القدر، واتركها على النار حتى ينضج العصبان من 30 إلى 45 دقيقة، ثم صفيه من المرق وكله ساخنًا.
''';
  static const String mainDishe20 = '''
1. سخن الفرن عند 180 درجة مئوية.\n
2. ضع الباذنجان على النار مباشرة، واشويه من جميع الجهات من 15 إلى 20 دقيقة.\n
3. اترك الباذنجان يبرد تمامًا، ثم أزيل القشور المحترقة، ثم ضعه في مصفاة لتتخلصي من الماء الزائد الموجود به.\n
4. قطع الباذنجان إلى قطع صغيرة، ثم أضيف الثوم والملح والفلفل الأسود، وقلبه جيدًا، ثم ضعه في الثلاجة.\n
5. وزع قطع البصل والطماطم والفلفل الأخضر والملون في صينية فرن، ثم أضيف الملح والفلفل الأسود وملعقتين من زيت الزيتون، وقلب جيدًا.\n
6. ضع الصينية في الفرن من 30 إلى 35 دقيقة.\n
7. سخن ملعقتين من زيت الزيتون في قدر كبيرة على نار متوسطة، ثم أضيف البصل المفروم وقلبه ثلاث دقائق حتى يذبل.\n
8. أضيف اللحم وقلبه خمس دقائق، ثم أضيف صلصة الفلفل الحار وصلصة الطماطم، وقلب جيدًا.\n
9. أخفض النار، ثم أضيف الملح والفلفل الأسود وملعقتي الماء، وقلب جيدًا.\n
10. غطي القدر، واتركها على نار هادئة من 20 إلى 40 دقيقة حتى ينضج اللحم.\n
11. قبل التقديم، سخن ملعقة من زيت الزيتون في مقلاة كبيرة، ثم أضيف الباذنجان، وقلبه برفق حتى يسخن.\n
12. ضع الباذنجان في طبق التقديم، ثم أضيف الزبادي، وقلبه حتى تمتزج المكونات.\n
13. وزع اللحم فوق الباذنجان والزبادي، ثم وزع الخضار المشوي في الفرن، وزين الوجه بالبقدونس.\n
14. كل الطبق ساخنًا مع الخبز أو الأرز.
''';
  static const String mainDishe21 = '''
1. في قدر على نار متوسطة، سخني الزيت، ثم أضيفي اللحم، وقلّبي حتى يتحمر.\n
2. اغسلي المشمش المجفف والقراصيا والزبيب لإزالة الأتربة، ثم أضيفيها إلى اللحم، وقلبي لخمس دقائق.\n
3. أضيفي كوبين ماء أو مرق، وانتظري حتى تغلي، ثم أضيفي الحبهان والملح والسكر واللوز المقشر.\n
4. غطي القدر، واتركيها على نار هادئة 20 دقيقة حتى يتبخر الماء قليلًا، ثم قدميها ساخنة مع الأرز.
''';
  static const String mainDishe22 = '''
1. اسلق الفريك في كوبي ماء على نار متوسطة حتى ينضج من سبع إلى عشر دقائق، ثم صفيه جيدًا من الماء.\n
2. في وعاء، اخلط اللحم المفروم مع البصل والفريك المسلوق والثوم وتوابل الكفتة والفلفل الأسود والبابريكا والملح.\n
3. افرم خليط الكفتة في مفرمة اللحم أو محضر الطعام، حتى يصبح قوامها ناعمًا، ويتجانس الفريك مع اللحم المفروم.\n
 4. شكل الكفتة أصابع، ثم رصها في صينية، وضعها في فرن ساخن من 25 إلى 30 دقيقة، ثم كلها و أستمتع.
''';
  static const String mainDishe23 = '''
1. اسلق المكرونة في ماء مملح، واتركها حتى تنضج، ثم صفيها من الماء، واتركها جانبًا.\n
2. أضيف ½ كوب من الجبن الموتزاريلا والشيدر، وقلب باستمرار حتى يذوب الجبن.\n
3. سخن الفرن عند درجة حرارة 180 درجة مئوية.\n
4. في صينية بايركس، ضع 2 كوب من البشاميل في قاع الصينية، ثم أضيف نصف كمية المكرونة، ثم اللحم.\n
5. ضع نصف كوب من الموتزاريلا والشيدر فوق اللحم، ثم ضع باقي المكرونة، ثم باقي البشاميل.\n
6. ضع الصينية في الفرن لمدة 40 دقيقة، ثم أخرجها.\n
7. وزع الرومي وباقي الموتزاريلا والشيدر على الوجه، ثم ضعها في الفرن مرةً أخرى لمدة 5 دقائق حتى يذوب الجبن، ثم كلها وأستمتع بها ساخنة.
''';
  static const String mainDishe24 = '''
1. اسلق المكرونة في ماء مغلي ومملح، واتركها حتى تنضج، ثم صفيها من الماء، واتركها جانبًا.\n
2. ضع الزيت وعصير الليمون والفلفل الحار والكمون والبابريكا والملح والفلفل الأسود والثوم في وعاء، وقلب جيدًا حتى تمتزج المكونات.\n
3. ضع اللحم في وعاء، ثم أضيف إليه ثلث التتبيلة، وقلب جيدًا حتى تمتزج المكونات، ثم غطي الوعاء واتركه في الثلاجة لمدة ساعة.\n
4. ضع البصل والفلفل الملون في وعاء، ثم أضيف إليه الثلث الثاني من التتبيلة، وقلب جيدًا حتى تمتزج المكونات، ثم غطي الوعاء واتركه في الثلاجة لمدة ساعة.\n
5. سخن مقلاة كبيرة غير قابلة للالتصاق على نار متوسطة، ثم أضيف الخضار مع التتبيلة الخاصة به، وقلب لمدة خمس دقائق.\n
6. ارفع الخضار من المقلاة، ثم أضيف اللحم مع التتبيلة الخاصة به، وقلب باستمرار لمدة عشر دقائق.\n
7. أضيف الخضار والثلث الأخير من التتبيلة، وقلب جيدًا، ثم غطي المقلاة، واتركها على نار هادئة لمدة عشر دقائق حتى ينضج اللحم.\n
8. سخن الفرن عند درجة حرارة 180 درجة مئوية.\n
9. أضيف كوبًا من البشاميل إلى المكرونة، وقلب جيدًا حتى تمتزج المكونات.\n
10. ادهن صينية بايركس بقليل من الزيت أو الزبد، ثم وزع نصف كوب من البشاميل في قاع الصينية.\n
11. وزع نصف كمية المكرونة فوق البشاميل، ثم وزع فاهيتا اللحم، ثم باقي المكرونة.\n
12. وزع باقي البشاميل على الوجه، ثم ضع الصينية في الفرن لمدة 25 دقيقة، وكلها وأستمتع ساخنة.
''';
  static const String mainDishe25 = '''
1. سخن قدرًا على نار متوسطة، ثم ضع دهن الضأن، وقلب حتى يذوب الدهن قليلًا ويصفر لونه مدة 10 إلى 15 دقيقة تقريبًا.\n
2. أضيف اللحم، ثم قلبه مع الدهن.\n
3. اخفض حرارة النار، واستمر في تقليب اللحم مع الدهن كل ثلاث إلى خمس دقائق حتى لا يحترق اللحم مدة 40 دقيقة تقريبًا.\n
4. أضيف البصل والحبهان والقرفة والفلفل الأسود والملح وقرن الفلفل الحار، ثم قلب من خمس إلى عشر دقائق، ثم ارفع المحشوش من على النار .
''';
  static const String mainDishe26 = '''
1. في قدر كبيرة على نار عالية، ضع اللحم والماء، واتركها حتى يغلي الماء، ثم أزيل ريم زفر اللحم من على وجه المرق.\n
2. أضيف البصل والثوم والطماطم والكمون والفلفل الأسود وورق اللورا والقرفة والحبهان واللومي الأسود والملح، ثم غطي القدر، واتركها على نار متوسطة حتى ينضج اللحم 60 دقيقة تقريبًا.\n
3. في وعاء كبير، اخلط الدقيق مع رشة ملح، ثم أضيف الماء الدافئ تدريجيًا حتى يصبح لديك عجين متماسك وطري، ثم غطه حتى ينضج اللحم.\n
4. رش طاولة المطبخ بالدقيق، ثم افرد العجين وقطعه بقطاعة دائرية.\n
5. ضع قطع العجين في المرق، ثم غطي القدر واتركها 10 إلى 15 دقيقة على النار حتى تنضج الدغابيس، ثم اغرفها وأستمتع بها ساخنة.
''';
  static const String mainDishe27 = '''
1. في قدر على نار متوسطة، ضع ملعقة كبيرة من الزبد أو السمن، ثم حمر اللحم حتى يكتسب اللون الذهبي.\n
2. انتشل اللحم من القدر، وضعه جانبًا، ثم أضيف ملعقة الزبد المتبقية، ودقيق اللوز.\n
3. قلب دقيق اللوز في الزبد لعدة ثوانٍ حتى يشقر لونه قليلًا، ثم أضيف مرق اللحم.\n
4. اخفض حرارة النار، واستمر في التقليب حتى يصبح قوام الخليط سميكًا.\n
6. اعصر نصف كمية الرمان والزبيب في الخلاط، ثم صف العصير جيدًا.\n
7. أضيف عصير الرمان والزبيب إلى القدر، ثم أعيد اللحم.\n
8. أضيف الكزبرة والقرفة والثوم البودرة والملح والفلفل الأسود، ثم اترك الخليط يغلي حتى يصبح قوامه كثيفًا.\n
9. أضيف الزبيب وخل التفاح وماء الورد، واتركه دقيقتين على النار ثم ارفعه.\n
10. اغرف الجرجانية في طبق التقديم، ثم ضع بقية الرمان على الوجه، وكلها مع الأرز الأبيض.
''';
  static const String mainDishe28 = '''
1. ضع الدجاج والملح والفلفل الأسود والدقيق والنشا في وعاء كبير، وقلب جيدًا.\n
2. حمر الدجاج في زيت غزير ومغلي، حتى يُصبح ذهبي اللون.\n
3. ارفع الدجاج على مناديل مطبخ، حتى تتخلص من الزيت الزائد.\n
4. ذوّب النشا في الماء، واتركه جانبًا.\n
5. سخن الزيت في مقلاة كبيرة على نار متوسطة، ثم أضيف البصل وقلبه دقيقتين.\n
6. أضيف الثوم والزنجبيل والفلفل الحار، وقلب جيدًا.\n
7. أضيف المرق وخليط الماء والنشا وصوص الصويا وصوص الفلفل الحار، وقلب جيدًا حتى يغلي الخليط ويغلظ.\n
8. أضيف الدجاج وقلب جيدًا دقيقتين.\n
9. ضع الدجاج في طبق التقديم، وزينه بالبصل الأخضر، وكله مع الأرز أو النودلز.
''';
  static const String mainDishe29 = '''
1. في وعاء كبير، اخلط عصير ليمون مع الثوم المفروم والكمون ورقائق الفلفل الأحمر والكزبرة المطحونة والزعتر والبابريكا والملح والفلفل الأسود وملعقة كبيرة زيت زيتون.\n
2. أضيف شرائح لحم الضأن إلى التتبيلة، وقلبها فيها جيدًا.\n
3. غط اللحم، واتركه منقوعًا مدة 30 إلى 60 دقيقة في الثلاجة.\n
4. سخن مقلاة غير قابلة للالتصاق على نار متوسطة، ثم ضع ملعقة كبيرة زيت زيتون والبصل وشرائح الفلفل الرومي، ثم قلب حتى تذبل ويتكرمل البصل قليلًا مدة عشر دقائق، ثم أزلها من المقلاة.\n
5. في نفس المقلاة، ضع شرائح اللحم وقلبها حتى تكتسب اللون الذهبي وتنضج من 15 إلى 20 دقيقة.\n
6. أعيد الخضراوات إلى المقلاة وأضيف الكزبرة الخضراء، ثم قلب لثلاث دقائق، ثم ارفعها من على النار.\n
7. كل الفاهيتا وأستمتع ساخنة مع خبز التورتيلا وسلطة الجواكامولي.
''';
  static const String mainDishe30 = '''
1. اغسل السلق جيدًا تحت الماء الجاري، ثم أزيل السيقان عن الورق، واحتفظ بها جانبًا.\n
2. اغلي كمية من الماء، ثم ضع ورق السلق، واتركه في الماء مدة 30 ثانية، ثم انشله، وضعه فورًا في ماء بارد عدة ثوان، ثم صفيه جيدًا.\n
3. في وعاء كبير، اخلط الأرز مع اللحم والدهن المفروم والبصل والثوم ومعجون الطماطم والنعناع المجفف والكركم والكاري والسبع بهارات والفلفل الأسود والبابريكا والكمون والملح وملعقتين كبيرتين زيت ذرة، ثم قلب جيدًا.\n
4. احشي ورق السلق من الجهة الخشنة التي تبرز فيها عروق الورق.\n
5. رص سيقان ورق السلق ورأس الثوم المقطعة في قعر قدر كبيرة، ثم رص محشي السلق فوقها.\n
6. سخن نصف لتر ماء، ثم أضيف له ربع كوب عصير ليمون وملح حسب رغبتك، ثم اغمر السلق به.\n
7. صب ربع كوب زيت زيتون فوق السلق، ثم غطي القدر.\n
8. ضع قدر محشي السلق على نار متوسطة حتى يغلي الماء، ثم اخفض الحرارة، واتركه على  نار هادئة حتى ينضج من 40 إلى 50 دقيقة، ثم ضعه في طبق التقديم وكله وأستمتع بها ساخنًا.
''';

  ////////////////////// == Desserts == /////////////////////
  static const String dessert1 = '''
1- سخن الفرن عند 170 درجة مئوية. \n
2- في وعاء عميق، اخلط بسكويت الأوريو المطحون مع الزبد ووزع الخليط في صينية التشيز كيك واضغط جيدًا، ثم أدخل الصينية الفرن عشر دقائق وأخرجه. \n
3 - في وعاء، ضع الجبن والسكر والكاكاو واخفقه بالمضرب اليدوي أو الكهربائي، ثم أضيف البيض والفانيليا واستمر في الخفق حتى يمتزج الخليط . \n
4- أضيف الكريمة الحامضة واللبن الرائب ولون الطعام واخفق مرة أخرى جيدًا، حتى يمتزج الخليط تمامًا. \n
5- صب الخليط فوق طبقة البسكويت والزبد بعد أن تبرد تمامًا، وضع الصينية في حمام ماء ساخن وأدخليها الفرن ساعتين إلا ربع ثم أطفئ الفرن واتركه ساعة أخرى. \n
6- أخرج التشيز كيك من الفرن واتركه تهدأ ثم أدخله الثلاجة. \n
7- في وعاء، اخفق الكريمة السائلة جيدًا حتى يتضاعف حجمها، ثم أضيف السكر والجبن واخفق مرة أخرى سبع دقائق. \n
8- أخرج التشيز كيك من الثلاجة وأضيف طبقة الكريمة المخفوقة بالجبن، وأدخله الثلاجة مرة أخرى.
''';
  static const String dessert2 = '''1. سخن الفرن على درجة حرارة 180 مئوية. \n
2. لعمل الكيك، ضع التمر مع الشاي في قدر على نار متوسطة، حتى يبدأ الغليان، ثم اخفض حرارة النار، واتركه يغلي على نار هادئة خمس دقائق. \n
3. ضع التمر والشاي في محضر الطعام، وافرم حتى يصبح قوام الخليط ناعمًا. \n
4. اخفق البيض مع السكر والعسل بالمضرب الكهربائي، حتى يصبح قوامه هشًا ويفتح لونه ويتضاعف حجمه. \n
5. أضيف الزبد الذائب تدريجيًا في أثناء الخفق، ثم أضيف الفانيليا وخليط التمر والشاي. \n
6. في وعاء، انخل الدقيق والبيكنج صودا والملح، ثم أضيف الخليط إلى الخليط السابق، وقلب بحرص بملعقة خشبية حتى لا يخرج الهواء من الخليط. \n
7. صب الخليط في صينية كيك بحجم مناسب مدهونة بالزبد ومرشوشة بالدقيق. \n
8. اخبز الكيك في الفرن من 45 إلى 55 دقيقة، أو تخرج خلة أسنان نظيفة عند غرسها في منتصفها. \n
9. خلال خبز الكيك، حضر صوص التوفي، ضع السكر البني والعسل والزبد والفانيليا والملح في قدر على نار هادئة، ثم حركه حتى يذوب السكر ويبدأ الخليط الغليان. \n
10. أضيف الكريمة قبل تقليب الخليط، واتركi على النار دقيقتين حتى تغلي، ثم ارفع الصوص من على النار، وصبه في وعاء نظيف. \n
11. أخرج الكيك من الفرن، ثم خرمi بسيخ شي خشبي، ثم صب نصف كمية صوص التوفي فوقه. \n
12. غط الكيك بطبق، ثم اتركi تبرد تمامًا في درجة حرارة الغرفة، ثم أخرجi من القالب. \n
13. ضع الكيك في طبق التقديم، ثم صب بقية صوص التوفي على الوجه. \n
14. استمتع بكيك التمر بالتوفي مع قليل من المكسرات على الوجه أو مع آيس كريم الفانيليا.
''';
  static const String dessert3 = '''
1. في وعاء، اخفق الحليب مع الخل بالمضرب اليدوي، حتى يصبح قوام الحليب سميكًا قليلًا. \n
2. أضيف السكر والزيت، ثم اخفق حتى يذوب السكر. \n
3. أضيف الدقيق والكاكاو والبيكنج بودر والبيكنج صودا، ثم قلب حتى تتجانس المكونات. \n
4.أضيف الماء الدافئ، ثم قلب حتى تتجانس المكونات. \n
5.ادهن قالب كيك مقاس 20 سنتيمترًا بالزيت، ثم عفره بالدقيق. \n
6.صب خليط الكيك في القالب، ثم اخبزه في فرن مُسخن مُسبقًا على درجة حرارة 170 مئوية من 40 إلى 45 دقيقة، أو حتى تخرج خلة الأسنان نظيفة عند غرسها في منتصفها. \n
7. اترك الكيك يبرد، ثم زينه بالطريقة التي تفضلها، وقدمه.
''';
  static const String dessert4 = '''
1. سخن الفرن عند درجة حرارة 180 درجة مئوية مدة 30 دقيقة. \n
2. ضع الدقيق في وعاء كبير، ثم أضيف الماء تدريجيًّا، واخفق بالمضرب اليدوي، حتى تحصل على عجين سائل وسميك قليلًا. \n
3. صب العجين في صينية غير قابلة للالتصاق، وادهنه بقليل من السمن الذائب، ثم ضعه في الفرن مدة 15 – 20 دقيقة حتى ينضج، وتخرج السكين نظيفة عند غرسها في العريكة. \n
4. قطعي العريكة مربعات، ثم ضعه في وعاء كبير، ثم أضيف نصف كمية السمن، واعجن بيديك حتى تُصبح كعجين الخبز والمعجنات. \n
5. ضع العريكة في طبق التقديم، ثم اصنع حفرة في منتصفها بقاع كوب. \n
6. صب باقي السمن في الحفرة والوجه، ثم زين باقي الوجه بحبات التمر والعسل. \n
7. استمتع بالعريكة على وجبة الفطور مع الشاي الساخن والقهوة العربية.
''';
  static const String dessert5 = '''
1. سخن الفرن عند درجة حرارة 180 درجة مئوية. \n
2. ضع السميد والسكر وجوز الهند والبيكنج باودر والعسل في وعاء، وقلب جيدًا. \n
3. أضيف الزبادي والسمن وقلب، ثم أضيف عصير المانجو، وقلب حتى تمتزج المكونات. \n
4. ادهن صينية بالسمن، وضع فيها خليط البسبوسة، وأدخله الفرن حتى تنضج ويتحمر الوجه. \n
5. اخرج البسبوسة من الفرن، واسقه بالشربات على الفور، ثم زين الوجه بقطع المانجو بعد أن تهدأ.
''';
  static const String dessert6 = '''
1. ضع السكر والزيت والبيض في الخلاط، ثم اخفق حتى يذوب السكر ويتضاعف حجم الخليط. \n
2. اخلط الدقيق مع البيكنج بودر في وعاء، ثم أضيف خليط البيض والسكر، وقلب حتى يمتزج مع الدقيق. \n
3. أضيف الحليب والفانيليا وقلب حتى تمتزج المكونات. \n
4. ضع ست ورقات في قوالب الكب كيك، ثم صب خليط الكيك بها، ثم ضع الفواكه المسكرة أو رقائق الشوكولاتة على الوجه. \n
5. سخن قدرًا كبيرة تكفي لوضع قوالب الكب كيك على نار متوسطة خمس دقائق، ثم ضع قاعدة معدنية في القدر، ثم ضع فوقها قوالب الكب كيك. \n
6. غط القدر، واخبز الكب كيك على نار متوسطة إلى هادئة 25 إلى 35 دقيقة. \n
7. اترك الكب كيك تبرد، ثم زينه بالكريمة .
''';
  static const String dessert7 = '''
1. سخن الفرن عند درجة حرارة 180 درجة مئوية. \n
2. قطع التمر قطعًا صغيرة، ثم ضعه في وعاء كبير. \n
3. أضيف بيكربونات الصودا والماء المغلي، وقلب جيدًا، ثم اتركه جانبًا مدة عشر دقائق. \n
4. ضع الخليط في محضر الطعام، واهرسه ناعمًا. \n
5. ضع الزيت والسكر في وعاء كبير، واخفق بالمضرب الكهربائي مدة خمس دقائق. \n
6. أضيف البيضة تلو الأخرى، واخفق مدة ثلاث دقائق، ثم أضيف الفانيليا واخفق جيدًا. \n
7. أضيف الدقيق وجوز الهند والعسل وخليط التمر، واخفق جيدًا. \n
8. صب العجين في صينية مدهونة بقليل من الزبد، ثم ضع الصينية في الفرن مدة 35 – 40 دقيقة حتى ينضج الكيك. \n
9. ضع مقادير الصوص في مقلاة على نار متوسطة، وقلب باستمرار حتى يذوب السكر وتمتزج المكونات. \n
10. اترك الصوص يغلي مدة دقيقة، ثم ارفعه واتركه يبرد. \n
11. اقلب الكيك في طبق التقديم، وزين الوجه بجوز الهند المبشور وصوص التوفي.
''';
  static const String dessert8 = '''
1. سخن الفرن مسبقًا عند 180 درجة مئوية. \n
2. في وعاء الخلاط، ضع البيض والفانيليا والسكر واخلط جيدًا. \n
3. أضيف الزيت والزبادي، واستمر في الخلط حتى تمتزج المكونات. \n
4. في وعاء، اخلط الدقيق والملح والبيكنج باودر، ثم أضيف الخليط لمزيج البيض تدريجيًا مع الاستمرار في الخلط. \n
5. ادهن صينية الفرن بالزبد ثم ضع داخلها مزيج الكيكة، وأدخله إلى الفرن من 30 إلى 40 دقيقة حتى تنضج الكيكة. \n
6. أخرج الكيكة من الفرن واسقه بالحليب المكثف وهي ساخنة، ثم زين الوجه بالسميد المحمص وأستمتع بها باردة.
''';
  static const String dessert9 = '''
1. على نار متوسطة، اخفق الزبد والجبن والحليب معًا، حتى تتجانس المكونات وتذوب، ويصبح المزيج ناعمًا، ثم ارفعه عن النار، واتركه يبرد. \n
2. في وعاء، اخفق صفار البيض حتى يصبح ناعمًا، ثم صب مزيج الجبن تدريجيًا مع التحريك، حتى تتجانس المكونات.
3. انخل الدقيق والنشا، ثم ضع الخليط إلى خليط صفار البيض، وامزج جيدًا. \n
4. في وعاء آخر، اخفق بياض البيض بالخلاط اليدوي، حتى يتكون الفوم، وأضيف السكر تدريجيًا مع الاستمرار في الخفق. \n
5. أضيف نصف كمية بياض البيض المخفوق إلى مزيج الصفار وقلبي، ثم أضيف الكمية المتبقية وقلب مرة أخرى لتتجانس المكونات. \n
6. ادهن قالب كيك دائريًا مقاس (23 * 7.5) سم، وغلف قاعه وجوانبه بورق الزبدة. \n
7. صب الخليط في القالب، ورج للسماح لفقاعات الهواء بالخروج. \n
8. ضع القالب في صينية خبز أكبر حجمًا، مبطنة بمناشف ورقية، ثم املئ الصينية بالماء الساخن، بارتفاع 2 سم. \n
9. اخبز في فرن مُسخن مُسبقًا على درجة حرارة 160 مئوية، 25 دقيقة، ثم خفف الحرارة إلى 140 درجة مئوية، واتركه تنضج 55 دقيقة أخرى، حتى يرتفع الكيك إلى ضعف حجمها. \n
10. أخرج الكيك، واقلب بحذر على يدك، لأنه سيكون ساخنًا، كما يمكنكِ قلبه على طبق، لكن هذا سيجعله ينكمش أكثر. \n
11. أزيل الورق، ورش وجه الكيك بالسكر البودرة، قطعه وقدمه مع الفراولة.
''';
  static const String dessert10 = '''
1. اخلط البسكويت مع الزبد وملعقتين من السكر، وافرك المكونات معًا. \n
2. استخدم قالب كيك مدورًا، وبطّنه بورق الزبدة، ثم ضع طبقة البسكويت، وزعه واضغط عليها جيدًا. \n
3. غط القالب، وأدخله الفريزر، حتى تتماسك طبقة البسكويت. \n
4. حضر الطبقة الثانية، اخفق الجبن الكريمي بالخلاط اليدوي، ثم أضيف كمية السكر المتبقية وعصير الليمون، واخفق مرة أخرى جيدًا حتى تتجانس المكونات. \n
5. في وعاء آخر اخفق الكريمة، ثم أضيف نصف الكمية إلى خليط الجبن، وقلب جيدًا. \n
6. أضيف كمية الكريمة المتبقية، وقلب مرة أخرى، ثم ضع الخليط فوق طبقة البسكويت، ووزعه جيدًا. \n
7. أعيد قالب الكيك إلى الفريزر مرة أخرى، واتركه ساعة. \n
8. زين التشيز كيك بصوص الفراولة، أو حسب رغبتك. \n
9. أدخله الثلاجة مرة أخرى، حتى يتماسك الصوص، ثم قطعه وأستمتع بها باردة.
''';
  static const String dessert11 = '''
1. ضع البسكويت والسكر في وعاء كبير، وقلب جيدا. \n
2. أضيف الزبد، وقلب حتى تمتزج المكونات. \n
3. وزع الخليط في صينية التارت، واضغط عليها بيديك أو قعر كوب حتى يتساوى، ويُغطي قاع الصينية والأطراف.
4. ضع الصينية في الثلاجة مدة 30 دقيقة. \n
5. أذيب النشا في ربع كوب من الكريمة، واتركهما جانبًا. \n
6. ضع باقي الكريمة في قدر على نار متوسطة، وقلبها باستمرار حتى تسخن. \n
7. أضيف خليط النشا والشوكولاتة والقهوة، وقلب باستمرار حتى تمتزج المكونات وتذوب الشكولاتة، ويُصبح الخليط كثيفًا. \n
8. أخرج التارت من الثلاجة، ووزع الشوكولاتة فوقه، ثم زين الوجه بحبات الجوز أو البيكان. \n
9. ضع التارت في الثلاجة مدة لا تقل عن الساعتين قبل التقديم. \n
.10يمكنك استخدام الكاسترد أو الجبن الكريمي والفاكهة بدلًا من كريمة الشوكولاتة لحشو تارت البسكويت.
''';
  static const String dessert12 = '''
1. ضع الفراولة أو التوت المجمد في محضر الطعام، ثم افرم حتى تصبح قطعًا صغيرة. \n
2. أضيف الكريمة وسكر الستيفيا، ثم اخفق مرة أخرى، حتى يصبح الخليط ناعمًا. \n
3. ضع الآيس كريم في أطباق التقديم، وقدمه في الحال مع قطع الفاكهة. 
''';
  static const String dessert13 = '''
1. ضع البسكويت المطحون والزبد في وعاء عميق، واخلطهما جيدًا. \n
2. ضع مزيج البسكويت والزبد في صينية ، ثم افرده بالتساوي، وأدخل الصينية الثلاجة، حتى تتماسك طبقة البسكويت. \n
3. ضع الجيلي ونصف كوب من الماء الساخن في وعاء، وقلب حتى يذوب الجيلي تمامًا. \n
4. أضيف نصف كوب من الماء البارد وملعقة جيلاتين وقلب، ثم اترك الوعاء في درجة حرارة الغرفة. \n
5. ضع الجبن الكريمي وكريمة الخفق في وعاء الخلاط، واخفق جيدًا حتى تتجانس المكونات، ثم أضيف مزيج الجيلي بالتدريج مع الاستمرار في الخفق. \n
6. أضيف كوب المانجو، واستمر في الخفق، حتى تتجانس المكونات تمامًا. \n
7. ضع المزيج المخفوق على طبقة البسكويت، وأدخل الصينية الثلاجة مدة 120 دقيقة حتى تتماسك. \n
8. ضع ثلاثة أكواب من المانجو والسكر والجيلاتين في وعاء على نار متوسطة، وقلب حتى تتجانس المكونات ويذوب الجيلاتين. \n
9. صب الخليط بعد أن يهدأ على وجه الصينية، وأدخلها مرة أخرى الثلاجة مدة لا تقل عن 60 دقيقة حتى يتماسك التشيز كيك، ثم أستمتع بها  باردة.
''';
  static const String dessert14 = '''
1. ضع السميد والحليب البودرة في مقلاة غير قابلة للالتصاق على نار متوسطة، وقلب باستمرار حت يتحمصا ويكتسبا اللون الذهبي من خمس إلى ست دقائق. \n
2. اترك خليط الحليب والسميد يبرد تمامًا قبل استخدامه. \n
3. اخفق البيض مع السكر بالمضرب الكهربائي، حتى يذوب السكر ويتضاعف حجم الخليط ويفتح لونه. \n
4. أضيف الزبد الذائب والزيت، ثم اخفق حتى يمتزج مع الخليط، ثم أضيف الفانيليا والزبادي. \n
5. أضيف خليط السميد والحليب والدقيق والبيكنج بودر والملح، ثم اخفق على أقل سرعة حتى تمتزج المكونات. \n
6. صب خليط الكيك في قالب خبز مدهون بالزبد ومرشوش بالدقيق، ثم اخبزه في فرن مُسخن مُسبقًا على درجة حرارة 180 مئوية من 45 دقيقة إلى 50 دقيقة، أو حتى تخرج خلة أسنان نظيفة عند غرسها فيه. \n
7. اسق الكيك فور خروجه من الفرن بالحليب المكثف المُحلى، ثم اتركه يبرد تمامًا، ثم قطعه وأستمتع.
''';
  static const String dessert15 = '''
1. سخن الفرن على درجة حرارة 170 مئوية. \n
2. في وعاء، اهرس الموز جيدًا بالشوكة، ثم أضيف الشوفان والعسل وزيت جوز الهند، ثم قلب حتى تتجانس المكونات. \n
3. اترك الخليط يرتاح عشر دقائق، حتى يمتص الشوفان السوائل من المكونات الأخرى. \n
4. أضيف رقائق الشوكولاتة والملح إلى الخليط، ثم قلب. \n
5. ضع ملعقة كبيرة من الخليط في راحة يدك، ثم كورها، ثم اضغط عليها قليلًا لعمل قرص سميك. \n
6. ضع القرص في صينية مغطاة بورق الزبدة، ثم كرر الخطوة حتى تنتهي كمية الخليط كلها. \n
7. اخبز كوكيز الشوفان بالموز في الفرن 15 دقيقة، أو حتى تكتسب لونًا ذهبيًا فاتحًا. \n
8. أخرج الكوكيز من الفرن، واتركها تبرد تمامًا قبل تقديمها.
''';
  static const String dessert16 = '''
لتحضير القطر الخاص بطريقة عمل بسبوسة بالقشطة: \n

1. يوضع الماء في قدر صغير على نار متوسطة، بالإضافة إلى كوب وثلاثة أرباع كوب سكر وماء الزهر. \n
2. يحرك حتى يبدأ بالغليان لثلاث دقائق، ثم يرفع عن النار ويوضع جانبًا حتى يبرد. \n
أما لطريقة عمل بسبوسة بالقشطة، فإليك الخطوات: \n

1. يخلط في وعاء السميد، واللبن، ونصف كوب من سكر، والزيت، وجوز الهند، والبايكنغ باودر. \n
2. يوضع الخليط جانبًا لمدة نصف ساعة. \n
3. يحمي الفرن على حرارة 180 درجة مئوية. \n
4. يمد نصف كمية خليط السميد في صينية مدهونة بزبدة. \n
5. نضع طبقة من القشطة، ونمدها فوق الخليط. \n
6. نضع طبقة أخرى من خليط البسبوسة. \n
7. يقطع الخليط على شكل مربعات. \n
8. يمكن وضع اللوز فوق كل قطعة. \n
9. تخبز الصينية لعشرين دقيقة ثم يحمّص الوجه ليصبح ذهبيًا لدقيقتين أو ثلاث. \n
10. تخرج الصينية من الفرن ويضاف إليها القطر بحسب الرغبة.
''';
  static const String dessert17 = '''
1. حضر العجين، اخلط الخميرة والحليب معًا، حتى تذوب الخميرة. \n
2. في العجان الكهربائي، أضيف الدقيق والسكر والملح والبيض ومذاب الخميرة، واخلط ثلاث دقائق على سرعة منخفضة، حتى يتماسك العجين. \n
3. أضيف الزبد تدريجيًا، واستمر في الخلط، حتى يصبح العجين طريًا، غطيه وأدخله الثلاجة ست ساعات أو طوال الليل\n.
4. حضر الحشو، اخلط السكر والدقيق والملح معًا، وفي وعاء آخر اخفق صفار البيض جيدًا. \n
5. أضيف خليط صفار البيض إلى الخليط الجاف، واخفق ببطء، ثم ضع الحليب الساخن وليس المغلي إلى الخليط، واستمر في الخلط، وضع الخليط في قدر مناسبة. \n
6. ضع القدر على نار متوسطة، واستمر في التقليب ثلاث دقائق، حتى يغلي الخليط، واتركه تغلي مع الخفق عشر ثوانٍ فقط، ثم ارفع القدر عن النار. \n
7. صب الكريمة في منخل شبكي ناعم فوق وعاء صغير، وأضيف الفانيليا واخلط مرة أخرى، ثم غطيه واتركه في الثلاجة أربع ساعات حتى تبرد. \n
8. حضر الدونات، على سطح عمل مرشوش بالدقيق، افرد العجين، بسمك سنتيمتر واحد، وقطع العجين إلى دوائر، قطرها سبعة سنتيمترات. \n
9. رص في صينية فرن مغلفة بورق زبدة، وادهن الورق بالزيت، ثم غطي الصينية، واتركه ثلاث ساعات حتى يتضاعف حجمه. \n
10. اقلي الدونات في زيت غزير ساخن، حتى يكتسب لونًا ذهبيًا من الجانبين، وأخرجه على مناشف ورقية، اتركه تبرد قليلًا، ثم اغمسه في السكر، ثم أخرجه واتركه جانبًا حتى تبرد. \n
11. حضر كريمة الخفق واخفقه، ثم اخفق عجينة الحشو، ثم أضيف كريمة الخفق إلى الحشو وقلب، ثم ضعه في كيس حلواني. \n
12. اصنع ثقبًا في جانب كل قطعة، واملئه بالكريمة، وأستمتع.
''';
  static const String dessert18 = '''
1. في وعاء عميق، ضع نصف كمية الدقيق والخميرة والملح ثم قلب المكونات حتى تتجانس. \n
2. أضيف الحليب والسكر والزبد والفانيليا وقلب باستمرار، ثم أضيف باقي الدقيق بالتدريج، حتى تحصل على عجينة متماسكة القوام. \n
3. غط العجينة بقطعة قماش، ثم اتركه تتخمر في مكان دافئ قرابة ساعة. \n
4. رش بعض الدقيق على سطح مستوٍ، ثم افرد العجينة بسمك مناسب. \n
5. قطع العجينة بقطاعة الدونات. ثم اتركه 15 دقيقة ترتاح. \n
6. على نار متوسطة، اقلي الدونات في زيت غزير، ثم اتركه حتى تكتسب لونًا ذهبيًا من الجانبين. \n
7 . ارفع الدونات من على النار وضعه في طبق وزين الوجه بالصوص المفضل.
''';
  static const String dessert19 = '''
1. في وعاء، ضع الزبد والسكر واخفق بالمضرب الكهربي، حتى يُصبح القوام هشًا. \n
2. أضيف البيض واخفق، ثم أضيف الفانيليا والحليب واخفق جيدًا. \n
3. أضيف الدقيق والبيكنج باودر والقرفة، واخفق جيدًا. \n
4. ضع العجين في كيس الحلويات، ثم أنزله على شكل كور في زيت غزير وساخن، حتى يصبح لونها ذهبيًا. \n
5. اغمسه في سكر بودرة  أو في قرفة مع سكر عادي. \n
6. يمكنك حشوها بالكريم باتسيير أو بالمربى.
''';
  static const String dessert20 = '''
1. في وعاء، اخلط البسكويت المطحون مع الزبد الذائب والسكر البودرة. \n
2. ضع خليط البسكويت في قالب بايركس، ثم اضغط عليه بقعر كوب لمساواتها، ثم ضعه في الثلاجة حتى تتماسك. \n
3. اخفق الحليب البودرة مع السكر والحليب الرائب والزبادي والقشدة والزبد والقرفة والفانيليا بالمضرب الكهربائي أو الخلاط، حتى تتجانس المكونات. \n
4. صب الخليط فوق طبقة البسكويت، ثم ضعه في فرن مُسخن مُسبقًا على درجة حرارة 180 مئوية لمدة عشر دقائق، ثم ضعه أسفل الشواية حتى تتماسك. \n
5. اترك اللبنية تبرد تمامًا، ثم ضع صوص الكراميل على الوجه، ثم رش اللوز المحمص فوقه، ثم قطعه وأستمتع.
''';
  static const String dessert21 = '''
1. في وعاء عميق، ضع حليب اللوز والموز المهروس والفانيليا واخلط المكونات حتى تتجانس. \n
2. في وعاء آخر، ضع الشوفان والبيكنج باودر ورشة ملح واخلط المكونات جيدًا. \n
3. أضيف خليط الحليب إلى خليط الشوفان وقلب، حتى يتكون لديك مزيج لين القوام. \n
4. على نار متوسطة، سخن مقلاة غير لاصقة، وأضيف مقدارًا مناسبًا من مزيج البان كيك وافرده في المقلاة. \n
5. اترك المزيج دقيقتين حتى ينضج، ثم ضعه على الجانب الآخر واتركه حتى ينضج. \n
6. كرر الخطوات حتى انتهاء الكمية. \n
7. ضع البان كيك في طبق التقديم، وزين الوجه بشرائح الموز.
''';
  static const String dessert22 = '''
1. في وعاء كبير، اخلط السميد مع الدقيق، ثم أضيف السمن واعجن بيديك حتى يتشرب الخليط السمن، ويصبح قوامه مثل الرمل المبلل. \n
2.. غط الوعاء، وضعه في الثلاجة 60 دقيقة أو أكثر. \n
3. أخرج العجين من الثلاجة، ثم أضيف السكر والمحلب وماء الورد وشراب السكر"القطر"، ثم اعجن حتى يتشكل لديك عجين طري، ولكن لا تفرط في العجن حتى لا يجف المعمول خلال الخبز. \n
4. غط العجين، ثم ضعه في الثلاجة. \n
5. لعمل الحشو، اخلط معجون التمر مع السمن حتى يصبح لديك خليط ناعم، ثم أضيف عين الجمل أو الفستق والمحلب أو الحبهان المطحون. \n
6. شكل الحشو كرات صغيرة الحجم، ثم ضعه في الثلاجة حتى تتماسك. \n
7. قسم عجين المعمول كرات حجمها ضعف حجم كرات الحشو، ثم احشيها بكرات العجوة، وأعد تكويرها. \n
8. شكل الكرات في قوالب تشكيل المعمول، ثم رصه في صينية فرن. \n
9. اخبز المعمول في فرن مُسخن مُسبقًا على درجة حرارة 250 مئوية لمدة عشر دقائق أو حتى يكتسب اللون الذهبي. \n
10. اترك المعمول يبرد تمامًا، ثم رشه بالسكر البودرة، وأستمتع.
''';
  static const String dessert23 = '''
1. ضع العجوة والزبد والقرفة والقشدة وكوبًا من البسكويت السادة في وعاء كبير، واعجن جيدًا حتى تمتزج المكونات. \n
2. شكل العجوة إلى كرات صغيرة، ثم اغمس الثلث في باقي البسكويت السادة، والثلث الثاني في بسكويت الكاكاو، والثلث الثالث في الأوريو. \n
3. ضع التمرية بالبسكويت في طبق التقديم، وأستمتع بها مع الشاي والقهوة.
''';
  static const String dessert24 = '''
1. ضع الحليب في مقلاة كبيرة غير قابلة للالتصاق على نار متوسطة، وقلب باستمرار حتى يُصبح ذهبي اللون. \n
2. ضع الحليب المحموس في وعاء كبير، واتركه جانبًا، ثم أضيف السميد في المقلاة نفسها، وقلبه باستمرار مدة ثلاث دقائق حتى يُصبح ذهبي اللون. \n
3. أضيف السميد إلى الحليب، وقلب جيدًا حتى تختلط المكونات. \n
4. أضيف الكاكاو وقلب، ثم ضع الحليب المكثف والقشطة، وقلب جيدًا حتى يُصبح القوام كالعجين. \n
5.  وزع السميد في صينية مغطاة بورق زبدة، ثم ضعه في الفرن مدة لا تقل عن ساعتين. \n
6. أخرج السميد، ووزع النوتيلا على الوجه، ثم ضعه في الثلاجة ساعة قبل الأكل.
''';
  static const String dessert25 = '''
1. في وعاء، اخلط الدقيق مع الملح والسكر والفانيليا، ثم أضيف الزيت والسمن، واعجن بيديك حتى يتشرب الدقيق المواد الدهنية ويصبح قوامه مثل الرمل المبلل. \n
2. في وعاء صغير، أذيب الخميرة في الماء، ثم أضيفيه إلى خليط الدقيق، وقلب حتى يصبح لديك عجين متماسك. \n
3. غطي العجين، واتركه يرتاح خمس دقائق فقط، ثم قسمه كرات صغيرة متساوية الحجم. \n
4. ضع زيتًا غزيرًا في مقلاة عميقة على نار متوسطة، ثم خذ قطعة عجين واضغطه على الجهة الخشنة للمبشرة أو مصفاة سلك، ثم لفه حتى تأخذ شكل المربعات. \n
5. ضع قطع أصابع زينب بعد تشكيلها مباشرة في الزيت الساخن حتى لا تختمر زيادة، وتنتفخ خلال القلي. \n
6. قلب أصابع زينب في الزيت من حين لآخر حتى تكتسب اللون الذهبي وتصبح مقرمشة، ثم صفيها جيدًا. \n
7. ضع أصابع زينب مباشرة في شراب السكر "الشربات" البارد مباشرة بمجرد إخراجها من الزيت. \n
8. اترك أصابع زينب في الشربات حتى تبرد، ثم صفيها وأستمتع.
''';
  static const String dessert26 = '''
1. اخلط الزيت والسكر معًا، ثم أضيف معجون التمر والماء وقلب مرة أخرى. \n
2. أضيف الحليب البودرة، واخفق المكونات معًا بالخلاط اليدوي، أو في الخلاط الكهربائي. \n
3. أضيف السميد والبيكنج بودر والفانيليا إلى الخليط، وامزج المكونات معًا جيدًا. \n
4. في صينية فرن غير لاصقة، ضع خليط البسبوسة. \n
5. اخبز في فرن مُسخن مُسبقًا على درجة حرارة 180 مئوية، 20 إلى 30 دقيقة، حتى تكتسب لونًا ذهبيًا. \n
6. أضيف إلي البسبوسة الحليب المكثف بعد خروجها من الفرن مباشرة، ووزع جيدًا، ثم زين بقليل من القرفة المطحونة. \n
7. اتركه تبرد، وأستمتع. 
''';
  static const String dessert27 = '''
1. في وعاء عميق، ضع الدقيق والبيض والحليب السائل ورشة ملح واخلطي بالمضرب اليدوي جيدًا، ثم صفي الخليط. \n
2. على نار هادئة، سخن مقلاة غير لاصقة، واسكب مقدارًا من خليط الكريب حتى يغطي المقلاة. \n
3. اترك مزيج الكريب دقيقتين، ثم اقلب الكريب على الوجه الآخر واتركه دقيقتين. \n
4. كرر هذه الخطوات حتى تنتهي من مزيج الكريب. \n
5. على نار متوسطة، ضع السكر والكاكاو والدقيق والفانيليا ورشة ملح ونصف كمية الحليب، وقلب جيدًا حتى تتجانس المكونات. \n
6. اترك المزيج حتى يغلي على النار، ثم أضيف باقي الحليب وقلب باستمرار، حتى يغلظ قوام المزيج ثم ارفعه عن النار. \n
7. شكل الكريب نصف دائرة ثم ضع في المنتصف بعض قطع البراونيز وصوص شوكولاتة، ثم أغلق طرفي الكريب. \n
8. كرر الخطوات حتى تنتهي من كمية الكريب، وضع باقي صوص الشوكولاتة فوق الكريب وأستمتع.
''';
  static const String dessert28 = '''
1. سخن الفرن عند درجة حرارة 180 درجة مئوية. \n
2. ضع مكونات طبقة البسكويت في وعاء، وقلب جيدًا. \n
3. ادهن صينية مستطيلة مقاس (33 × 22 سم) بقليل من الزيت، ثم وزع طبقة البسكويت، واضغط عليها بيديك حتى تتساوى، ثم ضعه في الفرن مدة سبع دقائق، ثم أخرجه واتركه تبرد. \n
4. ضع الدقيق والملح وبيكربونات الصودا في وعاء، وقلب جيدًا. \n
5. ضع الزبد والسكر بنوعيه في وعاء كبير، واخفق حتى تمتزج المكونات. \n
6. أضف البيض والفانيليا، واخفق جيدًا. \n
7. أضف خليط الدقيق وقلب جيدًا، ثم أضف رقائق الشوكولاتة وكوبين من المارشميللو، وقلب جيدًا. \n
8. وزع الخليط فوق طبقة البسكويت، ثم ضعه في الفرن مدة 18 دقيقة. \n
9. أخرج الصينية، ثم وزع مربعات الشوكولاتة وباقي المارشميللو على الوجه. \n
10. ضع الصينية في الفرن مرةً أخرى مدة 9 – 11 دقيقة، حتى يُصبح الوجه ذهبي اللون. \n
11. أخرج الحلوى من الفرن، واتركها تبرد قبل تقطيعها وتقديمها.
''';
  static const String dessert29 = '''
1. ضع الحليب في قدر كبيرة، ثم أضيف الدقيق والنشا، وقلب جيدًا بمضرب يدوي، حتى يذوب الدقيق والنشا. \n
2. ضع القدر على نار متوسطة، ثم أضيف الكريمة والسكر والنسكافيه والكاكاو الخام. \n
3. استمر في تقليب الخليط حتى يصبح كثيفًا وكريمي القوام. \n
4. أضيف الزبد وقلبي حتى يذوب مع الخليط. \n
5. ارفع المهلبية من على النار، وصبه في أكواب التقديم، وزينه بقليل من الكاكاو أو النسكافيه. \n
6. ضع مهلبية النسكافيه في الثلاجة حتى تبرد وتتماسك، و أستمتع.
''';
  static const String dessert30 = '''
1. سخن الفرن عند 180 درجة مئوية. \n
2. في وعاء عميق، ضع الجبن الكريمي، واخفق بالمضرب الكهربائي جيدًا. \n
3. أضيف البيض والسكر والفانيليا، واخفق المكونات جيدًا. \n
4. أضيف الكريمة والنشا والكاكاو، واخفق مرة أخرى جيدًا. \n
5. أضيف رقائق الشوكولاتة وثلاثة أرباع كوب التوت الأحمر وقلب برفق، ثم صب الخليط في صينية التشيز كيك. \n
6. ضع الصينية في صينية أخرى أكبر منها، ثم املئ نصف الصينية السفلية بالماء. \n
7. ضع التشيز كيك في الفرن 60 دقيقة، ثم أطفئ الفرن، واترك صينية التشيز كيك داخله ساعة. \n
8. ضع التشيز الكيك في الثلاجة ما لا يقل عن ست ساعات أو طوال الليل. \n
9. أخرج التشيز كيك من الثلاجة وزينه بالشوكولاتة المبشورة وباقي التوت الأحمر، وأستمتع به باردًا.
''';

  //////////////////// == Sos == ///////////////////
  static const String sos1 = '''
1. قشر الأفوكادو، وانزع النوى، ثم قطعها إلى مكعبات متوسطة.\n
2. ضع الأفوكادو والكزبرة والزيت والثوم والكمون والملح والفلفل الأسود والفلفل الحار في محضر الطعام، واهرس الخليط حتى يُصبح ناعمًا.\n
3. أضيف الماء بالتدريج، واخلط حتى تصل إلى القوام الذي ترغب فيه.\n
4. ضع الصوص في طبق التقديم، وقدمه مع طبق الفاهيتا.
''';
  static const String sos2 = '''
1. أذيب الزبد على نار متوسطة، ثم أضيف الدقيق وقلب حتى يُصبح قوامهما كريميًّا.\n
2. أضيف الحليب والملح والفلفل الأسود، وقلب باستمرار حتى تتجانس المكونات ولا تتكتل.\n
3. أضيف الجبن الشيدر واستمر في التقليب، ثم اترك المزيج على نار هادئة عشر دقائق حتى يغلظ قوام الصوص.\n
4. ارفع الصوص عن النار، وضعه في طبق التقديم، وقدمه مع ساندوتشات الشاورما أو ضعه عليها مباشرة.
''';
  static const String sos3 = '''
1. ضع نصف كمية الزبادي في محضر الطعام، ثم أضيف الكزبرة والملح والثوم وعصير الليمون، واخلط جيدًا حتى يُصبح القوام ناعمًا.\n
2. ضع الخليط في وعاء، ثم أضيف باقي الزبادي، وقلب جيدًا حتى تمتزج المكونات.\n
3. ضع الصوص في طبق التقديم، وكلها باردًا مع ساندويشات الفاهيتا.
''';
  static const String sos4 = '''
1. في وعاء الخلاط الكهربائي، ضع الكزبرة والنعناع والفلفل الأخضر وعصير الليمون والملح والماء واخلط المكونات حتى تتجانس.\n
2. في وعاء عميق، ضع الزبادي ثم أضيف إليه مزيج النعناع والكزبرة وقلب جيدًا حتى يتجانس.\n
3. قدم الصوص إلي جانب السمبوسة الهندية.
''';
  static const String sos5 = '''
1. لعمل صوص التشيلي التركي، اقسم قرون التشيلي من المنتصف، ثم أزيل البذور، ثم قطعها.\n
2. اغلي كمية من الماء، ثم انقع قرون الفلفل بها 30 دقيقة.\n
3. صف قرون الفلفل من الماء، ثم ضعها في الخلاط مع الكمون والكراوية والملح وعصير الليمون وزيت الزيتون والثوم ومعجون الطماطم، واخفق حتى يصبح قوام الخليط ناعمًا، ثم ضعه في برطمان نظيف واحتفظ به في الثلاجة لحين التقديم.\n
4 . لعمل صوص الزبادي التركي، ضعي الزبادي أو الكريمة الحامضة وعصير الليمون والطحينة والثوم والشبت والنعناع المجفف والملح في محضر الطعام، ثم اخفق لمدة دقيقة أو حتى يصبح الخليط خفيفًا وهشًا، ثم ضعه في وعاء واحفظه في الثلاجة لحين التقديم.
''';
  static const String sos6 = '''
1. ضع الطحينة والماء في وعاء، ثم قلب حتى يصبح القوام كريميًا وخفيفًا.\n
2. أضيف عصير الليمون وزيت الزيتون والثوم المفروم والتوابل، ثم قلب حتى تمتزج المكونات.\n
3. أضيف المزيد من الماء إذا شعرت أن قوام الطحينة ثقيلًا، أضيف ملعقة واحدة كبيرة مع التقليب في كل مرة حتى تصل للقوام المطلوب.\n
4. قدم الطحينة مع أطباق المشويات، أو استخدمها في تتبيل السلطات.
''';
  static const String sos7 = '''
1. ضع الزيت وعصير الليمون والثوم وبشر الليمون والحبق في محضر الطعام، واهرس المكونات ناعمًا.\n
2. ضع المايونيز في وعاء، ثم أضيف إليه خليط الحبق، وقلب جيدًا حتى تمتزج المكونات.\n
3. ضع الصلصة في طبق التقديم، وقدمها بجانب الأطباق الرئيسية والمشويات.
''';
  static const String sos8 = '''
1. ضع الفلفل الحار والثوم والخل في قدر صغيرة على نار عالية.\n
2. انتظر حتى يغلي الخليط، ثم أخفض حرارة النار، واتركه على نار هادئة حتى يصبح الثوم طريًا مدة 15 دقيقة تقريبًا.\n
3. اترك الخليط يهدأ مدة خمس دقائق، ثم افرمه في محضر الطعام.\n
4. صف الخليط للتخلص من البذور والقشور، ثم أعيده إلى القدر.\n
5. ضع القدر على نار متوسطة، ثم أضيف السكر والملح، وقلب حتى يذوب السكر، ثم ارفعها من على النار.\n
6. صب السيراتشا صوص في برطمان زجاجي محكم الغلق، واحتفظ به في الثلاجة لحين الاستخدام.
''';
  static const String sos9 = '''
1. أذيب الزبد في قدر صغيرة على نار متوسطة، ثم أضيف الدقيق، وقلب دقيقة.\n
2. أضيف الحليب إلى خليط الزبد والدقيق مع التقليب المستمر.\n
3. اترك الخليط يغلي على نار هادئة مع التقليب، حتى يصبح قوامه مثل صلصة الباشاميل الخفيفة.\n
4. ارفع القدر من على النار، ثم أضيف الجبن الشيدر، وقلب حتى تذوب تمامًا.\n
5. تبل الصوص بالملح والفلفل الحار.\n
6 . إذا شعرت أن الصوص ثقيل، أضيف قليلًا من الحليب الساخن، وقلبه مع الصوص حتى تصل إلى القوام المطلوب، ثم قدمه.
''';
  static const String sos10 = '''
1. أذيب النشا في ربع كوب من الماء، واتركه جانبًا.\n
2. ضع باقي الماء في مقلاة كبيرة على نار متوسطة، ثم أضيف السكر البني والصويا صوص والعسل والثوم والزنجبيل، وقلب جيدًا حتى تمتزج المكونات.\n
3. أضيف خليط النشا، وقلب باستمرار حتى يغلي الخليط ويغلظ.
''';
  static const String sos11 = '''
1. ضع جميع المكونات في برطمان زجاجي.\n
2. أحكم إغلاق البرطمان، ثم رجه جيدًا حتى يذوب السكر.\n
3. ضع الصوص في طبق التقديم، وقدمه مع السمك المشوي.
''';
  static const String sos12 = '''
1. ضع فصوص الثوم والملح في مُحضر الطعام، واخفق حتى تصبح ناعمة. (اكشط الجوانب مرتين أو ثلاثًا لضمان هرس الثوم جيدًا).\n
 2. أضيف الزيت ببطء من خلال الغطاء واستمر في الخفق، أضيف نصف كوب زيت ثم ملعقة صغيرة عصير ليمون.\n
3. استمر في التناوب بين نصف كوب زيت وملعقة صغيرة عصير ليمون، إلى أن تنتهي من كمية الزيت وعصير الليمون. (التناوب بين الاثنين يكوّن صلصة الثوم الخفيفة والرقيقة).\n
4. نصيحة واحدة لك، اترك الجهاز يعمل بين إضافات الزيت؛ لِلسماح للمستحلب بالتكثيف.\n
5. افعل هذا لمدة 10-15 دقيقة، حتى تُصبح الصلصة بيضاء وسميكة كَقوام المايونيز.\n
6. قدمها مع اللحم المشوي أو شيش كباب أو الخبز الدافئ.
''';
  static const String sos13 = '''
الوصفة الأولى\n
1. على نار متوسطة، ضع الكريمة، واتركها حتى تسخن، دون أن تصل إلى الغليان.\n
2. صب الكريمة فوق الشوكولاتة، وقلب باستمرار حتى تذوب الشوكولاتة.\n
3. أضيف الفانيليا، وقلب جيدًا.\n
الوصفة الثانية\n
1. في الخلاط الكهربائي، ضع الحليب والسكر والحليب البودرة، واخلط جيدًا.\n
2. افتح غطاء الخلاط من الأعلى، ثم أضيف الزيت بصورة خيط رفيع، واستمر في الخلط حتى يغلظ الصوص.\n
3. صب صوص الشوكولاتة البيضاء في علبة محكمة الغلق، واحتفظ بها في الثلاجة.
''';
  static const String sos14 = '''
1. في وعاء، اخلط جميع المكونات جيدًا، ثم ضع الصوص في الثلاجة مدة 60 دقيقة على الأقل قبل التقديم حتى تمتزج النكهات.\n
2. قدم الصوص بجانب طبق الجمبري (الروبيان) المقلي أو المشوي.
''';
  static const String sos15 = '''
1. ضع الحليب والسكر في قدر على نار متوسطة، وقلب حتى يذوب السكر، واتركه حتى يغلي الحليب مع التقليب من حين لآخر.\n
2. اخفض الحرارة، واترك الحليب يغلي على نار هادئة مع التقليب من حين لآخر، حتى تقل كمية الحليب إلى النصف، لمدة 30 دقيقة تقريبًا.\n
3. ارفع الحليب من على النار، ثم أضيف الزبدة والفانيليا، واتركه حتى يبرد تمامًا.\n
4. ضع الحليب المكثف في برطمان زجاجي محكم الغلق، واحتفظ به في الثلاجة، واستخدمه خلال أسبوع.
''';
  static const String sos16 = '''
1. أضيف الكاكاو والدقيق والسكر في وعاء وقلبها جيدًا.\n
2. على النار ضع الحليب والزبد والفانيليا وقلب حتى ذوبان الزبد.\n
3. أضيف الخليط الجاف إلى خليط الحليب والزبد على النار واستمر في التقليب.\n
4. اترك المزيج على نار متوسطة لمدة ست دقائق مع الاستمرار في التقليب.\n
5. أطفئ النار وضع القليل من الملح، ثم اترك الصوص يبرد واستخدمه لتزيين الكيك.
''';
  static const String sos17 = '''
1. على نار متوسطة، أضيف السكر في وعاء كبير.\n
2. قلب عندما يظهر في جوانب الإناء لون مختلف (ذوبان السكر).\n
3. خفف النار عندما يتغير لون السكر، لِمنع المرارة، واستمر في التقليب لإتمام الذوبان.\n
4. أضيف الزبدة عندما يذوب السكر بالكامل، واستمر في التقليب.\n
5. أضيف الحليب، واستمر في التقليب؛ لِمنع التكتل.\n
6. أضيف مزيج النشا مع الحليب إلى الخليط عندما تذوب جميع المكونات.\n
7. أضيف رشة الملح، واتركه يغلي حتى تَحصل على القوام المناسب.\n
8. احفظها في برطمان مُحكم الغلق، واتركها تبرد تمامًا قبل الاستخدام.
''';
  static const String sos18 = '''
1. امزج جميع المكونات في وعاء، واتركه جانبًا مدة 30 دقيقة قبل الاستخدام.\n
2. يمكنك استخدام الحليب لضبط القوام المُفضل لديك.
''';
  static const String sos19 = '''
1. في وعاء كبير، ضع الكاكاو والسكر والدقيق والملح، وقلب جيدًا.\n
2. على نار متوسطة، ضع الحليب والزبدة، واتركه حتى يغلي.\n
3. أضيف خليط الكاكاو فورًا عند غليان الحليب، وقلب باستمرار حتى تمتزج المكونات.\n
4. أضيف رقائق الشوكولاتة والفانيليا، وقلب باستمرار حتى يغلي الخليط، ويغلظ قليلًا.\n
5. قدم الصوص مع الآيس كريم والكيك.
''';
  static const String sos20 = '''
1. في وعاء ضع جميع المقادير واخلطهم جيدًا.\n
2. ضعها في الثلاجة لمدة لا تقل عن الساعتين قبل التقديم.
''';
  static const String sos21 = '''
1. سخنّ الزيت على نار متوسطة، ثم أضيف الثوم حتى يُصبح لونه ذهبيّا.\n
2. أضيف البصل وقلبه لمدة 5 دقائق ثم أضيف الطماطم وصلصة الطماطم.\n
3. أضيف الملح والفلفل الأسود والفلفل الحار.\n
4. اتركه على نار هادئة لمدة 20 دقيقة مع التقليب من فترة إلى أخرى.\n
5. أضيف الخل واتركه يغلي لمدة 5 دقائق.
''';
  static const String sos22 = '''
1. في وعاء كبير، ضع المايونيز والخل والبابريكا والملح والفلفل الأسود والكاتشب وقلب جيدًا حتى تختلط المكونات.\n
2. أضيف الخيار والفلفل الأخضر وقلب.\n
3. ضع في الثلاجة مدة لا تقل عن 6 ساعات قبل التقديم.
''';
  static const String sos23 = '''
1- في وعاء كبير، ضع كريمة الخفق والقهوة، وقلب حتى تذوب القهوة.\n
2- في وعاء آخر، ضع الجبن واخفق بالمضرب الكهربائي لمدة دقيقتين.\n
3- أضيف السكر والفانيليا، واخفق لمدة 3 دقائق، ثم أضيف خليط الكريمة والإسبريسو، واخفق بالمضرب الكهربائي حتى يُصبح الخليط كريميًّا.\n
4- ضع الصوص في أطباق التقديم، وزينها بالكاكاو، ثم قدمها مع الفاكهة وبسكويت الليدي فينجرز.
''';
  static const String sos24 = '''
1- اخلط جميع المكونات جيدًا.\n
2- قدمها في أطباق صغيرة بجانب طبق الرامن بالدجاج أو باللحم أو بالجمبري.
''';
  static const String sos25 = '''
١- في وعاء صغير، اخلط الكاتشب والمايونيز وصوص الفلفل الأحمر والخل، ثم قدم الصوص مع كرسبي الدجاج والسمك.''';
  static const String sos26 = '''
1- في وعاء، اخلط جميع المكونات جيدًا، ثم ضع الصوص في الثلاجة مدة 60 دقيقة على الأقل قبل التقديم حتى تمتزج النكهات.\n
2- قدم الصوص بجانب طبق الجمبري (الروبيان) المقلي أو المشوي.
''';
  static const String sos27 = '''
1- أذيب النشا في الماء، ثم ضعها على نار متوسطة، وقلبها حتى تغلي وتغلظ قليلًا.\n
2- أضف السكر والكريمة، وقلب جيدًا حتى يغلي الخليط.\n
3- ارفع الصوص عن النار، ثم أضف الزبد والفانيليا والملح، وقلب جيدًا حتى يذوب الزبد.\n
4- اترك الصوص يبرد قليلًا، ثم زين به الكيكات المختلفة.
''';
  static const String sos28 = '''
معجون الوسابي الحار:\n
1- ضع البودرة والماء في وعاء صغير، وقلب جيدًا حتى تتكون عجينة طرية.\n
2- غط الوعاء لمدة دقيقة، ثم شكل العجين إلى كرات صغيرة، وقدمها مع السوشي.\n
صوص الأفوكادو الأخضر:\n
1- أذيب بودرة الوسابي في عصير الليمون، ثم أضف باقي المقادير، وقلب جيدًا حتى تمتزج المكونات.\n
2- قدم صوص الأفوكادو الأخضر مع السوشي.
''';
  static const String sos29 = '''
1- ضع جميع المقادير في وعاء متوسط، وقلب جيدًا حتى تمتزج المكونات.\n
2- ضع الصوص في الثلاجة لمدة ساعة قبل تقديمه مع طبق السوشي الشهي.
''';
  static const String sos30 = '''
1- في وعاء كبير، ضع السكر، ثم أضف الحليب الملعقة تلو الأخرى مع التقليب المستمر حتى يذوب السكر تمامًا، ويُصبح القوام ثقيلًا.\n
2- قدمه مع الدونات والكب كيك.
''';

  //////////////// == Side Dishes == ////////////////
  static const String sideDishe1 = '''
1- سخن الفرن عند 180 درجة مئوية.\n
2- على نار متوسطة، اسلق الإندومي في ماء مغلي خمس دقائق.\n
3- ارفع الإندومي من على النار وصفيه جيدًا من الماء.\n
4- في قالب فرن مناسب مدهون بالزيت، ضع الإندومي وأضف ملحًا وبعض توابل الإندومي بحسب الرغبة، وقلب جيدًا.\n
5- أضف الجبن الشيدر والجين الموازريلا وقلب مرة أخرى، ثم أدخل القالب الفرن ست دقائق حتى يذوب الجبن.\n
6- أخرج الإندومي من الفرن و رش بعض الجبن الشيدر المبشور على الوجه، وقدمها ساخنة.
''';
  static const String sideDishe2 = '''
1- في وعاء كبير، اخلط جميع مكونات كرات اللحم معًا جيدًا.\n
2- بلل يديك بالماء، وشكل كرات اللحم بحجم حبة الجوز، ثم غطيها بورق النايلون، وأدخلها الفريزر حتى تتماسك.\n
3- ضع قليل من الزيت في مقلاة غير لاصقة، واقل كرات اللحم، إلى أن تتحمر من جميع الجهات.\n
4- في المقلاة نفسها، اقل بصل المرق إلى أن يذبل، ثم اقلي البطاطس قليلًا.\n
5- أضف البابريكا والكاري والفلفل الأسود وقلب، ثم غطي المقلاة، واترك البطاطس دقيقتين على نار هادئة.\n
6- أضف الملح ومعجون الطماطم وقلب، واترك البطاطس مرة أخرى، حتى تتجانس المكونات معًا.\n
7- ضع كمية مناسبة من الماء الساخن، واترك المرق يغلي جيدًا، ثم غطي المقلاة، واترك البطاطس تنضج، على نار متوسطة.\n
8- أضف كرات اللحم، وحركي المقلاة، حتى تتداخل كرات اللحم في المرق، وتجنبي تقليبها حتى لا تتكسر.\n
9- غطي المقلاة، واترك اللحم ينضج 15 دقيقة تقريبًا، مع تحريك المقلاة من حين لآخر.\n
10 - ضع في طبق التقديم، وزين بالبقدونس، وقدم رأس العصفور مع الأرز الأبيض.
''';
  static const String sideDishe3 = '''
1- في مقلاة كبيرة على نار متوسطة، ضع زيت الزيتون والبصل، وقلب حتى يذبل البصل.\n
2- أضف شرائح الدجاج والسماق والملح والفلفل الأسود إلى البصل، وقلب الخليط خمس إلى سبع دقائق، ثم أضف الصنوبر، وقلب لدقيقتين، ثم ارفع المُسخن من على النار.\n
3- احشي عجين السمبوسك بالمُسخن، ولفها رولات أو مثلثات حسب رغبتك.\n
4- ادهن السمبوسك بالزيت، ثم رصها في صينية، وحمرها في الفرن، حتى تكتسب اللون الذهبي، أو اقليها في زيت غزير ساخن، ثم قدمها.
''';
  static const String sideDishe4 = '''
1- في قدر كبيرة على نار متوسطة، ضع الزيت والبصل، وقلبه حتى يذبل البصل.\n
2- أضف الدجاج، ثم قلبه حتى يتغير لونه، ثم أضف الكمون والملح والبهارات المشكلة.\n
3- أضف كوبين ونصف ماء ساخن، ثم غطي القدر، وانتظر حتى ينضج الدجاج من 10 إلى 15 دقيقة.\n
4- انتشل الدجاج من المرق، ثم ضع الشوفان وكوبين ونصف ماء ساخن، ثم غطي القدر من 10 إلى 15 دقيقة حتى ينضج الشوفان، مع التقليب من حين لآخر.\n
5- أضف الحليب الرائب، ثم غطي القدر واتركها على نار هادئة 15 دقيقة.\n
6- في مقلاة على نار متوسطة، ضع البصل والزيت لعمل التقلية "الكُشنة"، وقلب حتى يذبل البصل.\n
7 - أضف معجون الطماطم والليمون الأسود والبهارات المشكلة والملح، ثم قلب حتى تتسبك لمدة خمس دقائق تقريبًا.\n
8- اغرف الجريش في طبق التقديم، ثم زينيه بالكُشنة وملعقة كبيرة زبد، وقدمه.
''';
  static const String sideDishe5 = '''
1- اغسل الأرز وانقعه 30 دقيقة، ثم ضع في قدر مع كمية كافية من الماء لطهي الأرز، ثم تبله بالملح.\n
2- غطي القدر، واترك الأرز على نار هادئة حتى ينضج، ثم ارفع من على النار واتركه يبرد قليلًا.\n
3- في وعاء، اخلط الجبن الشيدر والجبن الموزاريلا والجبن الكريمي مع الريحان والثوم والفلفل الأسود.\n
4- شكل الأرز المسلوق كرات متساوية الحجم، ثم احشيها بخليط الجبن، وأعد تشكيلها مرة أخرى.\n
5- مرغ كرات الأرز في الدقيق، ثم اغمسها في البيض، ثم غطيها بالبقسماط الناعم.\n
6- سخن زيتًا غزيرًا، ثم اقلي كروكيت الأرز حتى يكتسب اللون الذهبي، ثم صفيها جيدًا، وقدمها ساخنة مع صوص من اختيارك.
''';
  static const String sideDishe6 = '''
1- سخن الزيت والزبد في مقلاة على نار متوسطة، ثم أضف البصل، وقلب حتى يذبل.\n
2- أضف ملعقة صغيرة سكر والملح والفلفل الأسود واستمر في التقليب حتى يتكرمل البصل ويصبح لونه بُنيًا.\n
3- افرد ورقة جلاش، ثم ادهنها بالسمن الذائب، ثم ضع قطعة كفتة وقليلًا من البصل المكرمل وجبن الموزاريلا، ثم لفها مثل السيجار.\n
4- كرر الخطوة السابقة حتى تنتهي من الكمية كلها، ثم ادهن قطع الجلاش بالسمن، ثم رصها في صينية فرن مدهونة بالسمن.\n
5- اخفق البيضة مع ملعقة كبيرة ماء، ثم ادهن وجه الجلاش بها.\n
6- اخبز الجلاش بالكفتة في فرن مُسخن مُسبقًا على درجة حرارة 200 مئوية، حتى يصبح مُقرمشًا ولونه ذهبيًا مدة 15 دقيقة تقريبًا، وقدمه ساخنًا مع صوص الطحينة.
''';
  static const String sideDishe7 = '''
1- ضع الزبد في وعاء على نار متوسطة، ثم أضف بشر البرتقال والجزر والقرفة وورقة اللورا والكركم، وقلب جيدًا.\n
2- أضف الأرز، وقلبه حتى تتجانس المكونات، ثم ضع عصير البرتقال والماء ومكعب المرقة، واترك الأرز حتى يغلي.\n
3- أضف الملح إلى الأرز، وغطي القدر، واتركه ينضج على نار هادئة مدة 20-25 دقيقة.\n
4- ارفع الأرز عن النار، واتركه خمس دقائق مغطى، ثم ضعه في أطباق التقديم، وزين الوجه بالكاجو أو اللوز.
''';
  static const String sideDishe8 = '''
1- قطع شرائح الخبز إلى مكعبات صغيرة.\n
2- حمص مكعبات الخبز على نار هادئة، في مقلاة غير لاصقة، حتى يصبح مُقرمشًا، واتركه جانبًا.\n
3- في المقلاة نفسها، امسحها بمناشف ورقية، ثم أضف الزبد والسكر، واخلطه جيدًا.\n
4- اترك المزيج معًا، على نار هادئة، مع التحريك باستمرار، حتى يذوب السكر تمامًا.\n
5- أضف الفانيليا، وقلبه دقيقة، ثم أضف صودا الخبز، واخلط المكونات معًا.\n
6- أغلق الموقد، وأضف مكعبات الخبز المحمص، وقلبه جيدًا.\n
7- في صينية كبيرة، ضع مكعبات الكراميل بالخبز، واتركها تبرد تمامًا قبل التقديم.
''';
  static const String sideDishe9 = '''
1- لتحضير الحشو، اخلط جبن الفيتا مع البقدونس في وعاء، ثم ضعه جانبًا هو والزبد الذائب حتى الانتهاء من تحضير العجين.\n
2- اخلط الدقيق والحليب والبيض في وعاء كبير لعمل عجين الفطائر، ثم اعجن بيديك حتى يتشكل لديك عجين متماسك.\n
3- قسم العجين عشر كرات متساوية الحجم، ثم غطيها بقطعة قماش مبللة حتى لا تجف.\n
4- رش كمية وفيرة من الدقيق على سطح أملس، ثم افرد الكرات واحدة تلو الأخرى حتى تصبح لديك عشر ورقات عجين رقيقة.\n
5- في قدر كبيرة على نار متوسطة، سخن ثلاث لترات ماء، ثم أضف نصف ملعقة صغيرة من الملح وملعقتين كبيرتين ماء، وضع بجانبك وعاءً كبيرًا به ماء بارد.\n
6- ضع ورقة عجين في الماء المغلي، واتركها من دقيقة إلى دقيقتين، ثم أخرجها بملعقة كبيرة، وضعها في الماء البارد 30 ثانية لإيقاف طهيها، ثم انتشلها وضعها على قماشة نظيفة.\n
7- كرر الخطوة السابقة حتى تنتهي ورقات العجين.\n
8- ادهن صينية فرن بالزبد، ثم ضع ورقة عجين، وادهنها بالزبد، ثم ضع ورقة أخرى وادهنها بالزبد، ثم كررها مع ثلاث ورقات أخرى.\n
9- وزع حشو جبن الفيتا والبقدونس، فوق الورقة الخامسة، ثم ضع فوقه الورقة سادسة وادهنها بالزبد، ثم كرر الخطوة حتى تنتهي من ورقات العجين كلها.\n
10- في وعاء، اخفق بيضة مع ربع كوب زيت ونصف كوب زبادي، ثم وزع الخليط على وجه الفطيرة.\n
11- سخن الفرن على درجة حرارة 180 مئوية، ثم اخبز الفطيرة مدة 40 دقيقة أو حتى تصبح ذهبية اللون، ثم قطعها وقدمها ساخنة.
''';
  static const String sideDishe10 = '''
1- ضع الدقيق والملح في وعاء، وقلب جيدًا، ثم أضف الماء تدريجيًّا، وقلب حتى يتكون لديك عجين متماسك.\n
2- غطي العجين، واتركه جانبًا 30 دقيقة حتى يرتاح.\n
3- ضع اللحم المفروم والبصل والملح والفلفل الأسود والكمون في وعاء، وقلب جيدًا حتى تمتزج المكونات.\n
4- قسم العجين إلى أربعة أجزاء، واتركها ترتاح عشر دقائق أخرى.\n
5- افرد كل جزء من العجين على سطح مرشوش بالدقيق، ثم قسمه إلى مستطيلات متوسطة الحجم.\n
6- ادهن الوجه بالسمن، ثم ضع مقدارًا من الحشو على كل مستطيل، وطبق العجين بحيث تغطيه.\n
7- ادهن عجين اليغمش من الجهتين بالسمن، وضعه على طبق مرشوش بالدقيق.\n
8- ضع قدرًا من الماء المغلي على نار متوسطة، وثبت مصفاة طهي على البخار، ثم ضع عليها اليغمش، واطهيه على البخار مدة 30 دقيقة حتى ينضج.\n
9- ضع اليغمش في طبق التقديم، وزين وجهه بالكمون والشطة.
''';
  static const String sideDishe11 = '''
1- سخن الفرن عند 190 درجة مئوية.\n
2- على نار متوسطة، ضع الحليب والثوم والكريمة وقلب جيدًا، ثم اترك المزيج  يغلي .\n
3- تبل شرائح البطاطس بالملح والفلفل الأسود، ثم ضعها في مزيج الحليب والكريمة دقيقتين.\n
4- ضع شرائح البطاطس في صينية الفرن، ثم أضف مزيج الكريمة فوقها وضع الجبن المبشور على الوجه.\n
5- أدخل صينية البطاطس بالكريمة الفرن 30 دقيقة حتى تنضج، ثم أخرجها.\n
6- قدم صينية البطاطس بالكريمة اللباني ساخنة.
''';
  static const String sideDishe12 = '''
1- ضع اللحم والبصل والبقدونس والبيضة والبقسماط وصلصة الطماطم والبهارات والبابريكا  والفلفل الحار والكركم والملح والفلفل الأسود في وعاء كبير، وقلب جيدًا حتى تمتزج المكونات.\n
2 - ضع حلقة بطاطس، ثم افرد ملعقة من الحشو فوقها، ثم ضع حلقة بطاطس أخرى فوق الدجاج، لتُشكلها كالساندويش.\n
3 - كرر هذه الخطوة مع باقي البطاطس والدجاج، واتركها جانبًا.\n
4 - اغمس البطاطس في الدقيق، ثم البيض، ثم البقسماط الخشن.\n
5 - اقل البطاطس في زيت غزير ومغلي، حتى تُصبح ذهبية اللون، أو ضع البطاطس في فرن عند درجة حرارة 200 درجة مئوية مدة 25 دقيقة، حتى تُصبح ذهبية اللون.
''';
  static const String sideDishe13 = '''
1- في مقلاة على نار متوسطة، ضع اللحم المفروم وقلب حتى يختفي اللون الأحمر منه.\n
2- أضف البصل، ثم قلبه مع اللحم حتى يذبل.\n
3- أضف السبع بهارات والكاري والملح والفلفل الأسود، ثم اخفض الحرارة واترك اللحم على نار هادئة حتى ينضج، مدة عشر دقائق تقريبًا.\n
4- احشي السمبوسة باللحم، ولفها على شكل رول، ثم رصها في صينية فرن.\n
5- أذيب مكعب مرق الدجاج في كوبين ماء ساخن، ثم صبه فوق السمبوسة.\n
6- في وعاء، اخلط القشطة والجبن الكريمي، ثم ضع الخليط فوق السمبوسة.\n
7- سخن الفرن على درجة حرارة 200 مئوية، ثم ضع المنتو الكذاب في الرف السفلي 15 دقيقة، ثم حمر الوجه تحت الشواية، ثم قدمه ساخنًا.
''';
  static const String sideDishe14 = '''
1- سخن الفرن عند 180 درجة مئوية.\n
2- سخن الزيت في مقلاة كبيرة على نار متوسطة، ثم أضف البصل والثوم وقلبه دقيقتين.\n
3- أضف الدجاج وقلبه حتى يتغير لونه، ثم أضف الملح والفلفل الأسود والبابريكا، وقلبه باستمرار على نار هادئة حتى ينضج الدجاج وتجف السوائل.\n
4- أضف الجزر والفلفل الملون، وقلب دقيقة، ثم ارفعه عن النار.\n
5- افرد ورقة السمبوسك، ثم ضع ملعقة من الحشو على طرف العجين، ولفه رول.\n
6- رص رولات المانتو الكذاب في صينية الفرن، واتركها جانبًا.\n
7- ضع الجبن الكريمي والجبن السائل والكريمة والملح والفلفل الأسود وجوزة الطيب في وعاء، واخفقه بالمضرب اليدوي حتى تمتزج المكونات.\n
8- صب الخليط فوق المانتو، ثم ضع الصينية في الفرن من 20 إلى 25 دقيقة، حتى يُصبح المانتو ذهبيًا.\n
9- أخرج الصينية، ثم وزع الجبن على الوجه، وضعها في الفرن مرةً أخرى مدة خمس إلى ثماني دقائق حتى يذوب الجبن، ويُصبح الوجه ذهبي اللون.
''';
  static const String sideDishe15 = '''
1- ضع الدجاج والمرق وورق الغار في قدر على نار هادئة.\n
2- اقسم الجزرة وثمرة بصل نصفين، ثم ضعهما مع الدجاج والمرق.\n
3- اترك الدجاج على النار 15 إلى 20 دقيقة أو حتى ينضج.\n
4- فتت صدور الدجاج بشوكة أو في محضر الطعام، ثم أضف لها الجبن الكريمي وعصير الليمون، وقلب.\n
5- افرم ثمرة البصل المتبقية وفصي الثوم، ثم ضعهما مع الزبد في مقلاة على نار متوسطة، وقلبه حتى يكتسب البصل لونًا دهبيًا فاتحًا.\n
6- أضف البصل والثوم إلى خليط الدجاج، ثم تبله بالملح والفلفل الأسود، ثم قلبه حتى تمتزج المكونات.\n
7- سخن ثلاثة أكواب من المرق الذي سلقت فيه الدجاج، ثم أضف كمية مساوية من الدقيق، ثم قلبه بملعقة خشبية بسرعة لمدة دقيقتين إلى ثلاث دقائق، أو حتى يصبح لديك عجين متماسك.\n
8- ارفع العجين من على النار، ثم ضعه في الثلاجة حتى يبرد مدة 60 دقيقة تقريبًا.\n
9- عفر يديك بالدقيق، ثم خذ قطعة من العجين بحجم ثمرة ليمون كبيرة، ثم احشها بقليل من حشو الدجاج، ثم كورها، وأعطها شكلًا مدببًا من الأعلى.\n
10- كرر الخطوة السابقة حتى تنتهي من الكمية كلها.\n
11- اخفق البيضتين، وضع البقسماط الناعم في طبق وتبله بالملح والفلفل الأسود.\n
12- اغمس قطع الكوشينا في البيض، ثم مرّغها في البقسماط، ثم ضعها في الثلاجة 60 دقيقة حتى تتماسك.\n
13- سخن زيتًا غزيرًا في مقلاة عميقة، ثم اقلي الكوشينا على دفعات حتى يصبح لونها ذهبيًا، ثم صفيها جيدًا من الزيت، وقدمها مع صوص من اختيارك.
''';
  static const String sideDishe16 = '''
1. ضع الدقيق والبيكنج بودر والسكر ورشة ملح وملعقتين كبيرتين زيت في وعاء لعمل العجين.\n
2. افرك الدقيق مع الزيت، ثم أضيف الماء حسب الحاجة تدريجيًا في أثناء العجن.\n
 3. استمر في العجن بيديك حتى يتشكل لديك عجين ناعم وطري.\n
4. قسم العجين إلى كرات متساوية الحجم، ثم غطيها بالدقيق، ورصها في صينية.\n
5. غطي كرات العجين، واتركها ترتاح 30 دقيقة.\n
6. حضر حشوة اللحم خلال راحة العجين، ضع اللحم المفروم في وعاء، ثم اعصر البصل بين يديك للتخلص من الماء قبل إضافته إلى اللحم.\n
7. أضيف الزبادي والطحينة ودبس الرمان والملح والسبع بهارات إلى اللحم المفروم، ثم اخلط جيدًا.\n
8. رش طاولة المطبخ بالدقيق، ثم افرد كرات العجين بسُمك رقيق، ثم قطعها دوائر متساوية الحجم، ثم رشها بالدقيق حتى لا يلتصق بعضها ببعض.\n
9. افرد حشو اللحم على دوائر العجين.\n
10. سخن مقلاة غير قابلة للالتصاق على نار متوسطة، ثم حمر صفائح العجين من الأسفل.\n
11. رص صفائح العجين في صينية، ثم ضعها في الفرن أسفل الشواية من دقيقتين إلى ثلاث دقائق حتى ينضج اللحم.\n
12. غطي صفيحة اللحم بقماشة نظيفة بمجرد إخراجها من الفرن، حتى تظل طرية، وأستمتع بها مع سلطة الزبادي أو الثومية.
''';
  static const String sideDishe17 = '''
1. سخن الفرن عند درجة حرارة 200 درجة مئوية 20 دقيقة.\n
2. ضع الدقيق الأبيض في صينية فرن، ثم ضع الصينية في الفرن من خمس إلى ثماني دقائق.\n
3. قلب الدقيق كل ثلاث دقائق، ثم أخرجه من الفرن، واتركه يبرد تمامًا.\n
4. ضع الدقيق بنوعيه في وعاء كبير، ثم أضيف الخميرة والملح والحلبة والكزبرة، وقلب جيدًا.\n
5. أضيف الماء، وقلب جيدًا حتى يذوب الدقيق، ويُصبح الخليط شبه سائل.\n
6. غط الوعاء بورق نايلون شفاف، واتركه في مكان دافئ 30 دقيقة.\n
7. سخن مقلاة غير قابلة للالتصاق على نار متوسطة، وادهنها بنقطتين من الزيت.\n
8. صب مقدار ثلث كوب من العجين في المقلاة، ووزعه حتى يُغطي قاع المقلاة.\n
9. اترك العجين دقيقتين، حتى يجف الوجه ولا يُصبح سائلًا.\n
10. غطي المقلاة، واتركها على نار هادئة دقيقة أخرى، ثم ارفع الكسرة على طبق، وغطيها بمنشفة نظيفة حتى لا تجف.\n
11. كرر الخطوات السابقة مع باقي العجين حتى تنتهي منه، ثم قدم الكسرة الحبشية مع اللحوم والأطباق الرئيسية.
''';
  static const String sideDishe18 = '''
1. على نار متوسطة، سخن ملعقتي الزيت وأضيف قطع الدجاج.\n
2. قلب حتى يتغير لون الدجاج، ثم أضيف البصل الملح والزنجبيل وقلب دقيقتين.\n
3. أضيف الثوم والجزر وقلب من جديد، ثم ضع الكرنب.\n
4. قلب المكونات حتى تذبل الخضراوات، ثم أضيف صلصة الصويا وقلب حتى تتداخل المكونات.\n
5. أضيف البصل الأخضر وارفع القدر عن النار.\n
6. اترك المزيج حتى يبرد، ثم احشي عجينة السبرنج رولز بالحشوة.\n
7. على نار متوسطة، اقلي السبرنج رولز حتى تتحمر، ثم ارفعها من على النار وقدمها ساخنة.
''';
  static const String sideDishe19 = '''
1. حضر الحشو، سخن ملعقة زبد في مقلاة، ثم أضيف البصل واطهي إلى أن يذبل.\n
2. افرد العجين في صينية تارت مدهون بالزبد، ثم أدخلها فرنًا مُسخنًا مُسبقًا على درجة حرارة 180 مئوية لعشر دقائق.\n
3. أضيف السبانخ وتبّلي بالفلفل الأسود والملح، واطه إلى أن يذبل، ثم ضع في طبق واتركه جانبًا.\n
4. في نفس المقلاة، سخن ملعقة زبد، أضيف قطع الدجاج وتبّلي بالملح والفلفل واطه إلى أن تنضج.\n
 5. اخلط البيض مع الكريمة واخفق جيدًا.\n
6. أضيف السبانخ إلى العجين المخبوز، ثم الدجاج، ثم أضيف خليط البيض والكريمة.\n
7. رش الجبن المبشور على الوجه، ثم أدخلها فرنًا مسخنًا مٍسبقًا على درجة حرارة 170 مئوية لمدة 35 دقيقة.
''';
  static const String sideDishe20 = '''
1. قشر البصل، ثم باستخدام سكينة اصنع قطعًا طوليًا من الرأس إلى الأسفل، ليصل إلى منتصف البصلة.\n
2. اسلق البصل في ماء وملح مدة لا تزيد على عشر دقائق، صفيها واتركها تبرد قليلًا، ثم افصل طبقات البصل عن بعضها.\n
3. حضر الحشو، في وعاء كبير اخلطي جميع مكونات الحشوة معًا.\n\
4. حضر الصلصة، سخن زيت الزيتون في مقلاة، أضيف معجون الطماطم والنعناع المجفف والثوم وقلب جيدًا، اطهي دقيقة ثم ضع المقلاة جانبًا.\n
5. احشي البصل بكمية مناسبة من الحشو، ثم ضع المحشي في مقلاة الصلصة، وضع شرائح الطماطم على وجه المحشي.\n
6. صب نصف كوب ماء إلى المحشي، غط المقلاة واطهي مدة 45 دقيقة على نار منخفضة حتى ينضج.
''';
  static const String sideDishe21 = '''
1. اسلق المكرونة في إناء به ماء مغلي ومملح، واتركها لمدة 15 دقيقة حتى تنضج، ثم صفيها من الماء، واتركها جانبًا.\n
2. ضع الزيت والزبد في قدر كبير على نار متوسطة، واتركهما حتى يذوب الزبد.\n
3. أضيف البصل، وقلبه حتى يذبل ويُصبح لونه بنيًّا فاتحًا.\n
4. أضيف الماء المغلي والملح والفلفل الأسود والبهارات الإيطالية، وقلب جيدًا، ثم اترك الخليط يغلي لمدة دقيقتين.\n
5. أضيف المكرونة المسلوقة، وقلب جيدًا لمدة دقيقتين.\n
6. ضع المكرونة في طبق التقديم، وزينها بالبارميزان، ثم كلها ساخنة مع الدجاج المقرمش والسلطات.
''';
  static const String sideDishe22 = '''
1. ضع البطاطس في قدر كبيرة على نار متوسطة، ثم أضيف الماء والملح، واتركه حتى يغلي.\n
2. غطي القدر، واتركه على نار هادئة لمدة 40 – 45 دقيقة حتى تنضج البطاطس.\n
3. ضع البطاطس في وعاء كبير، واهرسها ناعمًا.\n
4. أضيف باقي المقادير عدا الكورن فليكس، وقلب جيدًا حتى تمتزج المكونات.\n
5. شكل البطاطس على هيئة كرات صغيرة، ثم اغمسها في الكورة فليكس ليُغطيها من جميع الجهات.\n
6. حمر البطاطس في زيت غزير ومغلي، حتى تُصبح ذهبية اللون.\n
7. أخرج البطاطس، وضعها في طبق التقديم.\n
يمكنك إضافة كوب من الجبن الشيدر المبشور إلى البطاطس قبل غمسها في الكورن فليكس.
''';
  static const String sideDishe23 = '''
1. ضع البصل في وعاء، ثم أضيف إليه الملح والخل وقلبي، ثم اتركه جانبًا لمدة خمس دقائق.\n
2. اغسل البصل بالماء الجاري، لتتخلص من الخل والملح، ثم صفه من الماء، واتركه جانبًا.\n
3. ضع المايونيز في وعاء، ثم أضيف إليه الكاتشب ومكعبات الخيار المخلل والبقدونس والثوم وثلاث ملاعق كبيرة من الجزر المبشور، وقلب جيدًا حتى تمتزج المكونات.\n
4. افتح الخبز بالمقص، ثم أزيل الأجزاء الداخلية للخبز.\n
5. ادهن الخبز بخليط المايونيز، ثم وزع التونة، ثم الأرز، ثم المرتديلا، ثم حلقات البيض، ثم البطاطس المسلوقة، ثم الزيتون والبصل والطماطم والجزر والخس والخيار المخلل، ثم أغلق الخبز جيدًا.\n
6. قطع الخبز ثلاث قطع، ثم ضع الساندوتشات في طبق التقديم، وقدمها مع البطاطس المقلية.\n
7. استغني عن الخبز إذا أردت، ووزع الخضار والأرز في طبق التقديم بجانب بعضه البعض، ثم ضع التونة والمرتديلا وحلقات البيض على الوجه، ثم وزع صوص المايونيز فوق طبق البوكاديوس، وقدمه كطبق سلطة على مائدة طعامك، ويمكنك الاستغناء عن الأرز أيضًا، والاكتفاء بالخضار.
''';
  static const String sideDishe24 = '''
1. ضع الدقيق والزبد في محضر الطعام، واخفق حتى يصبح قوام الخليط مثل فتات الخبز "البقسماط المطحون".\n
2. أضيف بيضة وملعقة كبيرة ماء إلى الخليط، ثم اخفق حتى يتجانس، ويصبح لديك عجين متماسك.\n
3. افرد العجين بسُمك ثلاثة مليمترات تقريبًا على سطح مرشوش بالدقيق، على شكل قالب تارت متوسط الحجم.\n
4. ضع العجين في القالب، واضغط عليها من الجوانب وحواف القالب.\n
5. اثقب قاعدة العجين والجوانب بشوكة عدة مرات، ثم ضعها في الثلاجة لمدة 15 دقيقة.\n
6. سخن الفرن على درجة حرارة 180 مئوية.\n
7. ضع ورقة زبدة على العجين، ثم املئها بفاصوليا أو لوبيا مجففة، لعمل ثقل على العجين.\n
8. اخبز الفطيرة لمدة عشر دقائق، ثم ارفع الفاصوليا وورق الزبد من على الفطيرة، ثم أكمل خبزها لمدة 10 إلى 15 دقيقة أخرى.\n
9. أخرج الفطيرة من الفرن، وضعها جانبًا لتبرد.\n
10. ارفع حرارة الفرن إلى 200 درجة مئوية.\n
11. ضع البصل والكوسا في صينية فرن، ثم تبلهما بالملح والفلفل الأسود زيت الزيتون.\n
12. أدخل الكوسا والبصل الفرن، واتركهما لمدة 30 دقيقة مع التقليب من حين لآخر، حتى ينضجا ويكتسبا اللون الذهبي.\n
13. قطع السبانخ، ثم ضعها في مقلاة على نار متوسطة، وقلب عدة دقائق حتى تنضج.\n
14. صف السبانخ من الماء الذي أنزلته خلال الطهي قدر الإمكان.\n
15 .في وعاء، اخفق الكريمة وبيضتين ونصف كمية جبن الموزاريلا، ثم تبلي الخليط بالملح والفلفل الأسود.\n
16. رش الجبن المتبقي على الفطيرة، ثم ضع البصل والكوسا والسبانخ فوقها، ثم صب خليط الكريمة فوقهم.\n
17. اخفض حرارة الفرن إلى 180 درجة مئوية، ثم اخبز كيش الخضراوات لمدة 25 إلى 30 دقيقة أو حتى تتماسك الحشوة، ويكتسب الوجه اللون الذهبي.\n
18. اترك الكيش يبرد قليلًا، ثم أخرجه من القالب وضعه في طبق التقديم، وكله دافئًا.
''';
  static const String sideDishe25 = '''
1. في وعاء محضرة الطعام، ضع الجمبري والأرز والبصل والثوم والشبت والبقدونس والكزبرة الخضراء والتوابل، وافرم المكونات جيدًا.\n
2. ادهن يديك بالزيت وشكل الكفتة أصابع أو كرات حسب الرغبة، ثم أدخلها الثلاجة مدة ساعة.\n
3. على نار متوسطة، اقلي كفتة الجمبري في زيت غزير ثم ارفعها من على النار.\n
4. تخلص من الزيت الزائد وضع الكفتة في طبق التقديم، وزين الوجه بالبقدونس وأستمتع بها ساخنة.
''';
  static const String sideDishe26 = '''
1. سخن الفرن عند درجة حرارة 180 درجة مئوية.\n
2. ضع الماء والسكر والخميرة في وعاء كبير، وقلب جيدًا، ثم اتركه في مكان دافئ لمدة عشر دقائق.\n
3. أضيف الحليب والزيت والبيكنج باودر والدقيق والملح، واخفق بالمضرب الكهربائي حتى تمتزج المكونات.\n
4. صب العجين في صينية دائرية مدهونة بالزيت، ثم غطي الصينية بورق بلاستيك، واتركه يرتاح لمدة 30 دقيقة.\n
5. أزيل الورق، ثم ضع الصينية في الفرن لمدة 10 – 12 دقيقة.\n
6. ضع الجبن السائل والكريمي والبيضة في وعاء، واخفق جيدًا حتى تمتزج المكونات.\n
7. صب الخليط فوق الفطيرة المخبوزة، ثم وزع مكعبات الفيتا والموتزاريلا والشيدر وحبة البركة على الوجه.\n
8. ضع الصينية في الفرن لمدة 30 دقيقة، ثم قدمها ساخنة.
''';
  static const String sideDishe27 = '''
1. اغلي كوبين ماء على نار متوسطة، ثم ضع ورق العنب في الماء مدة دقيقة، ثم صفيها.\n
2. في وعاء كبير، اخلط الأرز مع الطماطم والبقدونس والنعناع والبصل وعصير الليمون وخمس ملاعق زيت زيتون والبابريكا والفلفل الأسود والشطة وملعقة كبيرة ونصف ملح، لعمل خلطة الحشو.\n
3. احشي ورق العنب من الجهة الخشنة التي تبرز فيها عروق الورق. \n
4. ضع ملعقة كبيرة زيت زيتون في قدر كبيرة، ثم رص شرائح البطاطس والجزر.\n
5. رص أصابع ورق العنب في القدر فوق البطاطس والجزر.\n
6. اغمر ورق العنب بالماء، ثم ضع نصف ملعقة كبيرة ملح.\n
7. ضع طبقًا زجاجيًا داخل القدر فوق ورق العنب، حتى لا ينفتح في أثناء الطهي، ثم غطي القدر.\n
8. ضع القدر على نار متوسطة حتى يغلي الماء، ثم أخفض حرارة النار، واترك ورق العنب على نار هادئة حتى ينضج مدة 60 دقيقة تقريبًا.\n
9. رص ورق العنب في طبق التقديم، وقدمه باردًا أو ساخنًا كمقبلات أو طبق جانبي.
''';
  static const String sideDishe28 = '''
1. ضع الحليب والخميرة والسكر في وعاء كبير، وقلب جيدًا، ثم اتركه في مكان دافئ لمدة خمس دقائق.\n
2. أضيف البيض والزبد والملح وكوب من الدقيق، واعجن جيدًا حتى تمتزج المكونات.\n
3. أضيف باقي الدقيق، واعجن بيديك جيدًا، حتى تحصل على عجين طري ومتماسك.\n
4. ادهن الوعاء بقليل من الزيت، ثم ضع العجين، وغطيه بورق بلاستيك شفاف، واتركه في مكان دافئ لمدة ساعة.\n
5. سخن الفرن عند درجة حرارة 180 درجة مئوية.\n
6. شكل العجين إلى 30 كرة متساوية الحجم، ثم افرد كل كرة، واحشيها بمكعب جبن، ثم شكلها كالكرة مرةً أخرى.\n
7. ضع الكرات في صينية فرن دائرية مدهونة بقليل من الزيت، واجعلها ملتصقة ببعضها البعض.\n
8. ضع الزبد والثوم والكزبرة والفلفل الأسود في وعاء، وقلب جيدًا حتى تمتزج المكونات، ثم اتركه جانبًا.\n
9. غط الصينية بورق بلاستيك شفاف لمدة 30 دقيقة، ثم ادهن الوجه بخليط الزبد والكزبرة.\n
10. ضع الصينية في الفرن لمدة 35 – 40 دقيقة، ثم قدم خلية النحل ساخنة مع الصلصات المختلفة.
''';
  static const String sideDishe29 = '''
1. سخن الفرن عند درجة حرارة 180 درجة مئوية.\n
2. ضع اللحم والبصل والجزر والبقدونس والبهارات والكاري والملح والفلفل الأسود، وقلب جيدًا حتى تمتزج المكونات.\n
3. افرد ورقة قصدير، ثم افرد فوقها ورقة زبدة، ثم ضع اللحم على طرف الورقة، ولفيها كالرول.\n
4. ضع رول اللحم في ماء مغلي، واتركه على نار هادئة لمدة 40 دقيقة حتى تنضج.\n
5. أخرج اللحم من النار، وأزيل ورقة القصدير والزبدة، واتركه يبرد تمامًا.\n
6. اسلق البطاطس في ماء مملح، واتركها حتى تنضج، ثم صفيها من الماء.\n
7. ضع البطاطس والفلفل الأسود والزبد الطري في وعاء كبير، واهرسها حتى تُصبح ناعمة.\n
8. افرد ورقة قصدير، ثم افرد البطاطس فوق القصدير.\n
9. ضع رول اللحم على طرف البطاطس، ثم لف البطاطس فوق اللحم كالرول.\n
10. ضع رول البطاطس باللحم في صينية فرن، ثم أزيل القصدير، وادهن وجه البطاطس بالزبد الذائب.\n
11. ضع الصينية في الفرن لمدة 30 – 35 دقيقة حتى يصبح الرول ذهبي اللون.\n
12. قطع رول البطاطس باللحم إلى شرائح، وأستمتع بها ساخنة.
''';
  static const String sideDishe30 = '''
1. جهز الحشو، سخن الزيت، واقلي البصل إلى أن يذبل، ثم أضيف الثوم إلى أن يكتسب لونًا ذهبيًا.\n
2. أضيف جميع البهارات، ومعجون الطماطم ودبس الرمان، وقلب جيدًا حتى تمتزج المكونات معًا.\n
3. أضيف المزيج إلى الأرز وقلب جيدًا.\n
4. افرد ورقة من أوراق العنب، ثم ضع كمية مناسبة من الحشو في المنتصف بحيث لا تصل إلى الأطراف، اثني جانبيّ الورقة، ثم أغلق جانبًا على الحشو، ثم لفها كَرول، وكرر حتى الانتهاء.\n
5. في قدر أضيف حلقات طماطم وجزر أو بصل في الأرضية، رُص ملفوف ورق العنب ثم أضيف شرائح الليمون فوق آخر طبقة.\n
6. على نار متوسطة ضع القدر، أضيف قليلًا من الزيت إلى الوجه، واتركه 10 دقائق، ضع طبقًا مُقعرًا مقلوبًا فوق آخر طبقة واضغط قليلًا.\n
7. أضيف مزيج الماء الساخن ودبس الرمان وقليلًا من الملح والفلفل، اترك القدر على نار عالية لمدة 15 دقيقة، ثم خفف النار واترك الملفوف لمدة 60 دقيقة حتى ينضج ويجف ماؤه.
''';

  ////////////////// == Breakfast Dishes == //////////////////
  static const String breakfastDishe1 = '''
1. ضع الدقيق والماء في مقلاة صغيرة، وقلب حتى يذوب الدقيق تمامًا.\n
2. ضع المقلاة على نار متوسطة، وقلب باستمرار حتى يغلي الخليط ويغلظ.\n
3. ارفع الخليط عن النار، واتركه يبرد.\n
4. ضع الحليب والخميرة وملعقة كبيرة من السكر في وعاء، وقلب جيدًا، ثم اتركه في مكان دافئ مدة عشر دقائق.\n
5. ضع الدقيق والسكر والملح في وعاء كبير، وقلب جيدًا.\n
6. أضيف بيضة واحدة والزبد وخليط الحليب، واعجن جيدًا.\n
7. أضيف خليط الدقيق والماء واعجن، ثم ضع العجين على سطح مرشوش بقليل من الدقيق، واعجن مرة أخرى حتى تحصل على خليط متماسك.\n
8. ضع العجين في وعاء مدهون بقليل من الزيت، ثم غط الوعاء بورق نايلون شفاف، واتركه في مكان دافئ مدة ساعة.\n
9. قطع العجين ثلاث قطع متساوية الحجم تقريبًا، ثم افرد القطعة الأولى بيديك على شكل مستطيل، ثم لفها على شكل رول عريض (أقرب إلى شكل الباتيه).\n
10. ضع الرول الأول في الطرف الأيمن لصينية مستطيلة مقاس (22 * 12 سم).\n
11. كرر الخطوات السابقة مع القطعتين الثانية والثالثة، ثم ضعهما بجانب القطعة الأولى، وتأكد من التصاقها ببعضها البعض في الصينية.\n
12. سخن الفرن عند درجة حرارة 180 درجة مئوية مدة 30 دقيقة.\n
13. غط الصينية بورق نايلون شفاف، واتركها في مكان دافئ مدة 30 دقيقة.\n
14. اخفق البيضة الثانية، وادهن الوجه بها، ثم ضع الصينية في الفرن مدة 30 دقيقة حتى يُصبح الخبز ذهبيًّا.\n
15. أخرج الخبز من الفرن، واتركه يهدأ قليلًا، ثم قطعه 16 شريحة، وقدم الخبز مع الوجبات المختلفة.
''';
  static const String breakfastDishe2 = '''
1. ضع الحليب والبيض والزيت في وعاء كبير، واخفق جيدًا بالمضرب اليدوي حتى تمتزج المكونات.\n
2. أضيف الدقيق والملح والسكر، واخفق جيدًا حتى يذوب الدقيق تمامًا، وتحصل على عجين ناعم خالٍ من التكتلات.\n
3. غطي الوعاء بورق نايلون، واتركه جانبًا مدة 20 دقيقة.\n
4. سخن مقلاة غير قابلة للالتصاق على نار متوسطة، ثم ادهنها بقليل من الزبد، ثم صب ربع كوب من العجين، وحرك المقلاة حتى يُغطي العجين قاع المقلاة.\n
5. اترك الكريب على النار مدة 30 – 40 ثانية، ثم اقلبه على الجهة الأخرى، واتركه مدة 30 ثانية.\n
6. ارفع الكريب في طبق، وكرر الخطوات السابقة مع باقي العجين حتى تنتهي منه.\n
7. افرد ورقة كريب، ثم وزع السكر على نصفه، ثم اثنيه على شكل نصف دائرة، ثم ربع دائرة، ثم ضعه في طبق التقديم.\n
8. كرر الخطوة السابقة مع باقي الكريب، وضعه في أطباق التقديم، وزينه بشرائح الليمون والكريمة المخفوقة، وأستمتع.
''';
  static const String breakfastDishe3 = '''
1. ضع قطعتي توست فوق بعضهما، ثم افردهما بعصا فرد العجين، ثم قطعهما بقطاعة دائرية.\n
2. كرر الخطوة السابقة حتى تنتهي من القطع كلها، سيصبح لديك ثمانية أرغفة دائرية.\n
3. تبل البيض بالملح والفلفل الأسود، ثم اغمس الأرغفة في البيض، ثم غطها بالبقسماط.\n
4. سخن زيتًا غزيرًا على نار متوسطة، ثم اقلي الأرغفة حتى تنتفخ وتكتسب اللون الذهبي.\n
5. صف الأرغفة جيدًا من الزيت، ثم اقسمها نصفين.\n
6. في وعاء، اخلط المايونيز مع الزبادي والمستردة وعصير الليمون والملح والفلفل، ثم أضيف التونة والذرة والفلفل الألوان والزيتون.\n
7. احشي الأرغفة بحشوة التونة، ثم ضع شرائح الخس فوقها، وكلها وأستمتع.
''';
  static const String breakfastDishe4 = '''
1. حضر العجين، اخلط الحليب الدافئ مع الخميرة وقليل من السكر، واتركها خمس عشرة دقيقة.\n
2. في العجان الكهربائي، اخلط الدقيق مع ثلث كوب من السكر، والملح والفانيليا وبشر الليمون وجوزة الطيب، واخفق.\n
3. أضيف البيض ومزيج الخميرة والحليب، واخفق حتى تتكون لديك عجينة متماسكة، وأضيف مزيدًا من الدقيق إذا لزم الأمر.\n
4. أضيف نصف كمية الزبد واخفق 5 دقائق، ثم أضيف كمية الزبد المتبقية، واخفق سبع دقائق أخرى، حتى تحصل على عجينة ناعمة ومتماسكة، ولا تنسي كشط الجوانب.\n
5. في وعاء مدهون بالزبد، شكل العجين على شكل كرة، وضعها فيه، غطيه، واتركه ساعة إلى ساعتين حتى يتخمر.\n
6. اضغط على العجين بيديك لأسفل، ثم غطيه مرة أخرى، وضعه في الثلاجة طوال الليل.\n
7. حضر الحشو، اخلط السكر والكريمة والملح، واترك المزيج على نار خفيفة، خمس دقائق، مع التحريك من حين لآخر، حتى يذوب السكر تمامًا.\n
8. أضيف الشوكولا والزبد والفانيليا، وقلب حتى يصبح المزيج ناعمًا، ثم اتركه يبرد إلى درجة حرارة الغرفة.\n
9. حضر الستريوسيل، اخلط الدقيق والسكر ومسحوق الكاكاو والملح معًا، أضيف الزبد المذاب، وافرك بيديك جيدًا، ثم أضيف رقائق الشوكولا وقلب.\n
10. حضر السيرب، اخلط السكر والماء معًا، واترك المزيج حتى يغلي على نار متوسطة، ثم خفف النار واتركه دقيقتين، مع التقليب من حين لآخر.\n
11. قسم العجين إلى نصفين، وضع قطعة منهما على سطح مرشوش بالدقيق، افردها على شكل مستطيل، وضع نصف كمية الحشو، ووزعها جيدًا\n.
12. لف العجين على شكل رول، ثم لفه بورق النايلون، وأدخله الفريزر عشر دقائق، وكرر مع النصف الآخر.\n
13. قطع كل لفة عجين على حدة، نصفين بالطول، واجعل طبقات الحشو لأعلى، ثم لفهما حول بعضهما لعمل ضفيرة.\n
14. ضع الخبز في قوالب مناسبة، مُغلفة بورق الزبدة، ثم غطيها واتركها ساعة حتى ترتاح.\n
15. رش شوكولا الستريوسيل على وجه الخبز، ثم اخبز في فرن مُسخن مُسبقًا على درجة حرارة 180 مئوية، 40 إلى 50 دقيقة، حتى تنضج وتكتسب لونًا بنيًا ذهبيًا.(اختبر نضجها بعود خشبي مثل الكيك)\n.
16. استخدم سيخًا أو سكينًا، واصنع ثقوبًا كثيرة في الخبز، تصل إلى القاع، فور خروجها من الفرن مباشرة، ثم صب السيرب، واتركه يبرد قبل التقديم.
''';
  static const String breakfastDishe5 = '''
1. في وعاء، ضع دقيق الحمص والزيت والملح والكمون والماء، ثم اخفق بالمضرب اليدوي أو الكهربائي حتى تمتزج المكونات جيدًا.\n
2. صب الخليط في صينية فرن مدهونة بالزيت.\n
3. سخن الفرن على درجة حرارة 180 مئوية، ثم ضع الكرنتيكا على الرف الأوسط، واخبزها من 30 إلى 40 دقيقة أو حتى تتماسك، ثم ضعها تحت الشواية حتى تتحمر.\n
4. قطع الكرنتيكا مربعات وكلها مع خبز الباجيت.
''';
  static const String breakfastDishe6 = '''
1. على نار متوسطة، ضع الفراولة والماء وقلب جيدًا.\n
2. أضيف السكر وعصير الليمون وقلب حتى يذوب السكر تمامًا.\n
3. أضيف الجيلاتين واستمر في التقليب، ثم اترك الخليط على نار هادئة 35 دقيقة.\n
4. ارفع المربى الدايت من على النار واتركها حتى تبرد، ثم ضعها في برطمانات زجاجية محكمة الغلق، واحفظها في الثلاجة.
''';
  static const String breakfastDishe7 = '''
1. على نار متوسطة، ضع حبوب الرمان والماء وقلب جيدًا.\n
2. اترك الخليط على النار حتى يبدأ الغليان، ثم أضيف السكر وقلب جيدًا حتى يذوب السكر.\n
3. أضيف عصير الليمون واستمر في التقليب.\n
4. اترك الخليط على نار هادئة 30 دقيقة، حتى يُصبح القوام بالكثافة المطلوبة، ثم ارفع المربى من على النار.\n
5. اترك المربى تبرد تمامًا،  ثم ضعها في برطمانات زجاجية محكمة الغلق، واحفظها في الثلاجة.
''';
  static const String breakfastDishe8 = '''
1. ضع الزيت والكرفس في مقلاة غير قابلة للالتصاق على نار متوسطة.\n
2. قلب الكرفس حتى يذبل ويقترب من النضج مدة ثلاث دقائق.\n
3. أضيف الملح والفلفل الأسود والقرفة والزعفران، ثم قلب.\n
4. أضيف البيض إلى المقلاة، ثم قلبه مع الكرفس بملعقة خشبية.\n
5. انتظر حتى ينضج البيض ويتماسك، ثم ارفعه من على النار، وكلها مع الخبز العربي والجبن.
''';
  static const String breakfastDishe9 = '''
1. على نار متوسطة، ضع شرائح اللحم المقدد في مقلاة غير لاصقة، وقلبها على الجانبين حتى تتحمر.\n
2. ارفع اللحم المقدد من على النار.\n
3. استخدم أي نوع خبز كيتو تفضلين، أو أوراق الخس.\n
4. ضع شرائح اللحم المقدد والبيض والأفوكادو في الخبز.\n
5. قدم سندويشات اللحم المقدد على الإفطار.
''';
  static const String breakfastDishe10 = '''
1. في وعاء، اخلط الدقيق والسميد والسكر والملح والخميرة، وقلب المكونات معًا.\n
2. أضيف الزيت والبيض، ثم أضيف الماء تدريجيًا، واخلط بالخلاط اليدوي (الهاند بلندر).\n
3. أضيف نصف كوب ماء إضافي، إذا لزم الأمر، حتى تحصلي على عجينة سائلة.\n
4. غطي الوعاء، واترك العجين 30 دقيقة، حتى يتخمر.\n
5. قلب العجين مرة أخرى، ثم سخن مقلاة غير لاصقة جيدًا،على نار متوسطة، وادهنها بالزبد.\n
6. أضيف كمية مناسبة من العجين إلى المقلاة، وحركها حتى يتوزع العجين على أرضية المقلاة كلها.\n
7. غطي المقلاة، واترك البغرير حتى تظهر الفقاعات، ويكتسب من الأسفل لونًا ذهبيًا فاتحًا، ثم اقلبه.\n
8. اتركه لثوان، ثم أخرجه من المقلاة، وكرر حتى الانتهاء من الكمية المتبقية.\n
9. ادهن البغرير بالزبد، بعد رفعه مباشرة من النار، ورش قليلًا من السكر، وأستمتع.
''';
  static const String breakfastDishe11 = '''
1. اكسر البيض في وعاء، وأضيف الملح والفلفل الأسود، واخفق جيدًا.
2. أضيف الجزر والبصل، واخفق البيض مرة أخرى.
3. ضع مقلاة غير لاصقة على نار متوسطة، وادهنها بالزيت واتركها تسخن.
4. ضع طبقة رقيقة من مزيج البيض، واتركها حتى تقترب من النضج ثم لفها.
5. ادهن المقلاة بالزيت مرة أخرى، وضع طبقة من مزيج البيض، ثم لفها نحو الطبقة الأولى حتى يصبحا لفة واحدة.
6. كرر الخطوات حتى الانتهاء من مزيج البيض، ثم ارفع لفائف البيض عن النار.
7. اترك لفائف البيض حتى تبرد قليلًا، ثم قطعها، وزين الوجه بالبصل الأخضر وقدمها.
''';
  static const String breakfastDishe12 = '''
1. سخن الفرن عند درجة حرارة 190 درجة،
 ووزع الفول السوداني في صينية الفرن.
2. حمص الفول السوداني لمدة 10 دقائق، أو حتى يكتسب لونًا ذهبيًا.
3. ضع الفول السوداني وهو دافئ  في وعاء محضرة الطعام دون أي اضافات.
4. اطحن الفول السوداني، مع تقلبه من وقت لآخر للحصول على قوام متجانس.
5. استمر في طحن الفول السوداني حتى يتحول القوام إلى زبدة.
6. احفظ زبدة الفول السوداني في وعاء زجاجي لحين الاستخدام.
''';
  static const String breakfastDishe13 = '''
1. اخلط الدقيق والتوابل وصودا الخبز والبيكنج بودر والملح معًا، واتركه جانبًا.
في وعاء آخر، اخفق الزبدة والسكر والسكر البني معًا بخلاط كهربائي على سرعة منخفضة، ثم أضيف الفانيليا.
2. اخلط خليط الدقيق تدريجيًا في خليط الزبدة حتى يتجانس جيدًا.(قد تبدو العجينة جافة ومفتتة).
3. شكل العجينة على شكل كرة وغطي الوعاء بورق النايلون واتركه في الثلاجة لِساعة.
4. افرد العجينة بِسمك سم واحد، استخدم قطاعة البسكويت للتشكيل، ثم ضعها في الفريزر لِدقيقتين.
5. انقل البسكويت إلى صينية مبطنة بورق الزبدة بِحرص، وأدخلها فرنًا مُسخنًا مسبقًا على درجة حرارة 180 مئوية لمدة 12 إلى 15 دقيقة حتى تصبح ذهبية اللون.
6. أخرجها واتركها لِتبرد تمامًا في الصينية.
''';
  static const String breakfastDishe14 = '''
1. سخن الفرن عند درجة حرارة 200 درجة مئوية.
2. ضع الماء والسكر والخميرة في وعاء، وقلب جيدًا، ثم اتركه في مكان دافئ لمدة عشر دقائق.
3. ضع الدقيق والملح والسمسم في وعاء كبير، وقلب جيدًا، ثم أضيف السمن، واعجني بيديك حتى يتشرب الدقيق السمن.
4. أضيف خليط الخميرة واللبن والقشدة، واعجن بيديك حتى تحصل على عجين طري ومتماسك.
5. غط الوعاء بورق بلاستيك، واتركه في مكان دافئ لمدة ساعة.
6. شكل العجين على هيئة كرات متوسطة الحجم.
7. ضع العجوة والزبد والسمسم في وعاء، واعجن بيديك حتى تحصل على عجين طري.
8. شكل العجوة بعدد كرات العجين نفسها.
9. افرد كل كرة عجين، ثم ضع داخلها كرة عجوة، وشكلها مرةً أخرى إلى كرات.
10. وزع كرات العجين في صينية مدهونة بالسمن، واضغط عليها بيديك حتى تنفرد قليلًا، ثم غطيها بمنشفة نظيفة، واتركها ترتاح لمدة 20 دقيقة.
11. ضع الصينية في الفرن لمدة 20 – 25 دقيقة، حتى تُصبح ذهبية اللون.
''';
  static const String breakfastDishe15 = '''
1. اخلط الدقيق وبديل السكر والبيكنج بودر والملح معًا.
2. في وعاء آخر، امزج البيض والزيت والحليب معًا جيدًا، ثم أضيف المزيج إلى الخليط الجاف.
3. امزج المكونات معًا، حتى تتكون لديك عجينة ناعمة، واتركها ترتاح في درجة حرارة الغرفة 10 دقائق.
4. سخن مقلاة متوسطة غير لاصقة على نار متوسطة، أربع دقائق، ثم ادهنها بقليل من الزبد أو زيت جوز الهند.
5. صب ثلث كوب من العجينة في المقلاة، وحركها بلطف في حركات دائرية، حتى يتوزع الخليط.
6. اترك الكريب ينضج من ثلاث إلى أربع دقائق، ثم اقلبه برفق على الجانب الآخر بملعقة كبيرة، واتركه دقيقة إلى دقيقتين، ثم ارفعه من المقلاة.
7. كرر حتى الانتهاء من العجينة، ثم زينه حسب الرغبة، وأستمتع.
8. يمكنك تخزينه في الثلاجة، يومين، وتسخنه في مقلاة على نار خفيفة أو في الميكروويف قبل الاستخدام.
''';
  static const String breakfastDishe16 = '''
1. سخن الفرن عند درجة حرارة 180 درجة مئوية.
2. ضع البيض والحليب في وعاء كبير، واخفق جيدًا.
3. أضيف الجبن والفلفل الملون والسبانخ والملح والفلفل الأسود والبصل الأخضر، وقلب جيدًا.
4. ادهن صواني الكب كيك بالزيت أو الزبد، ثم وزع البيض في قوالب الصينية.
5. ضع الصينية في الفرن من 20 – 25 دقيقة حتى ينضج البيض.
6. قدمه أومليت الكب كيك ساخنًا مع الخبز.
''';
  static const String breakfastDishe17 = '''
1. اخلط البيض والسكر جيدًا، ثم أضيف الزيت واستمر في الخفق.
2. أضيف الماء وقليلًا من الشمر واليانسون، واستمر في التقليب، ثم أضيف الخميرة.
3. ضع الدقيق تدريجيًا واستمر في العجن حتى تحصل على عجينة ناعمة ومتماسكة، (أضيف قليلًا من الدقيق إذا لزم الأمر).
4. قطع العجينة إلى كُرات صغيرة واضغط عليها قليلًا (شكّلها كالقرص)، ثم رُص في صينية فرن مُبطنة بورق الزبدة.
5. استخدم فرشاة وادهن وجه الكاليط بخليط البيض، ثم زينها بِشوكة، ورُشها بِقليلٍ من السمسم.
6. أدخل الصينية فرنًا مُسخنًا مُسبقًا على الرف الأوسط في درجة حرارة 170 مئوية، واتركها مدة 20 دقيقة أو حتى تكتسب لونًا ذهبيا من الأسفل، ثم شغل الشواية للوجه.
''';
  static const String breakfastDishe18 = '''
1. ضع البابريكا والكزبرة والملح والثوم والبصل والفلفل الأسود في وعاء صغير، وقلب جيدًا، ثم اترك الوعاء جانبًا حتى تحضير البطاطس.
2. قطع البطاطس إلى أصابع، ثم ضعها في وعاء كبير، ثم أضيف الخل وكمية من الماء البارد، واتركها جانبًا لمدة 20 دقيقة.
3. اغسل البطاطس جيدًا تحت الماء الجاري، ثم جففها من الماء الزائد.
4. اقلي البطاطس في زيت غزير، حتى تُصبح ذهبية اللون.
5. أخرج البطاطس المقلية على مناديل مطبخ للتخلص من الزيت الزائد، ثم تبلها فورًا بخليط البهارات، ثم أستمتع بها ساخنة.
''';
  static const String breakfastDishe19 = '''
1. انقع الفول ليلة كاملة في الماء.
2. على نار هادئة، ضع الفول وأضيفي ماء بمقدار ضعف كمية الفول، واترك الفول من 4 -5 ساعات.
3. على نار متوسطة، ضع الزيت واتركه يسخن ثم أضيف البصل وقلب حتى يكتسب لونًا ذهبيًا.
4. أضيف الثوم والطماطم والملح والفلفل الأسود وقلب المكونات جيدًا.
5. أضيف الفول المدمس وقلب المكونات ثم اتركها 10 دقائق على النار.
6. ارفع الفول من على النار وضعه في طبق التقديم، وزين الوجه بزيت السمسم.
''';
  static const String breakfastDishe20 = '''
1. ضع الكينوا وكوب حليب في قدر على نار متوسطة، واتركه حتى يغلي.
2. اخفض درجة حرارة النار، ثم غطي القدر، واتركه على نار هادئة حتى تصبح الكينوا طرية لمدة 15 إلى 20 دقيقة تقريبًا.
3. ارفع القدر من على النار، ثم أضيف السكر والقرفة وقلب.
4. اغرف الكينوا في أطباق التقديم، وصب عليها الحليب المتبقي بعد تسخينه، ثم ضع الفاكهة أو المكسرات على الوجه، وأستمتع بها على الإفطار.
''';
  static const String breakfastDishe21 = '''
1. ضع الثوم والفلفل الحار مع ربع كوب ماء في محضر الطعام، وافرم المكونات جيدًا، ثم ضعها في طبق صغير جانبًا.
2. افرم الفول والطماطم في محضر الطعام، حتى يصبح الخليط ناعم القوام.
3. في مقلاة على نار متوسطة، ضع السمن والبصل، وقلب حتى يكتسب البصل لونًا ذهبيًا فاتحًا.
4. أضيف معجون الطماطم، وقلبه مع البصل، ثم أضيف خليط الثوم والفلفل الحار.
5. انتظر من ثلاث إلى خمس دقائق حتى تتسبك الطماطم، ثم أضيف الفول.
6. أضيف نصف كوب ماء، وتبل الفول بالملح والكمون، ثم اتركه يغلي على نار عالية لمدة عشر إلى 15 دقيقة.
7. زين الفول بقليل من البصل والفلفل الحار المفرومين، ثم قدمه ساخنًا مع خبز التميس اليمني.
 تُحضر وصفة فول القلابة اليمني التقليدية في قدر حجرية منحوتة يدويًا تُسمى المغش.
''';
  static const String breakfastDishe22 = '''
1. انقع فول الصويل يومًا كاملًا في الماء، ثم صفه من الماء.
2. في وعاء محضرة الطعام، اطحن فول الصويا جيدًا.
3. على نار متوسطة، ضع فول الصويا المطحون واغمره بالماء واتركه يغلي.
4. ارفع فول الصويا من على النار وصفه باستخدام شاش نظيف.
5. ضع الصويا على النار مرة أخرى مدة خمس دقائق، ثم ارفعه من على النار.
6. أضيف للصويا عصير الليمون أو خل التفاح والملح وحبة البركة، وقلب جيدًا واتركه حتى يتجبن.
7. احفظه في وعاء مناسب في الثلاجة لحين الاستخدام.
''';
  static const String breakfastDishe23 = '''
1. قطع البصل والثوم وكذلك البقدونس والكزبرة الخضراء.
2. ضع المكونات في الكبة أو محضرة الطعام وافرمها بين الناعم والخشن.
3. أعيد الفرم مرة أخرى مع إضافة التوابل جميعًا حتى يصبح الخليط ناعمًا تمامًا.
4. ضها في الفريزر لحين الاستخدام.
5. قبل القلي مباشرة أخرج الكمية حسب الحاجة وأضيف البيكربونات وقلب ثم شكلها بيديك وضع عليها السمسم قبل القلي.
6. اقليها في زيت غزير بعد تسخينه جيدًا.
''';
  static const String breakfastDishe24 = '''
1. في وعاء كبير، ضع الدقيق والسكر والبيكنج باودر والملح، وقلب جيدًا.
2. أضيف الحليب والبيض والزبدة، وقلب حتى تمتزج المكونات.
3. على نار متوسطة، سخن مقلاة غير قابلة للالتصاق، ومدهونة بنقطة زيت.
4. ضع مقدار ربع كوب من العجين، واتركها لمدة دقيقة إلى دقيقتين.
5 اقلب البان كيك على الجهة الأخرى، واتركها لمدة دقيقة إلى دقيقتين.
6. ضع البان كيك في أطباق التقديم، وزينها بشراب القيقب (الماربل سيرب)، والفاكهة الطازجة.
''';
  static const String breakfastDishe25 = '''
1.على نار متوسطة، ضع الحليب، ثم ضع الترمومتر، واتركه على النار حتى تصل درجة الحرارة إلى 80 درجة مئوية (180 درجة فهرنهايت).
2. ارفع الوعاء من على النار فورًا، ثم صبه في طاجن فخار له غطاء، واتركه جانبًا حتى  تصل درجة حرارته إلى 45 درجة مئوية (110 درجة فهرنهايت).
3. في وعاء صغير، ضع الزبادي، ثم أضيف إليه ملعقتين من الحليب، وقلب جيدًا.
4. صب الخليط تدريجيًا فوق الحليب الموجود في الطاجن، وقلب ببطء.
5. سخن الفرن عند درجة حرارة 45 درجة مئوية (110 درجة فهرنهايت).
6. يمكنك وضع ترمومتر الحرارة في الفرن للتأكد من ثبات درجة الحرارة عند 45 درجة مئوية.
7. غط الطاجن، ثم ضعه في الفرن لمدة 12 ساعة عند درجة حرارة ثابتة (45 درجة مئوية).
8. افتح الغطاء، وتخلص من السائل الموجود، ثم ضع الطاجن في الثلاجة لمدة ساعتين.
9.حضر مصفاة، وضع بها شاش قطن، ثم صف الزبادي من الماء بعصره داخل القطن.
10. ضع الزبادي في الثلاجة مرةً أخرى لمدة ساعة، ثم أخرجه وصفه من الماء عن طريق الشاش.
11. تخلص من السائل، واحفظ الزبادي في الثلاجة.
''';
  static const String breakfastDishe26 = '''
1. في وعاء كبير، ضع الموز، واهرسه جيدًا بالشوكة.
2. أضيف العسل والفانيليا والقرفة والملح والشوفان، وقلب جيدًا.
3. افرد الخليط في قوالب التارت، أو الكب كيك، واترك فراغات في منتصف كل منها.
4. سخن الفرن عند درجة حرارة 180 درجة مئوية.
5. ضع الصينية في الفريزر لمدة 30 دقيقة، ثم أخرجها وضعها في الفرن لمدة 30 دقيقة.
6. أخرج التارت من الفرن، واتركه يهدأ، ثم وزع الزبادي في الفراغات.
7. وزع الفاكهة فوق الزبادي، ثم أستمتع  يالتارت.
''';
  static const String breakfastDishe27 = '''
1. على نار متوسطة، ضع الزيت والزبدة، واتركهما حتى تذوب الزبدة.
2. أضيف البصل وقلب لمدة دقيقتين، ثم أضيف الثوم وقلب لمدة دقيقة.
3. أضيف البلوبيف والفلفل الأسود والبهارات، وقلب لمدة 5 دقائق.
4. ضع البيض على وجه البلوبيف، ثم رشي الملح على البيض.
5. غطي المقلاة، واتركها على نار هادئة لمدة 5 دقائق حتى ينضج البيض، ثم أستمتع ساخنًا.
''';
  static const String breakfastDishe28 = '''
1. في وعاء كبير، ضع البيض والحليب والبقدونس والكمون والبابريكا والملح والفلفل الأسود، وقلب جيدًا.
2. اسلق البطاطس في ماء مملح، واتركها لمدة 15 دقيقة حتى تنضج.
3. على نار متوسطة، ضع الزيت والزبد، واتركهما حتى يذوب الزبد.
4. أضيف البصل والثوم، وقلبهما لمدة دقيقة، ثم أضيف الفلفل الأخضر والأحمر، وقلب لمدة دقيقتين.
5. أضيف البطاطس وقلب لمدة دقيقتين، ثم أضيف البيض، ثم غطي المقلاة، واتركها على نار هادئة من 10 – 15 دقيقة حتى ينضج البيض.
''';
  static const String breakfastDishe29 = '''
1. في وعاء، ضع البيض والبصل والشوفان والحليب والبقدونس والبابريكا والملح والفلفل الأسود، وقلب جيدًا.
2. على نار متوسطة، ذوّب الزبدة، ثم أضيف خليط البيض، واتركه على نار هادئة لمدة 3 دقائق.
3. اقلب البيض على الجهة الأخرى، واتركه لمدة ثلاث دقائق.
4. ضع البيض بالشوفان في طبق التقديم، وأستمتع ساخنًا مع الخبز على وجبة الفطور.
''';
  static const String breakfastDishe30 = '''
1. في وعاء كبير، ضع الموز واهرسه جيدًا بالشوكة.
2. أضيف البيضة والعسل والبيكنج باودر والقرفة والملح والفانيليا، وقلب جيدًا.
3. أضيف الزبادي والشوفان والحليب، وقلب جيدًا.
4. سخن الفرن عند درجة حرارة 180 درجة مئوية.
5. في صينية الكب كيك، وزع ورق الكب كيك، ثم املئ ثلث الفتحة بخليط الشوفان.
6. وزع في كل فتحة نوع من الفاكهة أو المكسرات، ثم املئ باقي الفتحة بخليط الشوفان.
7. ضع الصينية في الفرن لمدة 30 – 40 دقيقة حتى تنضج.
''';
}

class RecipesIngredients {
  static const String noodles = '''
← 250 غرام نودلز صيني\n
⇦ 750 غرام مزيج خضار شرقي مجمد، جاهز لتحضير الأكلات الصينية\n
• 500 غرام صدور دجاج، مقطّعة إلى قطع مستطيلة الشكل\n
⚫ 5 فصوص ثوم مهروس\n
⦿ ½ كوب زنجبيل طازج، مبشور\n
• رشة بهار أبيض\n
⚫1 كوب من صوص الصويا\n
''';

/////////////// == Main Dishes == /////////////////
  static const String mainDishe1 = '''
◾️ كيلو (1000 جم) صدور دجاج مقطعة شرائح رفيعة.\n
◾️ ثمرة فلفل أحمر رومي كبيرة مقطعة شرائح رفيعة.\n
◾️ ثمرة فلفل أصفر رومي كبيرة مقطعة شرائح رفيعة.\n
◾️ ثمرة فلفل أخضر رومي كبيرة مقطعة شرائح رفيعة.\n
◾️ بصلة كبيرة مقطعة شرائح.\n
◾️ 3  فصوص ثوم مهروسة.\n
◾️ 3 ملاعق كبيرة (45 مل) مرق دجاج.\n
◾️ 2 ملعقة كبيرة (30 مل) عصير ليمون.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت زيتون.\n
◾️ ملح حسب الرغبة.\n
◾️ خبز تورتيلا وصوص الأفوكادو وشرائح طماطم وخس للتقديم.\n
بهارات الفاهيتا:\n
◾️ ½ 1 ملعقة صغيرة (7.5 جم) بودرة فلفل أحمر حار.\n
◾️ ملعقة صغيرة (5 جم) كمون مطحون.\n
◾️ ملعقة صغيرة (5 جم) أوريغانو مجفف مطحون.\n
◾️ ملعقة صغيرة (5 جم) بودرة ثوم.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بابريكا مدخنة.
''';
  static const String mainDishe2 = '''
◾️ 3 أكواب (450 جم) من الدقيق.\n
◾️ 2 كوب (500 مل) من الماء المثلج مع مكعبات الثلج.\n
◾️ ½ ملعقة صغيرة (2.5 جم) من البابريكا.\n
◾️ زيت للقلي.
''';
  static const String mainDishe3 = '''
الكريب:\n
◾️ ½ 1 كوب (225 جم) دقيق متعدد الاستخدامات.\n
◾️ 2 كوب (500 مل) حليب.\n
◾️ 2 بيضة كبيرة.\n
◾️ ملعقة كبيرة (15 جم) زبد ذائب وبارد.\n
◾️ ½ ملعقة صغيرة (2.5 جم) سكر.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ¼ ملعقة صغيرة (1.25 مل) فانيليا سائلة.\n
الفاهيتا:\n
◾️ ½ كيلو (500 جم) لحم مقطع شرائح رفيعة، أو صدور دجاج مقطعة شرائح رفيعة\n
◾️ بصلة كبيرة مقطعة شرائح رفيعة.\n
◾️ ثمرة فلفل أحمر رومي كبيرة مقطعة شرائح رفيعة.\n
◾️ ثمرة فلفل أصفر رومي كبيرة مقطعة شرائح رفيعة.\n
◾️ ثمرة فلفل أخضر رومي كبيرة مقطعة شرائح رفيعة.\n
◾️ ¼ كوب (62.5 مل) زيت.\n
◾️ ملعقة كبيرة (15 جم) زبد غير مملح في درجة حرارة الغرفة.\n
◾️ ملعقة كبيرة (15 جم) صلصة طماطم.\n
◾️ ملعقة كبيرة (15 مل) عصير ليمون.\n
◾️ 2 ملعقة كبيرة (30 مل) ماء.\n
◾️ 2 ملعقة صغيرة (10 جم) بودرة فلفل أحمر حار.\n
◾️ ملعقة صغيرة (5 جم) كمون مطحون.\n
◾️ ملعقة صغيرة (5 جم) بابريكا مدخنة.\n
◾️ ملعقة صغيرة (5 جم) بودرة ثوم.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بودرة بصل.\n
◾️ ½ ملعقة صغيرة (2.5 جم) سكر.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) فلفل أسود مطحون.\n
◾️ ملعقة صغيرة (5 جم) ملح.
''';
  static const String mainDishe4 = '''
لسلق الدجاج:\n
◾️ دجاجتان (2400 جم) مقطعتان 8 قطع.\n
◾️ 2 ملعقة كبيرة (25 جم) سمن.\n
◾️ ½ ملعقة صغيرة (2.5 جم) مستكة.\n
◾️ ملعقة صغيرة (5 جم) فلفل أسود.\n
◾️ 2 ورق لورا "غار".\n
◾️ 6 رؤوس حبهان "هيل.\n
◾️ 2 ثمرة بصل كبيرة الحجم مقطعتان أرباع.\n
◾️ 2 قرن فلفل أخضر حار.\n
◾️ ماء لسلق الدجاج.\n
◾️ ملح حسب الرغبة.\n
للسليق:\n
◾️ 4 أكواب (800 جم) أرز مصري.\n
◾️ 8 أكواب (2000 لتر) مرق دجاج.\n
◾️ لتر (1000 مل) حليب كامل الدسم.\n
◾️ ¼ كوب (50 جم) سمن.\n
◾️ ½ ملعقة صغيرة (2.5 جم) مستكة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) حبهان "هيل" مطحون.\n
◾️ ملح حسب الرغبة.\n
◾️ لتحمير الدجاج:\n
◾️ 4 ملاعق كبيرة (50 جم) معجون طماطم.\n
◾️ 2 ملعقة كبيرة (25 جم) زبد.\n
◾️ ملح وفلفل أسود حسب الرغبة.
''';
  static const String mainDishe5 = '''
◾️ ½ كيلو (500 جم) ورق عنب مسلوق.\n
◾️ 2 ثمرة طماطم كبيرة مفرومة فرمًا ناعمًا.\n
◾️ بصلة كبيرة مفرومة فرمًا ناعمًا.\n
◾️ ¼ كيلو (250 جم) لحم مفروم.\n
◾️ حزمة كزبرة طازجة مفرومة.\n
◾️ حزمة شبت طازج مفروم.\n
◾️ حزمة بقدونس طازج مفروم.\n
◾️ 3 ملاعق كبيرة (45 مل) زيت زيتون.\n
◾️ ½ ملعقة كبيرة (6.25 جم) زبد.\n
◾️ 4 ملاعق كبيرة (50 جم) صلصة طماطم.\n
◾️ 3 ملاعق كبيرة (45 مل) عصير ليمون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كمون مطحون.\n
◾️ ملح وفلفل أسود.\n
◾️ بصل مقطع حلقات.\n
◾️ طماطم مقطعة شرائح.
''';
  static const String mainDishe6 = '''
مقادير باستا القصدير بالدجاج\n:
◾️ 2 كوب (400 جم) مكرونة باستا مسلوقة.\n
◾️ ¼ كيلو (250 جم) صدور دجاج مخلية مقطعة مكعبات صغيرة.\n
◾️ ⅓ كوب (66.6 جم) بصل مفروم.\n
◾️ ¼ كوب (50 جم) زبد.\n
◾️ 2 فص ثوم مفروم.\n
◾️ 2 ملعقة كبيرة (25 جم) معجون طماطم.\n
◾️ ¾ كوب (187.5 مل) عصير طماطم.\n
◾️ ½ كوب (125 مل) ماء سلق المكرونة.\n
◾️ ¾ كوب (187.6 مل) كريمة طهي.\n
◾️ ملعقة صغيرة (5 جم) ريحان مجفف.\n
◾️ ملعقة صغيرة (5 جم) أوريجانو.\n
◾️ ملعقة صغيرة (5 جم) بابريكا.\n
◾️ ملح وفلفل أسود حسب الرغبة.\n
◾️ ½ كوب (100 جم) جبن بارميزان مبشور.\n
◾️ كوب (200 جم) جبن موزاريلا مبشور.
''';
  static const String mainDishe7 = '''
◾️ ½ كجم جمبري مقشر.\n
◾️ 2 ملاعق صغيرة (10 مل) زيت\n
◾️ ½ كوب (100 جم) جزر مقطع شرائح رقيقة\n
◾️ ½ كوب فلفل أحمر مُقطع مكعبات\n
◾️ ½ كوب بصل أخضر مقطع شرائح\n
◾️ فص ثوم مبشور.\n
◾️ ½ كوب أناناس معلب أو طازج، ومصفى.\n
◾️ ملح كوشير وفلفل أسود مطحون طازج حسب الرغبة.\n
الصلصة:\n
◾️ ¼ كوب (50 جم) كاتشب.\n
◾️ ¼ كوب (62.5 مل) عصير أناناس.\n
◾️ 3 ملاعق كبيرة (45 مل) خل التفاح.\n
◾️ 2 ملعقة كبيرة (20 جم) عسل.\n
◾️ 2 ملعقة كبيرة تماري قليلة الصوديوم أو صلصة الصويا.\n
◾️ ملعقة صغيرة (5 جم) صلصة الثوم الحار.\n
◾️ ¼ ملعقة صغيرة زنجبيل مطحون.\n
◾️ 2 ملعقة صغيرة (10 جم) نشا الذرة.
''';
  static const String mainDishe8 = '''
لعمل الشيش طاووق:\n
◾️  كيلو (1000 جم) أفخاذ دجاج مخلية من العظم ومنزوعة الجلد.\n
◾️ كوب (200 جم) زبادي.\n
◾️ ملعقة صغيرة (5 جم) كاري.\n
◾️ ملعقة صغيرة (5 جم) بابريكا.\n
◾️ ملعقة صغيرة (5 جم) كركم.\n
◾️ ملعقة صغيرة (5 جم) فلفل أسود.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️  ملعقة صغيرة (5 جم) ثوم مفروم\n
◾️ 2 ملعقة كبيرة (30 مل) خل.\n
◾️ 2 ملعقة كبيرة (30 مل) عصير ليمون.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت.\n
◾️ كوب (200 جم) بصل مقطع مربعات كبيرة.\n
◾️ كوب (200 جم) فلفل رومي ألوان مقطع مربعات كبيرة.\n
لعمل الأرز:\n
◾️ 3 أكواب (600 جم) أرز بسمتي مغسول ومنقوع.\n
◾️ ملعقة كبيرة (15 مل) زيت نباتي.\n
◾️ 2 ملعقة كبيرة (25 جم) زبد.\n
◾️ عود قرفة.\n
◾️ 2 ورق لورا "غار".\n
◾️ نجمة ينسون.\n
◾️ ملعقة صغيرة (5 جم) كركم.\n
◾️ ملح حسب الرغبة.\n
◾️ ماء ساخن لطهي الأرز.\n
◾️ لعمل صوص الزبادي:\n
◾️ 2 كوب (400 جم) زبادي\n
◾️ ¼ كوب (60 مل) عصير ليمون.\n
◾️ 3 فصوص ثوم مفروم.\n
◾️ كوب (200 جم) خبز شامي محمص.
''';
  static const String mainDishe9 = '''
◾️ عبوة (450 جم) لازانيا.\n
◾️ ¼ 2 كوب (450 جم) جبن ريكوتا.\n
◾️ ¼ 2 كوب (450 جم) جبن موزاريلا مبشور.\n
◾️ بيضة كبيرة.\n
◾️ رشة جوزة الطيب.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ½ ملعقة صغيرة (2.5 جم) فلفل أسود.\n
◾️ ¾ كوب (150 جم) جبن بارميزان مبشور.\n
◾️ ½ 3 أكواب (875 مل) صلصة مكرونة إيطالية.
''';
  static const String mainDishe10 = '''
◾️ كيلو (1000 جم) لحم.\n
◾️ 2 كوب (400 جم) أرز بسمتي منقوع ومصفى.\n
◾️ بصلة كبيرة مقطعة جوانح.\n
◾️ 4 فصوص ثوم.\n
◾️ 3 ثمرات بطاطس مقشرة مقطعة قطعًا كبيرة.\n
◾️ علبة زبادي.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت نباتي.\n
◾️ ملعقة صغيرة (5 جم) كزبرة مطحونة.\n
◾️ ملعقة صغيرة (5 جم) كمون مطحون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) حبهان مطحون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) قرنفل مطحون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) قرفة مطحونة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كركم.\n
◾️ 3 حبات حبهان.\n
◾️ عود قرفة.\n
◾️ 3 حبات قرنفل.\n
◾️ 3 أوراق لورا.\n
◾️ ملح وفلفل أسود.\n
◾️ ماء زعفران.\n
◾️ قطعة فحم.
''';
  static const String mainDishe11 = '''
◾️ ½ كيلو (500 جم) كبدة مقطعة قطعًا صغيرة.\n
◾️ ½ كيلو (500 جم) لحم مقطع مكعبات صغيرة جدًا.\n
◾️ 3 ملاعق كبيرة (45 مل) زيت.\n
◾️ 2 ملعقة كبيرة (25 جم) زبد.\n
◾️ 2 ثمرة فلفل أحمر حار مقطعة حلقات رفيعة.\n
◾️ 2 بصلة كبيرة مقطعة شرائح رفيعة.\n
◾️ ثمرة فلفل أخضر رومي مقطعة شرائح رفيعة.\n
◾️ ثمرة فلفل أصفر رومي مقطعة شرائح رفيعة.\n
◾️ ثمرة فلفل أحمر رومي مقطعة شرائح رفيعة.\n
◾️ ثمرة طماطم كبيرة مقطعة مكعبات صغيرة.\n
◾️ 6 فصوص ثوم كبيرة مفرومة.\n
◾️ حزمة صغيرة كزبرة طازجة مفرومة.\n
◾️ حزمة صغيرة بقدونس طازج مفروم.\n
◾️ 2 ملعقة كبيرة (30 مل) عصير ليمون.\n
◾️ 2 ملعقة صغيرة (10 جم) كمون مطحون.\n
◾️ ملعقة صغيرة (5 جم) بابريكا.\n
◾️ ملعقة صغيرة (5 جم) بهارات مشكلة.\n
◾️ ملح وفلفل أسود.
''';
  static const String mainDishe12 = '''
◾️ كيلو (1000 جم) لحم ضأن مقطع.\n
◾️ بصلة مفرومة ناعمًا.\n
◾️ ثمرة طماطم مقطعة مكعبات.\n
◾️ ثمرة بطاطس مقطعة.\n
◾️ 2 ثمرة فلفل أخضر مقطع.\n
◾️ 2 فص ثوم مفرومان ناعمًا.\n
◾️ ملعقة كبيرة (12.5 جم) صلصة طماطم.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت نباتي.\n
◾️ ملعقة صغيرة (5 جم) كزبرة مطحونة.\n
◾️ ملعقة صغيرة (5 جم) فلفل أحمر حار. (اختياري)\n
◾️ ملح وفلفل أسود.\n
◾️ خبز بر على الصاج حسب الرغبة.
''';
  static const String mainDishe13 = '''
◾️ ¼ كيلو (250 جم) نودلز، أو مكرونة إسباجتي.\n
◾️ ¼ كيلو (250 جم) لحم مقطع شرائح رفيعة.\n
◾️ ⅛ كيلو (125 جم) مشروم مقطع شرائح.\n
◾️ ⅛ كيلو (125 جم) بروكلي مقطع قطعًا صغيرة.\n
◾️ 2 ثمرة جزر مقشرة، ومقطعة مكعبات صغيرة.\n
◾️ ملعقة كبيرة (15 مل) زيت زيتون.\n
الصوص:\n
◾️ ⅓ كوب (83 مل) صويا صوص قليل الملح.\n
◾️ 3 ملاعق كبيرة (45 جم) صلصة المحار.\n
◾️ ملعقة كبيرة (12.5 جم) سكر بني.\n
◾️ ملعقة كبيرة (12.5 جم) زنجبيل طازج مفروم.\n
◾️ 2 فص ثوم مهروس.\n
◾️ ملعقة صغيرة (5 مل) زيت سمسم.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) فلفل أحمر حار مجفف مجروش.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) فلفل أسود مطحون.\n
◾️ سمسم محمص للزينة.
''';
  static const String mainDishe14 = '''
◾️ ½ 1 كوب (300 جم) نودلز.\n
◾️ بيضتان.\n
◾️ ½ كوب (100 جم) مشروم مقطع شرائح.\n
◾️ ½ كوب (100 جم) فلفل رومي ألوان مقطع شرائح.\n
◾️ 4 ثمرات بصل أخضر مقطعة شرائح.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت سمسم.\n
◾️ ملعقة صغيرة (5 جم) ثوم بودرة.\n
◾️ ملعقة صغيرة (5 جم) معجون زنجبيل.\n
◾️ 2 ملعقة كبيرة (30 مل) صويا صوص.\n
◾️ ملعقة كبيرة (15 مل) صوص حار.\n
◾️ مكعب مرق دجاج.\n
◾️ ملح حسب الرغبة.\n
◾️ ملعقة صغيرة (5 جم) سمسم محمص.\n
◾️ 5 أكواب (1250 مل) ماء ساخن.
''';
  static const String mainDishe15 = '''
◾️ ½ كيلو (500 جم) مشروم "فطر" بورتوبيللو مقطع شرائح رفيعة.\n
◾️ ⅓ كيلو (330 جم) عجين باف باستري.\n
◾️ ملعقة كبيرة (15 مل) زيت زيتون.\n
◾️ ملعقة كبيرة (12.5 جم) زبد.\n
◾️ كوب (200 جم) بصل مفروم ناعمًا.\n
◾️ ملعقة صغيرة (5 جم) ثوم مفروم.\n
◾️ ملح وفلفل أسود حسب الرغبة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) قرفة.\n
◾️ ½ كوب (100 جم) جبن بارميزان مبشور.\n
◾️ ½ كوب (100 جم) جبن موزاريلا مبشور.\n
◾️ بيضة مخفوقة.\n
◾️ 2 ملعقة صغيرة (10 جم) سمسم.
''';
  static const String mainDishe16 = '''
◾️ ½ كيلو (500 جم) بامية.\n
◾️ ½ كيلو (500 جم) لحم ضأن مع العظم مقطع مكعبات متوسطة الحجم.\n
◾️ 5 أكواب (1250 مل) ماء ساخن.\n
◾️ 2 ثمرة بصل كبيرة مقطعة أرباع.\n
◾️ 2 ورق لورا "غار".\n
◾️ 3 رؤوس حبهان "هيل".\n
◾️ ½ ملعقة صغيرة (2.5 جم) فلفل أسود.\n
◾️ كوب (250 مل) عصير طماطم.\n
◾️ 2 ملعقة كبيرة (25 جم) معجون طماطم.\n
◾️ ملعقة كبيرة (12.5 جم) سمن.\n
◾️ خمس فصوص ثوم.\n
◾️ 3 ملاعق كبيرة (45 مل) عصير ليمون.\n
◾️ ملح حسب الرغبة.\n
◾️ خبز تنور عراقي.
''';
  static const String mainDishe17 = '''
◾️ 2 كيلو (2000 جم) سمك هامور مقطع شرائح سميكة.\n
◾️ 10 فصوص ثوم.\n
◾️ ⅓ كوب (80 مل) عصير ليمون.\n
◾️ 2 ثمرة فلفل أخضر حار أو رومي.\n
◾️ حزمة كزبرة طازجة.\n
◾️ 2 كوب (260 جم) دقيق.\n
◾️ ½ كوب (60 جم) نشا.\n
◾️ ملعقة صغيرة (5 جم) كمون مطحون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كزبرة جافة مطحونة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كاري.\n
◾️ ملح وفلفل أسود.
''';
  static const String mainDishe18 = '''
◾️ كيلو (1000 جم) لحم مفروم.\n
◾️ 2 ملعقة كبيرة (28 جم) هريسة فلفل أحمر رومي.\n
◾️ 2 ملعقة كبيرة (25 جم) ثوم مهروس.\n
◾️ ملعقة صغيرة (5 جم) سبعة بهارات.\n
◾️ ملعقة صغيرة (5 جم) كزبرة جافة مطحونة.\n
◾️ ملعقة صغيرة (5 جم) بابريكا.\n
◾️ ملعقة صغيرة (5 جم) كمون مطحون.\n
◾️ ملعقة صغيرة (5 جم) فلفل أسود.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ½ ملعقة صغيرة (2.5 جم) زنجبيل مطحون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) قرنفل مطحون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) قرفة مطحونة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) هيل (حبهان) مطحون.\n
◾️ رشة جوزة الطيب.\n
◾️ خبز فينو، أو شامي.
''';
  static const String mainDishe19 = '''
◾️ كيلو (1000 جم) عصبان "أمعاء" ضأن منظف جيدًا.\n
◾️ ¼ كيلو (250 جم) لحم ضأن مقطع مكعبات صغيرة جدًا.\n
◾️ ¼ كيلو (250 جم) كبد وكلاوي ضأن مقطعة مكعبات صغيرة.\n
◾️ 2 كوب (400 جم) أرز.\n
◾️ ¾ كوب (150 جم) بصل أخضر مفروم.\n
◾️ كوب (200 جم) بصل أبيض مفروم.\n
◾️ ½ 1 كوب (300 جم) طماطم مقطعة مكعبات صغيرة.\n
◾️ حزمة (30 جم) بقدونس طازج مفرومة ناعمًا.\n
◾️ حزمة (25 جم) شبت طازج مفرومة ناعمًا.\n
◾️ ½ حزمة (15 جم) كزبرة طازجة مفرومة ناعمًا.\n
◾️ 2 ملعقة صغيرة (10 جم) نعناع طازج مفروم.\n
◾️ 3 ملاعق كبيرة (37.5 جم) معجون طماطم.\n
◾️ ملعقة صغيرة (5 جم) كركم.\n
◾️ ملعقة صغيرة (5 جم) شطة.\n
◾️ ملعقة صغيرة (5 جم) كزبرة.\n
◾️ ملعقة صغيرة (5 جم) نعناع مجفف.\n
◾️ ¼ كوب (60 مل) زيت نباتي.\n
◾️ ملح وفلفل أسود حسب الرغبة.\n
لمرق الطهي:\n
◾️ ¼ كوب (60 مل) زيت نباتي.\n
◾️ ثمرة بصل كبيرة الحجم مقطعة أرباع.\n
◾️ 2 ملعقة كبيرة (25 جم) معجون طماطم.\n
◾️ ملعقة صغيرة (5 جم) كركم.\n
◾️ ملح وفلفل أسود حسب الرغبة.\n
◾️ 5 أكواب (1250 مل) ماء ساخن.
''';
  static const String mainDishe20 = '''
◾️ 4 ثمرات باذنجان متوسطة الحجم.\n
◾️ 2 كوب (400 جم) زبادي.\n
◾️ 2 فص ثوم مفروم.\n
◾️ ملعقة كبيرة (15 مل) زيت زيتون.\n
◾️ ملح وفلفل أسود.\n
اللحم:\n
◾️ ½ كيلو (500 جم) لحم مقطع مكعبات صغيرة، أو لحم مفروم.\n
◾️ بصلة متوسطة مفرومة ناعمًا.\n
◾️ ½ ملعقة كبيرة (7.5 مل) صلصة فلفل أحمر حار أو بارد.\n
◾️ ملعقة كبيرة (12.5 جم) صلصة طماطم.\n
◾️ 2 ملعقة كبيرة (30 مل) ماء.\n
◾️ 4 ملاعق كبيرة (60 مل) زيت زيتون.\n
◾️ 3 ثمرات طماطم مقطعة 4 قطع.\n
◾️ بصلة مقطعة 4 قطع.\n
◾️ ثمرة فلفل أخضر رومي مقطعة 4 قطع.\n
◾️ ثمرة فلفل أصفر رومي مقطعة 4 قطع.\n
◾️ ثمرة فلفل أحمر رومي مقطعة 4 قطع.\n
◾️ ملح وفلفل أسود.\n
◾️ ¼ كوب (50 جم) بقدونس طازج مفروم.
''';
  static const String mainDishe21 = '''
◾️ ½ كيلو (500 جم) لحم مسلوق.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت نباتي.\n
◾️ كوب (200 جم) مشمش مجفف "طرشانة".\n
◾️ كوب (200 جم) قراصيا "كوجة مجففة".\n
◾️ ¼ كوب (50 جم) زبيب.\n
◾️ ¼ كوب (50 جم) لوز مقشر.\n
◾️ ملعقة كبيرة (10 جم) ملح.\n
◾️ ملعقة صغيرة (5 جم) حبهان "هيل" مطحون.\n
◾️ 2 كوب (500 مل) ماء أو مرق لحم.\n
◾️ 3 ملاعق كبيرة (37.5 جم) سكر.
''';
  static const String mainDishe22 = '''
◾️ ½ كيلو (500 جم) لحم مفروم.\n
◾️ ¾ كوب (150 جم) فريك منقوع.\n
◾️ 2 كوب (500 مل) ماء.\n
◾️ ¾ كوب (150 جم) بصل مفروم ناعمًا.\n
◾️ 2 فص ثوم مفروم ناعمًا "اختياري".\n
◾️ ملعقة صغيرة (5 جم) توابل كفتة.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) فلفل أسود.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بابريكا.\n
◾️ ملح حسب الرغبة.
''';
  static const String mainDishe23 = '''
◾️ ½ كيلو (500 جم) مكرونة بنّا\n
◾️ ¼ كيلو (250 جم) عصاج لحم\n
◾️ 5 أكواب (1250 مل) بشاميل\n
◾️ ¼ 1 كوب (250 جم) جبن موتزاريلا مبشور\n
◾️ ¼ 1 كوب (250 جم) جبن شيدر مبشور\n
◾️ ¼ كوب (50 جم) جبن رومي مبشور
''';
  static const String mainDishe24 = '''
◾️ 4 أكواب (1000 مل) صلصة بشاميل.\n
◾️ ½ كيلو (500 جم) مكرونة بنّا.\n
◾️ ½ كيلو (500 جم) لحم ستيك مقطع شرائح رفيعة.\n
◾️ ½ ثمرة فلفل أحمر رومي مقطعة شرائح رفيعة.\n
◾️ ½ ثمرة فلفل أصفر رومي مقطعة شرائح رفيعة.\n
◾️ ½ ثمرة فلفل أخضر رومي مقطعة شرائح رفيعة.\n
◾️ ثمرة بصل متوسطة الحجم مقطعة شرائح رفيعة.\n
◾️ 2 فص ثوم مهروس.\n
◾️ 3 ملاعق كبيرة (45 مل) زيت زيتون.\n
◾️ ملعقة كبيرة (15 مل) عصير ليمون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كمون مطحون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بابريكا.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) فلفل أحمر حار بودرة.\n
◾️ ملح وفلفل أسود.
''';
  static const String mainDishe25 = '''
◾️ ½ كيلو (500 جم) لحم ضأن مقطع مكعبات صغيرة.\n
◾️ ½ كيلو (500 جم) دهن "لية" ضأن مقطع مكعبات صغيرة.\n
◾️ ثمرة بصل مفرومة ناعمًا.\n
◾️ ½ 1 ملعقة صغيرة (7.5 جم) حبهان "هيل" مطحون.\n
◾️ ½ 1 ملعقة صغيرة (7.5 جم) قرفة مطحونة.\n
◾️ ملعقة صغيرة (5 جم) فلفل أسود.\n
◾️ ملح حسب الرغبة.\n
◾️ قرن فلفل حار "اختياري".
''';
  static const String mainDishe26 = '''
◾️ لمرق اللحم:\n
◾️ كيلو (1000 جم) لحم مقطع مكعبات كبيرة.\n
◾️ 5 أكواب (1250 مل) ماء.\n
◾️ ثمرة بصل متوسطة الحجم مقطعة أرباعًا.\n
◾️ ½ كوب (100 جم) طماطم مقطعة مكعبات.\n
◾️ 3 فصوص ثوم.\n
◾️ ملعقة صغيرة (5 جم) كمون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) فلفل أسود.\n
◾️ 2 ورق لورا "غار".\n
◾️ عود قرفة.\n
◾️ حبة لومي أسود.\n
◾️ 4 رؤوس حبهان "هيل".\n
◾️ ملح حسب الرغبة.\n
للعجين:\n
◾️ ½ 2 كوب (375 جم) دقيق قمح كامل.\n
◾️ ¾ 1 كوب (437.5 مل) ماء دافئ.\n
◾️ رشة ملح.
''';
  static const String mainDishe27 = '''
◾️ ½ كيلو (500 جم) لحم مسلوق مقطع مكعبات متوسطة الحجم.\n
◾️ 2 ملعقة كبيرة (25 جم) زبد أو سمن.\n
◾️ 3 ملاعق كبيرة (30 جم) دقيق لوز.\n
◾️ كوب (250 مل) مرق لحم.\n
◾️ 2 كوب (400 جم) رمان.\n
◾️ ½ كوب (100 جم) زبيب.\n
◾️ ½ 1 ملعقة صغيرة (7.5 جم) كزبرة مطحونة.\n
◾️ ملعقة صغيرة (5 جم) قرفة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ثوم بودرة.\n
◾️ ملح وفلفل أسود حسب الرغبة.\n
◾️ ملعقة صغيرة (5 مل) خل تفاح.\n
◾️ ½ ملعقة صغيرة (2.5 مل) ماء ورد "اختياري".
''';
  static const String mainDishe28 = '''
◾️ ½ كيلو (500 جم) صدور دجاج مقطعة مكعبات صغيرة.\n
◾️ ¼ كوب (37.5 جم) دقيق متعدد الاستخدامات.\n
◾️ ¼ كوب (37.5 جم) نشا.\n
◾️ بيضة مخفوقة.\n
◾️ ملح وفلفل أسود.\n
الصوص:\n
◾️ ½ كوب (125 مل) ماء.\n
◾️ ¾ كوب (187.5 مل) مرق دجاج.\n
◾️ بصلة خضراء مقطعة شرائح (الجزء الأخضر فقط).\n
◾️ بصلة كبيرة مقطعة مكعبات.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت.\n
◾️ ملعقة كبيرة (12.5 جم) ثوم مفروم.\n
◾️ 2 ملعقة كبيرة (30 مل) صوص صويا.\n
◾️ 2 ملعقة كبيرة (20 جم) نشا.\n
◾️ ملعقة كبيرة (15 مل) صوص فلفل حار.\n
◾️ ملعقة صغيرة (5 جم) زنجبيل طازج مفروم.\n
◾️ 2 ثمرة فلفل أخضر حار مقطعة شرائح.\n
''';
  static const String mainDishe29 = '''
◾️ 3 أكواب (600 جم) لحم ضأن مقطع شرائح رفيعة.\n
◾️ 3 فصوص ثوم مفروم.\n
◾️ ¼ كوب (60 مل) عصير ليمون.\n
◾️ 2 ملعقة صغيرة (10 جم) كمون.\n
◾️ ملعقة صغيرة (5 جم) رقائق فلفل أحمر.\n
◾️ ملعقة صغيرة (5 جم) كزبرة مطحونة.\n
◾️ ملعقة صغيرة (5 جم) زعتر مجفف.\n
◾️ ملعقة صغيرة (5 جم) بابريكا.\n
◾️ ½ ملعقة صغيرة (2.5 جم) فلفل أسود.\n
◾️ 2 ملعقة صغيرة (10 جم) ملح.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت زيتون.\n
◾️ كوب (200 جم) فلفل رومي أحمر مقطع شرائح.\n
◾️ كوب (200 جم) فلفل رومي أخضر مقطع شرائح.\n
◾️ كوب (200 جم) فلفل رومي أصفر مقطع شرائح.\n
◾️ كوب (200 جم) بصل أحمر مقطع شرائح.\n
◾️ ملعقة كبيرة (12.5 جم) كزبرة طازجة مفرومة.
''';
  static const String mainDishe30 = '''
◾️ ½ 1 كيلو (1500 جم) سلق.\n
◾️ ½ كيلو (500 جم) أرز مصري.\n
◾️ ¼ كيلو (250 جم) لحم مفروم.\n
◾️ ½ كوب (100 جم) دهن لحم "لية" مفروم.\n
◾️ كوب (200 جم) بصل مفروم.\n
◾️ 2 فص ثوم مفروم.\n
◾️ 3 ملاعق كبيرة (37.5 جم) معجون طماطم.\n
◾️ ملعقة كبيرة (10 جم) نعناع مجفف مطحون.\n
◾️ ملعقة صغيرة (5 جم) كركم.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كاري.\n
◾️ ملعقة صغيرة (5 جم) سبع بهارات.\n
◾️ ملعقة صغيرة (5 جم) كمون.\n
◾️ ملعقة صغيرة (5 جم) فلفل أسود.\n
◾️ ملعقة صغيرة (5 جم) بابريكا.\n
◾️ ملح حسب الرغبة.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت ذرة.\n
◾️ 2 كوب (500 مل) ماء.\n
◾️ ¼ كوب (60 مل) عصير ليمون.\n
◾️ رأس ثوم كاملة مقطعة حلقات.\n
◾️ ¼ كوب (60 مل) زيت زيتون.
''';

  ////////////////////// == Desserts == /////////////////////
  static const String dessert1 = '''
القاعدة:\n
◾️ 2 كوب (400 جم) بسكويت أوريو مطحون.\n
◾️ 4 ملاعق كبيرة (50 جم) زبد مذاب. \n
الحشو: \n
◾️ ½ 2 (500 جم) جبن كريمي. \n
◾️ كوب (200 جم) سكر. \n
◾️ 3 ملاعق كبيرة (30 جم) كاكاو. \n
◾️ كوب (250 جم) كريمة حامضة. \n
◾️ ¼ كوب (62.5 مل) لبن رائب. \n
◾️ ملعقة كبيرة (15 مل) خل. \n
◾️ ملعقة صغيرة (5 جم) فانيليا. \n
◾️ لون طعام أحمر. \n
طبقة الكريمة المخفوقة بالجبن: \n
◾️ ¾ كوب (187.5 مل) كريمة خفق سائلة. \n
◾️ ½ كوب (100 جم) جبن كريمي. \n
◾️ ¼ كوب (37.5 جم) سكر مطحون.
''';
  static const String dessert2 = '''
مقادير كيكة التمر بالتوفي:\n
◾️ 2 كوب (400 جم) تمر منزوع النوى.\n
◾️ 2 كوب (480 مل) شاي.\n
◾️ ¼ 1 كوب (250 جم) سكر بني.\n
◾️ 2 ملعقة كبيرة (25 جم) عسل نحل.\n
◾️  4 بيضات.\n
◾️ كوب (200 جم) زبد غير مملح ذائب.\n
◾️ 3 ملاعق صغيرة (15 جم) بهارات مشكلة.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.\n
◾️ ¾ 2 كوب (350 جم) دقيق كيك.\n
◾️ 2 ملعقة صغيرة (10 جم) بيكنج صودا.\n
◾️ رشة ملح.\n
لصوص التوفي:\nn
◾️ ¾ كوب (150 جم) سكر بني.\n
◾️ 2 ملعقة كبيرة (30 جم) زبد.\n
◾️ 2 ملعقة كبيرة (25 جم) عسل نحل.\n
◾️ ½ ملعقة صغيرة (2.5 جم) فانيليا.\n
◾️ رشة ملح.\n
◾️ ½ كوب (125 مل) كريمة سائلة.
''';
  static const String dessert3 = '''
◾️ ½ كوب (125 مل) حليب.\n
◾️ 2 ملعقة كبيرة (30 مل) خل.\n
◾️ ¾ كوب (150 جم) سكر.\n
◾️ ¾ كوب (187.5 مل) زيت ذرة.\n
◾️ 2 كوب (260 جم) دقيق متعدد الاستعمالات.\n
◾️ ⅓ كوب (43 جم) كاكاو غير محلى.\n
◾️ ملعقة صغيرة (5 جم) بيكنج بودر.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بيكنج صودا.\n
◾️ كوب (250 مل) ماء دافئ.
''';
  static const String dessert4 = '''
◾️ 3 أكواب (390 جم) دقيق قمح كامل.\n
◾️ ½ 2 كوب (625 مل) ماء فاتر.\n
◾️ ½ كوب (170 جم) عسل.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ملح.\n
◾️ ½ كوب (113 جم) سمن ذائب وبارد.\n
◾️ 20 ثمرة تمر سكري منزوعة النوى.
''';
  static const String dessert5 = '''
◾️ ½ كيلو (500 جم) سميد.\n 
◾️ كوب (240 مل) عصير مانجو.\n
◾️ كوب زبادي.\n
◾️ ½ كوب (113 جم) سمن.\n
◾️ ½ كوب (100 جم) جوز هند.\n
◾️ ½ كوب (100 جم) سكر أبيض.\n
◾️ ملعقة كبيرة (10 جم) بيكنج باودر.\n
◾️ ملعقة كبيرة (10 جم) عسل أبيض.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.\n
◾️ قطر (شربات).\n
◾️ قطع مانجو للتزيين.
''';
  static const String dessert6 = '''
◾️ ¼ كوب (50 جم) سكر.\n
◾️ ¼ كوب (60 مل) زيت.\n
◾️ بيضة.\n
◾️ ½ كوب (60 جم) دقيق.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بيكنج بودر.\n
◾️ 3 ملاعق كبيرة (45 مل) حليب.\n
◾️ ½ ملعقة صغيرة (2.5 جم) فانيليا.\n
◾️ 2 ملعقة كبيرة (25 جم) فواكه مسكرة أو رقائق شوكولاتة.
''';
  static const String dessert7 = '''
◾️ كوب (130 جم) دقيق متعدد الاستخدامات.\n
◾️ كوب (112 جم) دقيق جوز الهند.\n
◾️ ¼ كيلو (250 جم) تمر مجدول أو نوع منزوع النوى.\n
◾️ ½ 1 ملعقة صغيرة (7.5 جم) بيكربونات صودا.\n
◾️ ¾ كوب (180 مل) ماء مغلي.\n
◾️ ½ كوب (125 جم) زيت جوز هند.\n
◾️ كوب (200 جم) سكر بني.\n
◾️ ⅓ كوب (113 جم) عسل أسود.\n
◾️ 4 بيضات.\n
◾️ ½ 1 ملعقة صغيرة (7.5 جم) فانيليا سائلة.\n
صوص التوفي:\n
◾️ ¾ كوب (180 مل) كريمة خفق سائلة.\n
◾️ ملعقة كبيرة (21 جم) عسل أسود.\n
◾️ ⅔ كوب (133 جم) سكر بني.\n
◾️ ¼ كوب (56.5 جم) زبد في درجة حرارة الغرفة.\n
◾️ ¼ كوب (17.75 جم) جوز هند مبشور للزينة.
''';
  static const String dessert8 = '''
◾️ ½ 1 (195 جم) دقيق.\n
◾️ ½ كوب (120 مل) زيت نباتي.\n
◾️ كوب (200 جم) زبادي.\n
◾️ ½ كوب (100 جم) سكر.\n
◾️ 3 بيضات.\n
◾️ ملعقة كبيرة (10 جم) بيكنج باودر.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.\n
◾️ ملح.\n
للتزيين:\n
◾️ علبة حليب مكثف.\n
◾️ ½ كوب (60 جم) سميد محمص.
''';
  static const String dessert9 = '''
◾️ ½ كوب (60 جم) دقيق.\n
◾️ ½ كوب (60 جم) نشا ذرة.\n
◾️ 7 ملاعق كبيرة (87.5 جم) زبد.\n
◾️ ½ كوب (100 جم) جبن.\n
◾️ ½ كوب (130 مل) حليب.\n
◾️ 8 صفار بيض.\n
◾️ 13 بياض بيض كبير الحجم.\n
◾️ ⅔ كوب (130 جم) سكر.\n
◾️ ماء ساخن للخبز.\n
◾️ سكر بودرة للتقديم.\n
◾️ فراولة للتقديم.
''';
  static const String dessert10 = '''
◾️ ½ 1 كوب (195 جم) بسكويت سادة مطحون ناعمًا.\n
◾️ 6 ملاعق كبيرة (75 جم) زبد.\n
◾️ ¼ كوب (50 جم) + 2 ملعقة كبيرة (20 جم) سكر.\n
◾️ كوب (226 جم) جبن كريمي.\n
◾️ ½ كوب (100 مل) كريمة مخفوقة.\n
◾️ 2 ملعقة كبيرة (30 مل) عصير ليمون.\n
◾️ صوص فراولة.
''';
  static const String dessert11 = '''
◾️ 2 كوب (200 جم) بسكويت مطحون.\n
◾️ ⅓ كوب (75 جم) زبد ذائب.\n
◾️ ملعقة كبيرة (12.5 جم) سكر.\n
الحشو:\n
◾️ كوب (170 جم) رقائق شوكولاتة.\n
◾️ 2 كوب (500 مل) كريمة خفق سائلة.\n
◾️ 4 ملاعق كبيرة (30 جم) نشا.\n
◾️ ½ 1 ملعقة صغيرة (3.75 جم) قهوة سريعة الذوبان.\n
◾️ ⅛ كيلو (125 جم) جوز (عين جمل) أو بيكان.
''';
  static const String dessert12 = '''
◾️ ½ كوب (125 مل) كريمة سائلة باردة.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) سكر ستيفيا أو أي نوع سكر دايت.\n
◾️ كوب (200 جم) فراولة أو توت مجمد.
''';
  static const String dessert13 = '''
◾️ 24 قطعة بسكويت مطحونة.\n
◾️ ½ كوب (113 جم) زبد مذاب.\n
◾️ كوب (200 جم) جبن كريمي.\n
◾️ 2 ظرف جيلي مانجو.\n
◾️ كوب (200 جم) كريمة خفق.\n
◾️ كوب (200 جم) قطع مانجو مثلجة.\n
◾️ ملعقة صغيرة (5 جم) جيلاتين.\n
طبقة الوجه:\n
◾️ 3 أكواب (600 جم) قطع مانجو مثلجة.\n
◾️ 3 ملاعق كبيرة (30 جم) سكر.\n
◾️ ملعقة كبيرة (10 جم) جيلاتين.
''';
  static const String dessert14 = '''
◾️ كوب (130 جم) سميد ناعم.\n
◾️ كوب (120 جم) حليب بودرة.\n
◾️ كوب (130 جم) دقيق متعدد الاستعمالات.\n
◾️ 4 بيضات.\n
◾️ كوب (200 جم) سكر.\n
◾️ كوب (200 جم) جوز هند مبشور.\n
◾️ ½ كوب (113 جم) زبد ذائب.\n
◾️ ¼ كوب (60 مل) زيت ذرة.\n
◾️ ½ كوب (100 جم) زبادي.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.\n
◾️ 2 ملعقة صغيرة (10 جم) بيكنج بودر.\n
◾️ رشة ملح.\n
◾️ 5 ملاعق كبيرة (75 مل) حليب مكثف مُحلى.
''';
  static const String dessert15 = '''
◾️ ثمرة موز ناضجة مقشرة.\n
◾️ كوب (100 جم) شوفان.\n
◾️ 2 ملعقة كبيرة (25 جم) عسل نحل.\n
◾️ ملعقة كبيرة (15 مل) زيت جوز هند.\n
◾️ ¼ كوب (50 جم) رقائق شوكولاتة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ملح.
''';
  static const String dessert16 = '''
◾️ علبة قشطة.\n
◾️ كوب ونصف سميد.\n
◾️ نصف كوب سكر.\n
◾️ 1 كوب لبن.\n
◾️ نصف كوب زيت نباتي.\n
◾️ 3 ملعقة كبيرة جوز الهند، مبشور ومجفف.\n
◾️ 1 ملعقة كبيرة بايكنغ باودر.\n
◾️ 1 1/2 كوب ماء.\n
◾️ 2 ملعقة كبيرة ماء الزهر لوز مقطع إلى نصفين.\n
◾️ 1 1/3 كوب سكر.
''';
  static const String dessert17 = '''
◾️ ½ 3 أكواب (455 جم) دقيق لجميع الأغراض.\n
◾️ ½ كوب (120 مل) حليب كامل الدسم.\n
◾️ ½ كوب (100 جم) سكر حبيبي.\n
◾️ ½ 2 ملعقة صغيرة (12.5 جم) خميرة جافة.\n
◾️ 2 ملعقة صغيرة (10 جم) ملح كوشير.\n
◾️ 3 بيضات.\n
◾️ 7 ملاعق كبيرة (87.5 جم) زبد غير مملح، مُقطع ثمان قطع.\n
◾️ زيت كانولا للقلي.\n
◾️ كوب سكر حبيبي للتزيين.\n
كريمة الكاسترد:\n
◾️ كوب (120 جم) دقيق كيك.\n
◾️ ½ 1 كوب (360 مل) حليب كامل الدسم ساخن.\n
◾️ ½ كوب (100 جم) سكر حبيبي.\n
◾️ ½ ملعقة صغيرة ملح كوشير.\n
◾️ 4 صفار بيض.\n
◾️ ملعقة صغيرة فانيليا.\n
◾️ 6 ملاعق كبيرة (75 جم) كريمة خفق.
''';
  static const String dessert18 = '''
◾️ 2 كوب (300 جم) دقيق.\n
◾️ ½ كوب (125مل) حليب سائل.\n
◾️ ¼ كوب (50 جم) زبد مذاب.\n
◾️ 4 ملاعق كبيرة (40 جم) سكر.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.\n
◾️ ملعقة صغيرة (5 جم) خميرة فورية.\n
◾️ زيت نباتي للقلي.
''';
  static const String dessert19 = '''
◾️ ½ 1 كوب دقيق\n
◾️ كوب سكر\n
◾️ ½ كوب زبد طري\n
◾️ ½ كوب حليب\n
◾️ 2 بيضة\n
◾️ ملعقة صغيرة بكينج باودر\n
◾️ ملعقة كبيرة فانيليا سائلة\n
◾️ ¼ ملعقة صغيرة قرفة
''';
  static const String dessert20 = '''
لطبقة البسكويت:\n
◾️ 2 كوب (300 جم) بسكويت دايجستيف مطحون.\n
◾️ ½ كوب (100 جم) زبد ذائب.\n
◾️ ملعقة كبيرة (10 جم) سكر بودرة.\n
لطبقة اللبنية:\n
◾️ 2 كوب (300 جم) حليب بودرة.\n
◾️ ½ كوب (100 جم) سكر.\n
◾️ ½ كوب (125 مل) حليب رائب.\n
◾️ ½ كوب (100 جم) زبادي.\n
◾️ ¾ كوب (150 جم) قشدة.\n
◾️ 2 ملعقة كبيرة (25 جم) زبد بدرجة حرارة الغرفة.\n
◾️ ملعقة صغيرة (5 جم) قرفة.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.\n
◾️ ⅓ كوب (66.6 جم) صوص كراميل.\n
◾️ ¼ كوب (50 جم) لوز مقشر محمص.
''';
  static const String dessert21 = '''
◾️ كوب (200 جم) شوفان.\n
◾️ ½ كوب (125 مل) حليب لوز.\n
◾️ ثمرة موز مهروسة.\n
◾️ ثمرة موز مقطعة شرائح.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.\n
◾️ ملعقة صغيرة (5 جم) بيكنج باودر.\n
◾️ ملح.
''';
  static const String dessert22 = '''
◾️ ½ 2 كوب (325 جم) سميد ناعم.\n
◾️ ½ 1 كوب (195 جم) دقيق متعدد الاستخدامات.\n
◾️ ¼ 1 كوب (250 جم) سمن بدرجة حرارة الغرفة.\n
◾️ ملعقة صغيرة (5 جم) محلب.\n
◾️ ½ كوب (125 مل) ماء ورد.\n
◾️ ½ كوب (100 جم) سكر\n
◾️ 2 ملعقة كبيرة (30 مل) شراب سكر "قطر" ثقيل بارد.\n
لمقادير الحشوة:\n
◾️ ¼ كيلو (250 جم) معجون تمر "عجوة".\n
◾️ كوب (200 جم) عين جمل أو فستق مجروش.\n
◾️ ملعقة صغيرة (5 جم) محلب أو حبهان مطحون.\n
◾️ ملعقة كبيرة (12.5 جم) سمن.
''';
  static const String dessert23 = '''
◾️ ½ كيلو (500 جم) عجوة.\n
◾️ كوب (200 جم) زبد في درجة حرارة الغرفة.\n
◾️ ½ كوب (200 جم) قشطة.\n
◾️ ملعقة صغيرة (5 جم) قرفة مطحونة.\n
◾️ 2 كوب (400 جم) بسكويت سادة مطحون.\n
◾️ كوب (200 جم) بسكويت كاكاو مطحون.\n
◾️ كوب (200 جم) بسكويت أوريو مطحون.
''';
  static const String dessert24 = '''
◾️ ½ 1 كوب (102 جم) حليب مجفف.\n
◾️ ½ 1 كوب (270 جم) سميد.\n
◾️ ¾ كوب (229.5 جم) حليب مكثف ومحلى.\n
◾️ ¾ كوب (172.5 جم) قشدة.\n
◾️ 2 ملعقة كبيرة (12.5 جم) كاكاو غير محلى.\n
◾️ ½ كوب (148 جم) نوتيلا.
''';
  static const String dessert25 = '''
◾️ ¼ 2 كوب (335 جم) دقيق متعدد الاستعمالات.\n
◾️ رشة ملح.\n
◾️ رشة فانيليا.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) خميرة.\n
◾️ ½ كوب (125 مل) ماء دافئ.\n
◾️ 3 ملاعق كبيرة (45 مل) زيت.\n
◾️ 2 ملعقة كبيرة (25 جم) سمن في درجة حرارة الغرفة.\n
◾️ 2 ملعقة صغيرة (10 جم) سكر.\n
◾️ ½ 1 كوب (375 مل) شراب سكر "شربات".\n
◾️ زيت غزير للقلي.
''';
  static const String dessert26 = '''
◾️ كوب (130 جم) سميد ناعم.\n
◾️ كوب (200 جم) تمر مفروم.\n
◾️ كوب (240 مل) ماء.\n
◾️ ½ كوب (100 جم) سكر.\n
◾️ ½ كوب (120 جم) زيت نباتي.\n
◾️ ملعقة كبيرة (10 جم) بيكنج بودر.\n
◾️ 3 ملاعق كبيرة حليب بودرة.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.\n
◾️ كوب (200 جم) حليب مكثف.\n
◾️ 2 ملعقة كبيرة قرفة مطحونة.
''';
  static const String dessert27 = '''
◾️ كوب (150 جم) دقيق.\n
◾️ كوب (250 مل) حليب سائل.\n
◾️ بيضة.\n
◾️ ملح.\n
◾️ كوب (200 جم) قطع براونيز مفتتة.\n
لعمل صوص الشوكولاتة:\n
◾️ ¾ كوب (112.5 جم) كاكاو خام.\n
◾️ ½ 1 كوب (375 مل) حليب سائل.\n
◾️ كوب (200 جم) سكر.\n
◾️ ملعقة كبيرة (10 جم) دقيق.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.\n
◾️ ملح.
''';
  static const String dessert28 = '''
طبقة البسكويت:\n
◾️ ¼ 2 كوب (225 جم) بسكويت مطحون.\n
◾️ ⅔ كوب (150 جرام) زبد ذائب.\n
◾️ ⅓ كوب (66.5 جرام) سكر.\n
طبقة الشوكولاتة والمارشميللو:\n
◾️ ¼ 2 كوب (292.5 جم) دقيق متعدد الاستخدامات.\n
◾️ 3 أكواب صغيرة (150 جم) مارشميللو.\n
◾️ كوب (170 جم) رقائق شوكولاتة.\n
◾️ كوب (226 جم) زبد في درجة حرارة الغرفة.\n
◾️ ¾ كوب (150 جم) سكر.\n
◾️ ¾ كوب (150 جم) سكر بني.\n
◾️ 2 بيضة.\n
◾️ ملعقة صغيرة (5 مل) فانيليا سائلة.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ملعقة صغيرة (5 جم) بيكربونات صودا.\n
◾️ 3 عبوات (بارات) شوكولاتة جالاكسي أو هيرشي (45 جم) مقطعة مربعات.
''';
  static const String dessert29 = '''
◾️ ½ 3 أكواب (875 مل) حليب كامل الدسم.\n
◾️ ½ كوب (125 مل) كريمة حلويات سائلة\n
◾️ 3 ملاعق كبيرة (30 جم) دقيق.\n
◾️ 2 ملعقة كبيرة (20 جم) نشا.\n
◾️ ½ كوب (100 جم) سكر.\n
◾️ 2 ملعقة كبيرة (25 جم) نسكافية "قهوة سريعة الذوبان".\n
◾️ ملعقة صغيرة (5 جم) كاكاو خام.\n
◾️ ملعقة كبيرة (12.5 جم) زبد.
''';
  static const String dessert30 = '''
◾️ ¼ كوب (50 جم) رقائق شوكولاتة خام.\n
◾️ ¼ كوب (37.5 جم) كاكاو خام.\n
◾️ ¼ كوب (62.5 مل) كريمة خفق قليلة الدسم.\n
◾️ 2 كوب (400 جم) جبن كريمي قليل الدسم.\n
◾️ كوب (200 جم) توت أحمر (اختياري).\n
◾️ ½ كوب (100 جم) سكر استيفيا.\n
◾️ 2 بيضة في درجة حرارة الغرفة.\n
◾️ ¼ كوب (37.5 جم) نشا.\n
◾️ ملعقة صغيرة (5 مل) فانيليا سائلة.\n
◾️ شوكولاتة خام مبشورة.
''';

  //////////////////// == Sos == ///////////////////
  static const String sos1 = '''
◾️ ثمرة أفوكادو متوسطة الحجم.\n
◾️ ½ كوب (100 جم) كزبرة طازجة.\n
◾️ ملعقة كبيرة (15 مل) زيت.\n
◾️ فص ثوم مهروس.\n
◾️ 3 ملاعق كبيرة (45 مل) ماء.\n
◾️ ½ 1 ملعقة كبيرة (22.5 مل) عصير ليمون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كمون مطحون.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) ملح.\n
◾️ رشة بودرة فلفل حار.\n
◾️ رشة فلفل أسود مطحون.
''';
  static const String sos2 = '''
◾️ كوب (200 جم) جبن شيدر مبشور.\n
◾️ 2 كوب (500 مل) حليب سائل.\n
◾️ ¼ كوب (37.5 جم) دقيق.\n
◾️ ¼ كوب (50 جم) زبد.\n
◾️ ملح وفلفل أسود.
''';
  static const String sos3 = '''
◾️ كوب (200 جم) زبادي يوناني.\n
◾️ ½ كوب (100 جم) كزبرة خضراء طازجة مفرومة.\n
◾️ 2 ملعقة كبيرة عصير ليمون.\n
◾️ 2 فص ثوم مهروس.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) ملح.
''';
  static const String sos4 = '''
◾️ 3 علب زبادي.\n
◾️ حزمة كزبرة طازجة.\n
◾️ حزمة نعناع طازج.\n
◾️ 2 ثمرة فلفل أخضر.\n
◾️ ¼ كوب (62.5 مل) ماء.\n
◾️ ملعقة كبيرة (15 مل) عصير ليمون.\n
◾️ ملح.
''';
  static const String sos5 = '''
لصوص التشيلي التركي:\n
◾️ 6 قرون فلفل أحمر حار.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) كمون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كراوية مطحونة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ملح.\n
◾️ ½ 1 ملعقة كبيرة (22.5 مل) عصير ليمون.\n
◾️ ½ 1 ملعقة كبيرة (22.5 مل) زيت زيتون.\n
◾️ 2 فص ثوم مفروم.\n
◾️ ½ 1 ملعقة صغيرة (7.5 جم) معجون طماطم.\n
لصوص الزبادي التركي:\n
◾️ ½ كوب (100 جم) زبادي أو كريمة حامضة.\n
◾️ 2 ملعقة كبيرة (30 مل) عصير ليمون.\n
◾️ ملعقة كبيرة (12.5 جم) طحينة.\n
◾️ 3 فصوص ثوم مفرومة.\n
◾️ 2 ملعقة كبيرة (10 جم) شبت طازج مفروم.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) نعناع مجفف.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) ملح.
''';
  static const String sos6 = '''
◾️ ¼ كوب (60 م) طحينة.\n
◾️ ¼ كوب (60 مل) ماء.\n
◾️ 2 ملعقة كبيرة (30 مل) عصير ليمون.\n
◾️ ملعقة كبيرة (15 مل) زيت زيتون.\n
◾️ فص ثوم مفروم ناعمًا.\n
◾️ ملعقة صغيرة (5 جم) كركم.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كمون.\n
◾️ رشة بابريكا.\n
◾️ رشة فلفل أسود.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) ملح.
''';
  static const String sos7 = '''
◾️ 2 كوب (400 جم) مايونيز.\n
◾️ ⅓ كوب (66.5 جم) حبق (ريحان).\n
◾️ فص ثوم.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت زيتون أو زيت نباتي.\n
◾️ 2 ملعقة كبيرة (30 مل) عصير ليمون.\n
◾️ ملعقة صغيرة (5 جم) بشر ليمون.
''';
  static const String sos8 = '''
◾️ ¾ كوب (150 جم) فلفل هالبينو أحمر، أو أي نوع فلفل أحمر حار متوفر.\n
◾️ 10 فصوص ثوم مقشرة.\n
◾️ كوب (250 مل) خل أبيض.\n
◾️ ½ كوب (100 جم) سكر.\n
◾️ ملعقة صغيرة (5 جم) ملح.
''';
  static const String sos9 = '''
◾️ 2 ملعقة كبيرة (25 جم) زبد.\n
◾️ 2 ملعقة كبيرة (20 جم) دقيق.\n
◾️ كوب (250 مل) حليب كامل الدسم.\n
◾️ كوب (200 مل) جبن شيدر أحمر.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) ملح.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) فلفل أحمر حار.
''';
  static const String sos10 = '''
◾️ ¼ 1 كوب (310 مل) ماء بارد.\n
◾️ ¼ كوب (60 مل) صويا صوص.\n
◾️ 5 ملاعق كبيرة (62.5 جم) سكر بني.\n
◾️ فص ثوم كبير مهروس.\n
◾️ 1 – 2 ملعقة كبيرة (12.5 – 25 جم) عسل.\n
◾️ 2 ملعقة كبيرة (20 جم) نشا.\n
◾️ ½ ملعقة صغيرة (2.5 جم) زنجبيل مطحون.
''';
  static const String sos11 = '''
◾️ 2 ملعقة كبيرة (30 مل) زيت زيتون.\n
◾️ 4 ملاعق كبيرة (60 مل) عصير ليمون.\n
◾️ 2 ملعقة كبيرة (25 جم) سكر.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ثوم مفروم.\n
◾️ ملعقة كبيرة (12.5 جم) بصل أخضر مفروم.
''';
  static const String sos12 = '''
◾️ كوب (200 جم) فصوص ثوم مُقشر.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ 3 أكواب (750 مل) زيت كانولا.\n
◾️ ¼ كوب (62.5 مل) عصير ليمون.
''';
  static const String sos13 = '''
الوصفة الأولى\n
◾️ ¼ 1 كوب (250 جم) شوكولاتة بيضاء مقطعة قطعًا صغيرة.\n
◾️ ¾ كوب (180 مل) كريمة خفق سائلة.\n
◾️ ½ ملعقة صغيرة (2.5 مل) فانيليا.\n
الوصفة الثانية\n
◾️ كوب (240 مل) حليب.\n
◾️ كوب (240 مل) زيت.\n
◾️ كوب (120 جم) سكر بودرة.\n
◾️ كوب (120 جم) حليب بودرة.
''';
  static const String sos14 = '''
◾️ 2 كوب (400 جم) مايونيز.\n
◾️ ½ كوب (100 جم) كاتشب.\n
◾️ 3 ملاعق كبيرة (37.5 جم) سكر.\n
◾️ ملعقة كبيرة (10 جم) ثوم بودرة.\n
◾️ ملعقة كبيرة (10 جم) بابريكا.\n
◾️ ملعقة صغيرة (5 جم) بصل بودرة.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ½ ملعقة صغيرة (2.5 جم) شطة.\n
◾️ ملعقة صغيرة (5 مل) صلصة حارة.\n
◾️ ½ كوب (125 مل) ماء.
''';
  static const String sos15 = '''
◾️ 2 كوب (500 مل) حليب كامل الدسم.\n
◾️ ¾ كوب (150 جم) سكر.\n
◾️ 4 ملاعق كبيرة (50 جم) زبد مملح.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.
''';
  static const String sos16 = '''
◾️ ½ كوب (75 جم) من مسحوق الكاكاو غير المحلى.\n
◾️ كوب (150 جم) سكر بودرة.\n
◾️ ½ 1 ملعقة كبيرة (15 جم) دقيق.\n
◾️ ¼ 1كوب (315.5 مل) حليب.\n
◾️ 2 ملعقة كبيرة (25 جم) زبد.\n
◾️ ½ ملعقة صغيرة (2.5 جم) فانيليا.\n
◾️ ملح.
''';
  static const String sos17 = '''
◾️ كوب (200 جم) سكر.\n
◾️ كوب (240 مل) حليب ساخن.\n
◾️ ½ 1 ملعقة كبيرة (18.75 جم) زبدة.\n
◾️ ملعقة كبيرة (10 جم) نشا + 2 ملعقة كبيرة (30 مل) حليب.\n
◾️ رشة ملح "اختياري".
''';
  static const String sos18 = '''
◾️ كوب (200 جم) زبادي. (يُفضل الزبادي اليوناني)\n
◾️ 2 ملعقة كبيرة (30 مل) زيت زيتون.\n
◾️ فص ثوم صغير مهروس.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) من كل من (شبت مجفف، بقدونس، بودرة ثوم، فلفل أسود).\n
◾️ ½ ملعقة صغيرة (2.5 جم) من كل من (بودرة بصل، بودرة خردل).\n
◾️ ½ ملعقة صغيرة (2.5 جم) ملح.\n
◾️ 2 ملعقة صغيرة (10 جم) سكر.\n
◾️ ½ 1 ملعقة كبيرة (22.5 مل) عصير ليمون.
''';
  static const String sos19 = '''
◾️ كوب (150 جم) كاكاو خام\n
◾️ ½ كوب (75 جم) سكر بودرة\n
◾️ 2 كوب (500 مل) حليب\n
◾️ ¼ كوب (50 جم) رقائق الشوكولاتة\n
◾️ ملعقة كبيرة (12.5 جم) زبدة في درجة حرارة الغرفة\n
◾️ ½ 1 ملعقة كبيرة (15 جم) دقيق\n
◾️ ½ ملعقة صغيرة (2.5 مل) فانيليا سائلة\n
◾️ رشة ملح
''';
  static const String sos20 = '''
◾️ كوب مايونيز.\n
◾️ ½ كوب كريمة حامضة (ساور كريم).\n
◾️ ملعقة كبيرة شبت مقطع.\n
◾️ ملعقة كبيرة ثوم معمر.\n
◾️ ½ ملعقة صغيرة كزبرة جافة.\n
◾️ ¼ ملعقة صغيرة ثوم باودر.\n
◾️ ¼ ملعقة صغيرة بصل باودر.\n
◾️ ملح وفلفل أسود.
''';
  static const String sos21 = '''
تحتاجين لتحضير صلصة الكشري:\n
◾️ 2 بصلة متوسطة مفرومة ناعم.\n
◾️ 5 فصوص ثوم مهروس.\n
◾️ 6 ثمرات طماطم كبيرة مقشرة ومفرومة.\n
◾️ 4 ملاعق كبيرة خل (حسب الرغبة).\n
◾️ 2 ملعقة كبيرة زيت.\n
◾️ ملعقة كبيرة صلصة طماطم (حسب الرغبة).\n
◾️ ملعقة صغيرة فلفل حار باودر (حسب الرغبة).\n
◾️ ملح وفلفل أسود.
''';
  static const String sos22 = '''
◾️ كوب مايونيز\n
◾️ 5 ملاعق كبيرة كاتشب\n
◾️ 2 ملعقة كبيرة خل أبيض\n
◾️ ¼ ملعقة صغيرة بابريكا\n
◾️ ¼ كوب خيار مخلل مقطع قطع صغيرة\n
◾️ ¼ كوب فلفل أخضر مخلل مقطع قطع صغيرة\n
◾️ ملح وفلفل أسود
''';
  static const String sos23 = '''
◾️ كوب (240 مل) كريمة خفق سائلة\n
◾️ ½ 1 كوب (330 جم) جبن كريمي\n
◾️ ½ كوب (75 جم) سكر بودرة\n
◾️ ملعقة كبيرة (15 جم) قهوة إسبريسو\n
◾️ 2 ملعقة صغيرة (10 جم) كاكاو خام بودرة\n
◾️ ملعقة صغيرة (5 مل) فانيليا سائلة
''';
  static const String sos24 = '''
◾️ 2 ملعقة كبيرة (30 مل) صوص الصويا.\n
◾️ ملعقة كبيرة (15 مل) زيت السمسم.\n
◾️ ملعقة صغيرة (5 جم) حبوب السمسم.\n
◾️ رشة سكر.\n
◾️ رشة ملح.\n
◾️ رشة فلفل أسود.\n
◾️ رشة فلفل حار أو حسب الرغبة.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) ثوم مفروم.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) بصل أخضر مفروم.
''';
  static const String sos25 = '''
◾️ 2 ملعقة كبيرة (25 جم) كاتشب.\n
◾️ 3 ملاعق كبيرة (37.5 جم) مايونيز.\n
◾️ 2 ملعقة كبيرة (25 جم) صوص فلفل أحمر حلو أو حار.\n
◾️ ½ ملعقة كبيرة (7.5 مل) خل.
''';
  static const String sos26 = '''
◾️ 2 كوب (400 جم) مايونيز.\n
◾️ ½ كوب (100 جم) كاتشب.\n
◾️ 3 ملاعق كبيرة (37.5 جم) سكر.\n
◾️ ملعقة كبيرة (10 جم) ثوم بودرة.\n
◾️ ملعقة كبيرة (10 جم) بابريكا.\n
◾️ ملعقة صغيرة (5 جم) بصل بودرة.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ½ ملعقة صغيرة (2.5 جم) شطة.\n
◾️ ملعقة صغيرة (5 مل) صلصة حارة.\n
◾️ ½ كوب (125 مل) ماء.
''';
  static const String sos27 = '''
◾️ ¾ كوب (180 مل) ماء.\n
◾️ ½ كوب (100 جم) سكر أبيض.\n
◾️ ¼ كوب (60 مل) كريمة خفق سائلة.\n
◾️ 2 ملعقة كبيرة (25 جم) زبد، في درجة حرارة الغرفة.\n
◾️ 2 ملعقة كبيرة (20 جم) نشا.\n
◾️ 2 ملعقة صغيرة (10 مل) فانيليا سائلة.\n
◾️ رشة ملح.
''';
  static const String sos28 = '''
معجون الوسابي الحار:\n
◾️ 5 ملاعق صغيرة (25 جم) بودرة الوسابي.\n
◾️ 3 ملاعق صغيرة (15 مل) ماء بارد.\n
صوص الأفوكادو الأخضر:\n
◾️ ½ ثمرة أفوكادو مقشرة ومهروسة.\n
◾️ ¼ كوب (50 جم) زبادي يوناني.\n
◾️ ¼ كوب (50 جم) مايونيز.\n
◾️ ملعقة صغيرة (5 جم) بودرة الوسابي.\n
◾️ ½ ملعقة كبيرة (7.5 مل) عصير ليمون.\n
◾️ ½ ملعقة صغيرة (2.5 مل) ملح.
''';
  static const String sos29 = '''
◾️ ¼ 1 كوب (250 جم) مايونيز.\n
◾️ ¼ كوب (60 مل) ماء.\n
◾️ ملعقة كبيرة (12.5 جم) زبد ذائب.\n
◾️ ملعقة صغيرة (5 جم) صلصة طماطم.\n
◾️ ملعقة صغيرة (5 جم) سكر.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بابريكا.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ثوم بودرة.
''';
  static const String sos30 = '''
◾️ كوب سكر باودر.\n
◾️ 3 - 6 ملاعق كبيرة حليب.
''';

  //////////////// == Side Dishes == ////////////////
  static const String sideDishe1 = '''
◾️ عبوة إندومي (شعيرية سريعة التحضير) كبيرة.\n
◾️ ¼ كوب (50 جم) جبن شيدر.\n
◾️ ¼ كوب (50 جم) جبن موزاريلا.\n
◾️ ملح.
''';
  static const String sideDishe2 = '''
كرات اللحم:\n
◾️ ½ 1 كوب (350 جم) لحم مفروم.\n
◾️ ملعقة كبيرة (10 جم) دقيق.\n
◾️ ملعقة صغيرة (5 جم) فلفل أسود.\n
◾️ ملح حسب الرغبة.\n
◾️ رشة فلفل حار مطحون "إختياري"\n
◾️ 2 فص ثوم مهروس.\n
◾️ بصلة متوسطة مفرومة ناعمًا.\n
◾️ ملعقة كبيرة (10 جم) السبع بهارات.\n
المرق:\n
◾️ بصلة صغيرة مفرومة.\n
◾️ 4 حبات بطاطس مقطعة مكعبات.\n
◾️ ملعقة صغيرة بابريكا.\n
◾️ ملعقة صغيرة كاري.\n
◾️ فلفل أسود حسب الرغبة.\n
◾️ 2 ملعقة كبيرة معجون طماطم.\n
◾️ ماء ساخن.\n
◾️ بقدونس مفروم للتزيين.
''';
  static const String sideDishe3 = '''
◾️ ½ كيلو (500 جم) دجاج مسلوق ومخلي ومقطع شرائح رفيعة.\n
◾️ ½ كيلو (500 جم) بصل مقطع شرائح رفيعة.\n
◾️ ¼ كيلو (250 جم) عجين سمبوسك.\n
◾️ ⅓ كوب (83 مل) زيت زيتون.\n
◾️ 4 ملاعق كبيرة (40 جم) سماق.\n
◾️ ملح وفلفل أسود حسب الرغبة.\n
◾️ ½ كوب (100 جم) صنوبر.
''';
  static const String sideDishe4 = '''
◾️ 3 أكواب (270 جم) شوفان.\n
◾️ 2 ملعقة صغيرة (30 مل) زيت.\n
◾️ ½ كوب (100 جم) بصل مفروم.\n
◾️ ¼ كيلو (250 جم) صدر دجاج مخلي مقطع مكعبات صغيرة.\n
◾️ 5 أكواب (1250 مل) ماء ساخن.\n
◾️ 2 كوب (500 مل) حليب رائب.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ملعقة صغيرة (5 جم) كمون.\n
◾️ ملعقة صغيرة (5 جم) بهارات مشكلة.\n
لعمل التقلية "الكُشنة":\n
◾️ 2 ملعقة كبيرة (30 مل) زيت.\n
◾️ ½ كوب (100 جم) بصل.\n
◾️ 3 ملاعق كبيرة (37.5 جم) معجون طماطم.\n
◾️ ملعقة كبيرة (10 جم) ليمون أسود مطحون.\n
◾️ ملعقة كبيرة (10 جم) بهارات مشكلة.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) ملح.\n
◾️ ملعقة كبيرة (12.5 جم) زبد ذائب.
''';
  static const String sideDishe5 = '''
◾️ ½ 1 كوب (300 جم) أرز.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ملح.\n
◾️ ½ كوب (100 جم) جبن موزاريلا.\n
◾️ ½ كوب (100 جم) جبن شيدر.\n
◾️ ¼ كوب (50 جم) جبن كريمي.\n
◾️ 2 ملعقة كبيرة (10 جم) ريحان طازج مفروم.\n
◾️ ملعقة صغيرة (5 جم) ثوم مفروم.\n
◾️ ملعقة صغيرة (5 جم) فلفل أسود.\n
◾️ ⅔ كوب (100 جم) دقيق.\n
◾️ 2 بيضة.\n
◾️ ½ 1 كوب (300 جم) بقسماط ناعم.
''';
  static const String sideDishe6 = '''
◾️ ½ كيلو (500 جم) كفتة مشوية.\n
◾️ 10 ورقات جلاش. \n
◾️ كوب (200 جم) بصل مقطع مكعبات صغيرة.\n
◾️ ملعقة صغيرة (5 جم) سكر.\n
◾️ ملعقة كبيرة (12.5 جم) زبد.\n
◾️ ملعقة كبيرة (15 مل) زيت.\n
◾️ ملح وفلفل أسود حسب الرغبة.\n
◾️ كوب (200 جم) جبن موزاريلا مبشور.\n
◾️ ½ كوب (100 جم) سمن ذائب.\n
◾️ بيضة.\n
◾️ ملعقة كبيرة (15 مل) ماء.
''';
  static const String sideDishe7 = '''
◾️ 2 كوب (400 جم) أرز بسمتي.\n
◾️ كوب (250 مل) عصير برتقال.\n
◾️ 2 كوب (500 مل) مرق أو ماء.\n
◾️  2 ملعقة كبيرة (25 جم) زبد.\n
◾️ جزرة مبشورة.\n
◾️ مكعب مرقة.\n
◾️ 2 ملعقة كبيرة (20 جم) بشر برتقال.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كركم.\n
◾️  2 عود قرفة.\n
◾️  ورقة لورا.\n
◾️ ملح.\n
◾️ لوز أو كاجو مقلي للتزيين.
''';
  static const String sideDishe8 = '''
◾️ 7 شرائح خبز "توست".\n
◾️ 2 ملعقة كبيرة (25 جم) زبد مملح.\n
◾️ ¾ كوب (150 جم) سكر.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.\n
◾️ رشة صودا الخبز.
''';
  static const String sideDishe9 = '''
للحشو:\n
◾️ ½ كيلو (500 جم) جبن فيتا.\n
◾️ ½ حزمة (15 جم) بقدونس طازج مفروم.\n
◾️ كوب (200 جم) زبد ذائب.\n
لعجين الفطائر:\n
◾️ 10 أكواب (1300 جم) دقيق متعدد الاستعمالات.\n
◾️ ¼ 1 كوب (312.5 مل) حليب.\n
◾️ 6 بيضات.\n
◾️ 3 لترات (3000 مل) ماء ساخن.\n
◾️ 3 لترات (3000 مل) ماء بارد.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ملح.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت زيتون.\n
لدهن وجه الفطائر:\n
◾️ بيضة.\n
◾️ ¼ كوب (60 مل) زيت زيتون.\n
◾️ ½ كوب (100 جم) زبادي.
''';
  static const String sideDishe10 = '''
◾️ 2 كوب (300 جم) دقيق.\n
◾️ ⅔ كوب (166.6 مل) ماء.\n
◾️ ملح.
''';
  static const String sideDishe11 = '''
◾️ 8 ثمرات بطاطس مقطعة شرائح.\n
◾️ 2 كوب (500 مل) كريمة لباني.\n
◾️ 2 كوب (500 مل) حليب.\n
◾️ ½ كوب (100 جم) جبن مبشور (شيدر أو موزاريلا).\n
◾️ 2 فص ثوم مفروم ناعمًا.\n
◾️ ملح وفلفل أسود.
''';
  static const String sideDishe12 = '''
◾️ كيلو (1000 جم) بطاطس مقشرة ومقطعة حلقات.\n
◾️ ½ كيلو (500 جم) دجاج مفروم.\n
◾️ بصلة كبيرة مفرومة ناعمًا.\n
◾️ حزمة بقدونس صغيرة مفرومة.\n
◾️ بيضة كبيرة.\n
◾️ ½ كوب (100 جم) بقسماط ناعم.\n
◾️ 2 ملعقة كبيرة (28 جم) صلصة طماطم.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بهارات سبعة.\n
◾️ ملعقة صغيرة (5 جم) بابريكا.\n
◾️ ½ ملعقة صغيرة (2.5 جم) فلفل أحمر حار.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كركم.\n
◾️ ملح وفلفل أسود.\n
◾️ كوب (130 جم) دقيق.\n
◾️ 2 بيضة مخفوقة.\n
◾️ 2 كوب (200 جم) بقسماط خشن.
''';
  static const String sideDishe13 = '''
◾️ كيلو (250 جم) عجين سمبوسة جاهز.\n
◾️ ¼ كيلو (250 جم) لحم مفروم.\n
◾️ ¼ كوب (50 جم) بصل مفروم.\n
◾️ ½ ملعقة صغيرة (2.5 جم) سبع بهارات.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كاري.\n
◾️ ملح وفلفل أسود حسب الرغبة.\n
◾️ 2 كوب (500 مل) ماء ساخن.\n
◾️ مكعب مرق دجاج.\n
◾️ علبة (170 جم) قشطة.\n
◾️ 2 ملعقة كبيرة (25 جم) جبن كريمي.
''';
  static const String sideDishe14 = '''
◾️ ⅓ كيلو (330 جم) عجين سمبوسك جاهز.\n
◾️ ½ كيلو (500 جم) صدور دجاج مقطع مكعبات صغيرة (مفروم خشن).\n
◾️ ثمرة جزر صغيرة مقشرة ومبشورة.\n
◾️ بصلة صغيرة مفرومة ناعمًا.\n
◾️ فص ثوم مهروس.\n
◾️ ¾ كوب (150 جم) فلفل ملون مقطع مكعبات صغيرة.\n
◾️ ملعقة كبيرة (15 مل) زيت.\n
◾️ ¾ ملعقة صغيرة (3.75 جم) بابريكا.\n
◾️ ملح وفلفل أسود.\n
◾️ ¾ كوب (150 جم) جبن كريمي.\n
◾️ ¾ كوب (187.5 مل) كريمة طبخ أو حليب.\n
◾️ ¼ كوب (50 جم) جبن سائل.\n
◾️ ¼ كيلو (250 جم) جبن موتزاريلا مبشور.\n
◾️ رشة جوزة الطيب.
''';
  static const String sideDishe15 = '''
◾️ ¾ كيلو (750 جم) صدور دجاج مخلية ومنزوعة الجلد.\n
◾️ 5 أكواب (1250 مل) مرق دجاج.\n
◾️ ثمرة جزر كبيرة.\n
◾️ 2 ثمرة بصل متوسطة الحجم.\n
◾️ 2 ورق لورا "غار".\n
◾️ 2 ملعقة كبيرة (25 جم) زبد.\n
◾️ 2 فص ثوم مفروم.\n
◾️ 4 ملاعق كبيرة (60 مل) عصير ليمون.\n
◾️ ⅛ 1 كوب (225 جم) جبن كريمي.\n
◾️ ملح وفلفل أسود حسب الرغبة.\n
◾️ 3 أكواب (450 جم) دقيق متعدد الاستعمالات.\n
◾️ ٢ بيضة.\n
◾️ ½ 2 كوب (375 جم) بقسماط ناعم.\n
◾️ زيت للقلي.
''';
  static const String sideDishe16 = '''
للعجين:\n
◾️ ½ كيلو (500 جم) دقيق لكل الأغراض.\n
◾️ ½ ملعقة صغيرة (2.5 جم) سكر.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بيكنج بودر.\n
◾️ رشة ملح.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت نباتي.\n
◾️ ¼ 1 كوب (312.5 مل) ماء دافئ.\n
لحشوة اللحم:\n
◾️ ½ كيلو (500 جم) لحم ضأن مفروم.\n
◾️ كوب (200 جم) بصل مفروم ناعمًا.\n
◾️ 3 ملاعق كبيرة (37.5 جم) زبادي.\n
◾️ 2 ملعقة كبيرة (25 جم) طحينة.\n
◾️ ¼ كوب (60 مل) دبس رمان.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ملعقة صغيرة (5 جم) سبع بهارات.
''';
  static const String sideDishe17 = '''
◾️ 3 أكواب (750 مل) ماء دافئ.\n
◾️ كوب (130 جم) دقيق القمح الكامل.\n
◾️ 2 كوب (260 جم) دقيق أبيض متعدد الاستخدامات.\n
◾️ ملعقة كبيرة (10 جم) خميرة فورية.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) كزبرة جافة مطحونة.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) حلبة مطحونة.
''';
  static const String sideDishe18 = '''
◾️ علبة عجينة سبرينج رول جاهزة.\n
◾️ صدر دجاج مقطع شرائح.\n
◾️ كوب (200 جم) جزر مبشور.\n
◾️ كوب (200 جم) كرنب مفروم.\n
◾️ ¼ كوب (62.5 مل) صلصة صويا.\n
◾️ 4 حبات بصل أخضر مفروم.\n
◾️ ملعقة كبيرة (10 جم) دقيق.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت نباتي.\n
◾️ بصلة متوسطة مفروم.\n
◾️ ملعقة صغيرة (5 جم) زنجبيل طازج مبشور. \n
◾️ 2 فص ثوم مهروس.\n
◾️ ماء حسب الحاجة.\n
◾️ زيت للقلي.\n
◾️ ملح.
''';
  static const String sideDishe19 = '''
◾️ رغيف عجين كيش أو تارت.\n
◾️ 100 جم دجاج مقطع مكعبات.\n
◾️ 2 ملعقة كبيرة (25 جم) زبد.\n
◾️ بصلة مقطعة قطعًا صغيرة.\n
◾️ باقة سبانخ مغسولة ومقطعة.\n
◾️ ملح وفلفل حسب الرغبة.\n
◾️ 2 بيضة كبيرة الحجم.\n
◾️ كوب (200 جم) كريمة طهي سائلة.\n
◾️ ½ كوب (100 جم) جبن مبشور.
''';
  static const String sideDishe20 = '''
◾️ 6 حبات بصل.\n
◾️ ثمرة طماطم مُقطعة شرائح.\n
الحشو:\n
◾️ 150 جم لحم مفروم.\n
◾️ ½ كوب (100 جم) برغل.\n
◾️ 2 حبة بصل مفرومة ناعمًا.\n
◾️ 2 ثمرة طماطم مفرومة ناعمًا.\n
◾️ ملعقة كبيرة (15 مل) عصير ليمون.\n
◾️ 4 فصوص ثوم مفروم.\n
◾️ كوب (100 جم) من كل من(بقدونس مفروم، شبت مفروم)\n
◾️ نعناع طازج مفروم.\n
◾️ ملعقة صغيرة (5 جم) من (فلفل أسود مطحون، ملح، زعتر مجفف).\n
◾️ ½ ملعقة صغيرة كمون.\n
◾️ ملعقة كبيرة (12.5 جم) معجون فلفل أو معجون طماطم.\n
◾️ 3 ملاعق كبيرة زيت زيتون.
الصلصة:\n
◾️ ملعقة كبيرة زيت زيتون.\n
◾️ ملعقة كبيرة معجون طماطم.\n
◾️ ½ ملعقة صغيرة نعناع مجفف.\n
◾️ فص ثوم مفروم.\n
◾️ ½ كوب (125 مل) ماء.
''';
  static const String sideDishe21 = '''
◾️ ½ كيلو (500 جم) مكرونة أي نوع.\n
◾️ بصلة كبيرة مقطعة مكعبات صغيرة.\n
◾️ كوب (250 مل) ماء مغلي.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بهارات إيطالية.\n
◾️ ملعقة كبيرة (15 مل) زيت.\n
◾️ ½ ملعقة كبيرة (6.25 جم) زبد غير مملح.\n
◾️ ملح وفلفل أسود.\n
◾️ جبن بارميزان مبشور.
''';
  static const String sideDishe22 = '''
◾️ ½ كيلو (500 جم) بطاطس مقشرة.\n
◾️ ¼ كيلو (250 جم) كورن فليكس مجروش.\n
◾️ بيضة.\n
◾️ ¼ كوب (30 جم) دقيق متعدد الاستخدامات.\n
◾️ ¾ ملعقة صغيرة (3.75 جم) كمون مطحون.\n
◾️ 2 ملعقة كبيرة (25 جم) مايونيز أو زبادي.\n
◾️ ملح وفلفل أسود.
''';
  static const String sideDishe23 = '''
◾️ 2 علبة تونة (طون) مصفاة من الزيت.\n
◾️ كوب (200 جم) أرز أبيض مسلوق.\n
◾️ حبة بطاطس كبيرة مقطعة مكعبات صغيرة ومسلوقة.\n
◾️ 3 حبات بطاطس كبيرة مقشرة ومقطعة أصابع ومقلية.\n
◾️ ⅛ كيلو (125 جم) مرتديلا لحم مقطعة شرائح طولية رفيعة.\n
◾️ 3 بيضات مسلوقة مقطعة حلقات.\n
◾️ ½ كوب (100 جم) زيتون أخضر مقطع شرائح.\n
◾️ ثمرة خس مقطعة شرائح رفيعة.\n
◾️ 2 ثمرة طماطم متوسطة الحجم مقطعة مكعبات صغيرة.\n
◾️ بصلة متوسطة مقطعة مكعبات صغيرة.\n
◾️ 2 فص ثوم مهروسان.\n
◾️ ½ كوب (100 جم) خيار مخلل صغير مقطع شرائح طولية.\n
◾️ ¾ كوب (150 جم) مايونيز.\n
◾️ ¼ كوب (50 جم) كاتشب.\n
◾️ ثمرة جزر كبيرة مقشرة ومبشورة.\n
◾️ 2 ملعقة كبيرة (25 جم) خيار مخلل مقطع مكعبات صغيرة.\n
◾️ 2 ملعقة كبيرة (25 جم) بقدونس طازج مفروم.\n
◾️ ¼ كوب (60 مل) خل أبيض.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ 2 رغيف باجيت فرنسي.
''';
  static const String sideDishe24 = '''
لعمل العجين:\n
◾️ ½ 1 كوب (225 جم) دقيق لكل الأغراض.\n
◾️ ¾ كوب وملعقتان كبيرتان (175 جم) زبد بارد مقطع مكعبات صغيرة.\n
◾️ بيضة مخفوقة.\n
◾️ ملعقة كبيرة (15 مل) ماء بارد.\n
للحشو:\n
◾️ كوب (200 جم) بصل أبيض متوسط الحجم مقطع أرباعًا، ثم يقسم كل ربع نصفين.\n
◾️ كوب (200 جم) كوسا صغيرة الحجم مقسومة نصفين بالطول.\n
◾️ ¼ 1 كوب (250 جم) سبانخ.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت زيتون.\n
◾️ ¼ 1 كوب (300 مل) كريمة طبخ.\n
◾️ ¾ كوب (150 جم) جبن موزاريلا مبشور.\n
◾️ 4 بيضات كبيرة.\n
◾️ ملح وفلفل أسود حسب الرغبة.
''';
  static const String sideDishe25 = '''
◾️ ½ كيلو ( 500 جم) جمبرى مقشر ومغسول.\n
◾️ ½ كوب (100 جم) أرز مطحون.\n
◾️ بصلة كبيرة.\n
◾️ 3 فصوص ثوم.\n
◾️ حزمة بقدونس مفروم.\n
◾️ حزمة شبت مفروم.\n
◾️ حزمة كزبرة خضراء مفرومة.\n
◾️ ملعقة صغيرة (5 جم) كمون.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بابريكا.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كاري.\n
◾️ ½ ملعقة صغيرة (2.5 جم) شطة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كزبرة.\n
◾️ ملح وفلفل أسود.\n
◾️ زيت نباتي للقلي.
''';
  static const String sideDishe26 = '''
◾️ 2 كوب (260 جم) دقيق.\n
◾️ كوب (250 مل) حليب دافئ.\n
◾️ ½ كوب (120 مل) ماء دافئ.\n
◾️ ⅓ كوب (80 مل) زيت.\n
◾️ 2 ملعقة كبيرة (25 جم) سكر.\n
◾️ ملعقة صغيرة (5 جم) بيكنج باودر.\n
◾️ ملعقة صغيرة (5 جم) خميرة فورية.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ½ كوب (100 جم) جبن كريمي.\n
◾️ ½ كوب (100 جم) جبن سائل.\n
◾️ ½ كوب (100 جم) جبن موتزاريلا مبشور.\n
◾️ ½ كوب (100 جم) جبن شيدر مبشور.\n
◾️ ⅛ كيلو (125 جم) جبن فيتا مقطع مكعبات.\n
◾️ بيضة في درجة حرارة الغرفة.\n
◾️ حبة البركة.
''';
  static const String sideDishe27 = '''
◾️ ⅓ كيلو (333 جم) ورق عنب طازج.\n
◾️ 2 كوب (500 مل) ماء لسلق ورق العنب.\n
◾️ ½ 1 كوب (300 جم) أرز مصري مغسول ومصفى.\n
◾️ 3 حزم (60 جم) بقدونس طازج مفروم.\n
◾️ ½ حزمة (15 جم) نعناع طازج مفروم.\n
◾️ 2 كوب (400 جم) طماطم مفرومة.\n
◾️ كوب (200 جم) بصل مفروم ناعمًا.\n
◾️ ½ كوب (100 جم) بصل أخضر مفروم ناعمًا.\n
◾️ 6 ملاعق كبيرة (90 مل) زيت زيتون.\n
◾️ ½ كوب (125 مل) عصير ليمون.\n
◾️ 2 ملعقة كبيرة (20 جم) ملح.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بابريكا.\n
◾️ ½ ملعقة صغيرة (2.5 جم) فلفل أسود.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) شطة "اختياري".\n
◾️ ثمرة بطاطس متوسطة الحجم مقطعة شرائح.\n
◾️ ثمرة جزر كبيرة الحجم مقطعة شرائح.
''';
  static const String sideDishe28 = '''
العجين:\n
◾️ 4 أكواب (520 جم) دقيق متعدد الاستخدامات.\n
◾️ كوب (240 مل) حليب دافئ.\n
◾️ ¼ كوب (56.5 جم) زبد غير مملح ذائب وبارد.\n
◾️ 2 بيضة كبيرة.\n
◾️ ملعقة كبيرة (12.5 جم) خميرة فورية.\n
◾️ ملعقة كبيرة (12.5 جم) سكر.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
الحشو:\n
◾️ ½ كيلو (500 جم) جبن شيدر أو موتزاريلا مقطع مكعبات.\n
◾️ ¼ كوب (56.5 جم) زبد غير مملح ذائب وبارد.\n
◾️ ⅓ كوب (66.5 جم) كزبرة طازجة مفرومة.\n
◾️ 5 فصوص ثوم مهروسة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) فلفل أسود.
''';
  static const String sideDishe29 = '''
◾️ ½ كيلو (500 جم) بطاطس مقشرة.\n
◾️ ½ كيلو (500 جم) لحم مفروم.\n
◾️ ثمرة بصل متوسطة الحجم مفرومة ناعمًا.\n
◾️ ثمرة جزر صغيرة مقشرة، ومبشورة.\n
◾️ ¼ كوب (50 جم) بقدونس طازج مفروم.\n
◾️ ¼ كوب (56.5 جم) زبد في درجة حرارة الغرفة.\n
◾️ 2 ملعقة كبيرة (25 جم) زبد ذائب.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بهارات سبعة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كاري.\n
◾️ ملح وفلفل أسود.
''';
  static const String sideDishe30 = '''
◾️ 2 كوب (400 جم) أرز مغسول ومُصفى.\n
◾️ 500 جم ورق عنب مسلوق.\n
◾️ ملعقة كبيرة (12.5 جم) معجون فليفلة أو طماطم.\n
◾️ ملعقة كبيرة (10 جم) السبع بهارات.\n
◾️ ½ ملعقة صغيرة (كمون، بابريكا)\n
◾️ ملعقة صغيرة (5 جم) سماق.\n
◾️ ½ 1 ملعقة صغيرة ملح ليمون.\n
◾️ ملعقة كبيرة ملح.\n
◾️ ½ 1 ملعقة كبيرة سكر.\n
◾️ 4 فصوص ثوم مهروس.\n
◾️  ½ 1 ملعقة كبيرة دبس رمان.\n
◾️ 3 بصلات مفرومة.\n
◾️ كوب ( 250 مل) زيت.\n
◾️ 2 كوب (500 مل) ماء ساخن للتسوية + ملعقة كبيرة دبس رمان.\n
◾️ شرائح طماطم وجزر وليمون.
''';

  ////////////////// == Breakfast Dishes == //////////////////
  static const String breakfastDishe1 = '''
◾️ 2 ملعقة كبيرة (16.25 جم) دقيق متعدد الاستخدامات.\n
◾️ 6 ملاعق كبيرة (90 مل) ماء.\n
العجين:\n
◾️ ⅓ 2 كوب (303 جم) دقيق متعدد الاستخدامات.\n
◾️ 2 ملعقة صغيرة (6 جم) خميرة فورية.\n
◾️ ½ كوب (125 جم) حليب دافئ.\n
◾️ 2 بيضة في درجة حرارة الغرفة.\n
◾️ 3 ملاعق كبيرة (37.5 جم) سكر.\n
◾️ 2 ملعقة كبيرة (28 جم) زبد ذائب وبارد.\n
◾️ ملعقة صغيرة (5 جم) ملح.
''';
  static const String breakfastDishe2 = '''
◾️ كوب (130 جم) دقيق متعدد الاستخدامات.\n
◾️ ¼ 1 كوب (310 مل) حليب.\n
◾️ 3 بيضات كبيرة.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت أو زبد ذائب.\n
◾️ 2 ملعقة كبيرة (25 جم) سكر.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ملح.\n
◾️ 1 - 2 ملعقة كبيرة (14 - 28 جم) زبد ذائب لدهن المقلاة.\n
للزينة:\n
◾️ 1 - 2 ثمرة ليمون مقطعة شرائح.\n
◾️ ¼ كوب (30 جم) سكر بودرة.\n
◾️ كريمة مخفوقة.
''';
  static const String breakfastDishe3 = '''
◾️ 16 قطعة توست.\n
◾️ بيضتان مخفوقتان.\n
◾️ ½ كوب (100 جم) بقسماط ناعم.\n
◾️ كوب (200 جم) تونة.\n
◾️ ½ كوب (100 جم) ذرة.\n
◾️ ¼ كوب( 50 جم) فلفل ألوان مقطع مكعبات صغيرة.\n
◾️ 2 ملعقة صغيرة (25 جم) زيتون مخلي مقطع حلقات.\n
◾️ 3 ملاعق كبيرة (37.5 جم) مايونيز.\n
◾️ 3 ملاعق كبيرة (37.5 جم) زبادي.\n
◾️ ملعقة كبيرة (15 مل) عصير ليمون.\n
◾️ ملعقة صغيرة (5 جم) مستردة.\n
◾️ ملح وفلفل أسود حسب الرغبة.\n
◾️ ¼ كوب (50 جم) خس مقطع شرائح.
''';
  static const String breakfastDishe4 = '''
◾️ 4 أكواب (520 جم) دقيق لجميع الأغراض.\n
◾️ ½ كوب (120 مل) حليب دافئ كامل الدسم.\n
◾️ ½ 1 ملعقة صغيرة (7.5 جم) خميرة جافة.\n
◾️ ½ كوب (100 جم) سكر حبيبي.\n
◾️ ملعقة صغيرة (5 جم) ملح بحري.\n
◾️ ملعقة صغيرة فانيليا.\n
◾️ ملعقة صغيرة قشر ليمون مبشور.\n
◾️ ملعقة صغيرة جوزة الطيب مبشورة حديثًا.\n
◾️ 4 بيضات كبيرة.\n
◾️ 10 ملاعق كبيرة (125 جم) زبد غير مملح.\n
الحشو:\n
◾️ ½ كوب (100 جم) سكر حبيبي.\n
◾️ ¾ كوب (150 جم) كريمة خفق.\n
◾️ رشة ملح.\n
◾️ 170 جم شوكولاتة مُقطعة خشنًا.\n
◾️ 8 ملاعق كبيرة زبد غير مملح.\n
◾️ 2 ملعقة صغيرة فانيليا.\n
شوكولا ستريوسل:\n
◾️ ½ كوب دقيق لجميع الأغراض.\n
◾️ 3 ملاعق كبيرة سكر.\n
◾️ ½ 1 ملعقة كبيرة (15 جم) مسحوق كاكاو.\n
◾️ ½ ملعقة صغيرة ملح.\n
◾️ ½ 4 ملاعق كبيرة زبد غير مملح.\n
◾️ ⅓ كوب رقائق شوكولاتة صغيرة.\n
السيرب:\n
◾️ ½ كوب سكر حُبيبي.\n
◾️ ⅔ كوب (160 مل) ماء.
''';
  static const String breakfastDishe5 = '''
◾️ ¼ كيلو (250 جم) دقيق حمص.\n
◾️ 3 ملاعق كبيرة (45 مل) زيت نباتي.\n
◾️ ½ 1 لتر (1500 مل) ماء.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ملعقة صغيرة (5 جم) كمون.
''';
  static const String breakfastDishe6 = '''
◾️ 2 كوب (400 جم) فراولة مقطعة مكعبات صغيرة.\n
◾️ ½ كوب (125 مل) ماء.\n
◾️ 2 ملعقة كبيرة (25 جم) سكر استيفيا أو سكر دايت.\n
◾️ ملعقة كبيرة (10 جم) جيلاتين.\n
◾️ ملعقة كبيرة (15 مل) عصير ليمون.
''';
  static const String breakfastDishe7 = '''
◾️ 2 كوب (400 جم) حب رمان.\n
◾️ كوب (200 جم) سكر.\n
◾️ كوب (250 مل) ماء.\n
◾️ ملعقة كبيرة (15 مل) عصير ليمون.
''';
  static const String breakfastDishe8 = '''
◾️ 4 بيضات.\n
◾️ ¼ كوب (50 جم) كرفس طازج مفروم.\n
◾️ ملعقة كبيرة (15 مل) زيت نباتي.\n
◾️ رشة ملح.\n
◾️ رشة فلفل أسود.\n
◾️ رشة قرفة.\n
◾️ رشة زعفران.
''';
  static const String breakfastDishe9 = '''
◾️ 6 شرائح لحم مقدد.\n
◾️ ½ ثمرة أفوكادو مقطعة شرائح.\n
◾️ بيضة مسلوقة مقطعة شرائح.\n
◾️ خبز كيتو أو شرائح خس.
''';
  static const String breakfastDishe10 = '''
◾️ 3 أكواب (390 جم) سميد ناعم.\n
◾️ كوب (130 جم) دقيق.\n
◾️ 2 بيضة.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت.\n
◾️ 2 ملعقة كبيرة (20 جم) سكر.\n
◾️ ملعقة كبيرة (10 جم) خميرة فورية.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ½ 4 أكواب (1080 مل) ماء دافئ.\n
◾️ زبد.\n
◾️ سكر حبيبي.
''';
  static const String breakfastDishe11 = '''
◾️ خمس بيضات.\n
◾️ ملعقة كبيرة (10 جم) بصل مقطع قطعًا صغيرة.\n
◾️ ملعقة كبيرة (10 جم) جزر مقطع قطعًا صغيرة.\n
◾️ ملح وفلفل أسود.\n
◾️ زيت نباتي للقلي.
''';
  static const String breakfastDishe12 = '''
◾️ 2 كوب (400 جم) فول سوداني غير مملح.''';
  static const String breakfastDishe13 = '''
◾️ 2 كوب (282 جم) دقيق متعدد الاستخدامات.\n
◾️ 2 ملعقة صغيرة قرفة مطحونة.\n
◾️ ¼ ملعقة صغيرة من كل من (جوزة الطيب، زنجبيل، بهارات، قرنفل، صودا الخبز، بيكنج باودر).\n
◾️ ½ ملعقة صغيرة ملح.\n
◾️ كوب (225 جم) زبدة بدرجة حرارة الغرفة.\n
◾️ ½ كوب (115 جم) سكر.\n
◾️ ¼ كوب (42 جم) سكر بني.\n
◾️ ملعقة صغيرة (5 جم) فانيليا.
''';
  static const String breakfastDishe14 = '''
◾️ ½ كيلو (500 جم) دقيق.\n
◾️ ½ كوب (113 جم) سمن ذائب وبارد.\n
◾️ ½ كوب (100 جم) قشدة.\n
◾️ ½ 1 كوب (375 مل) لبن رائب فلاحي.\n
◾️ ½ كوب (125 مل) ماء دافئ.\n
◾️ 2 ملعقة كبيرة (25 جم) سمسم.\n
◾️ ملعقة كبيرة (12.5 جم) خميرة فورية.\n
◾️ ملعقة كبيرة (12.5 جم) سكر.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ملح.\n
الحشو:\n
◾️ ½ كيلو (500 جم) عجوة.\n
◾️ ½ كوب (113 جم) زبد غير مملح وذائب.\n
◾️ ملعقة كبيرة سمسم.
''';
  static const String breakfastDishe15 = '''
◾️ ½ كوب (60 جم) دقيق جوز الهند.\n
◾️ ¼ كوب (50 جم) بديل سكر.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بيكنج بودر.\n
◾️ ½ ملعقة صغيرة من الملح.\n
◾️ 6 بيضات.\n
◾️ ¼ كوب (60 مل) زيت جوز الهند أو زبد مذاب.\n
◾️ ¾ كوب (180 مل) حليب جوز الهند.\n
◾️ ملعقة صغيرة فانيليا "اختياري".
''';
  static const String breakfastDishe16 = '''
◾️ 8 بيضات كبيرة.\n
◾️ ½ كوب (125 مل) حليب.\n
◾️ كوب (90 جم) جبن شيدر مبشور.\n
◾️ كوب (150 جم) فلفل ملون أحمر وأخضر وأصفر.\n
◾️ ½ كوب (15 جم) سبانخ مقطعة قطع كبيرة.\n
◾️ 2 ثمرة بصل أخضر مقطعة شرائح رفيعة.\n
◾️ ملح وفلفل أسود.
''';
  static const String breakfastDishe17 = '''
◾️ ½ كوب (100 جم) + 2 ملعقة كبيرة (20 جم) سكر.\n
◾️ ¾ كوب (180 مل) + 4 ملاعق صغيرة (20 مل) زيت.\n
◾️ ¼ كوب ماء + ¼ كوب ماء زهر.\n
◾️ ملعقة كبيرة (15 جم) خميرة حلويات.\n
◾️ 3 ملاعق كبيرة (37.5 جم) عسل.\n
◾️ شمر ويانسون مطحون طحنًا خشنًا.\n
◾️ 4 أكواب (520 جم) دقيق أبيض منخول.\n
◾️ رشة ملح.\n
◾️ بيضة + رشة قهوة سريعة الذوبان للوجه.
''';
  static const String breakfastDishe18 = '''
◾️ 5 ثمرات بطاطس متوسطة الحجم مقشرة.\n
◾️ ¼ كوب (60 مل) خل أبيض.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كزبرة جافة مطحونة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بابريكا.\n
◾️ ½ ملعقة صغيرة (2.5 جم) ثوم بودرة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بصل بودرة.\n
◾️ ملح وفلفل أسود.
''';
  static const String breakfastDishe19 = '''
◾️ كيلو (1000 جم) فول.\n
◾️ 2 بصلة مقطعة مكعبات.\n
◾️ 6 فصوص ثوم مفرومة ناعمًا.\n
◾️ 2 ثمرة طماطم مفرومة.\n
◾️ 4 ملاعق كبيرة (60 مل) زيت.\n
◾️ ملعقة صغيرة (5 جم) زيت سمسم حسب الرغبة.\n
◾️ ملح وفلفل أسود.
''';
  static const String breakfastDishe20 = '''
◾️ ⅔ كوب (133.3 جم) كينوا مغسولة.\n
◾️ ½ 1 كوب (375 مل) حليب كامل أو منزوع الدسم أو حليب جوز هند.\n
◾️ 2 ملعقة صغيرة (10 جم) فانيليا.\n
◾️ 2 ملعقة صغيرة (10 جم) سكر.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) قرفة "اختياري".\n
◾️ ½  كوب (100 جم) فاكهة طازجة أو مجففة أو مكسرات.
''';
  static const String breakfastDishe21 = '''
◾️ 2 كوب (400 جم) فول مدمس.\n
◾️ ثمرة طماطم كبيرة.\n
◾️ 2 فص ثوم.\n
◾️ قرن فلفل أخضر حار.\n
◾️ ½ كوب (100 جم) بصل مفروم.\n
◾️ ملعقة كبيرة (12.5 جم) سمن.\n
◾️ ملعقة كبيرة (12.5 جم) معجون طماطم.\n
◾️ ملعقة صغيرة (5 جم) ملح.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كمون.\n
◾️ ¾ كوب (187.5 مل) ماء.
''';
  static const String breakfastDishe22 = '''
◾️ كوب (200 جم) فول صويا.\n
◾️ 2 معلقة كبيرة (30 مل) عصير ليمون أو خل تفاح.\n
◾️ ملح.\n
◾️ ماء.\n
◾️ حبة البركة حسب الرغبة.
''';
  static const String breakfastDishe23 = '''
◾️ 2 كوب (200 جرام) فول مدشوش (ينقع طيلة الليل).\n
◾️ ½ حزمة بقدونس.\n
◾️ ½ حزمة كزبرة خضراء.\n
◾️ بصلة كبيرة.\n
◾️ 4 أو 5 فصوص ثوم.\n
◾️ ملعقة صغيرة (5 جرامات) كزبرة جافة.\n
◾️ ملعقة صغيرة (5 جرامات) كمون.\n
◾️ ملعقة صغيرة (5 جرامات) ملح.\n
◾️ ملعقة صغيرة (5 جرامات) بيكربونات الصوديوم.\n
◾️ ملعقة كبيرة (15 حرامًا) سمسم "حسب الرغبة".\n
◾️ زيت غزير للقلي.
''';
  static const String breakfastDishe24 = '''
◾️ كوب (150 جم) دقيق\n
◾️ كوب (250 مل) حليب\n
◾️ بيضة كبيرة\n
◾️ 2 ملعقة كبيرة (25 جم) سكر\n
◾️ 2 ملعقة كبيرة (25 جم) زبدة مُذابة\n
◾️ 2 ملعقة صغيرة (10 جم) بيكنج باودر\n
◾️ رشة ملح\n
للزينة\n
◾️ شراب القيقب، والفاكهة الطازجة
''';
  static const String breakfastDishe25 = '''
◾️ 4 أكواب (1000 مل) حليب.\n
◾️ 2 ملعقة كبيرة (25 جم) زبادي.\n
◾️ ترمومتر حراري.
''';
  static const String breakfastDishe26 = '''
◾️ كوب (200 جم) زبادي\n
◾️ كوب (200 جم) فاكهة مشكلة مقطعة مكعبات صغيرة (كيوي، ومانجو، وفراولة، وتفاح، وتوت)\n
◾️ ½ 1 كوب (300 جم) شوفان\n
◾️ ثمرة موز كبيرة مقشرة\n
◾️ ¼ كوب (50 جم) عسل أبيض\n
◾️ ملعقة صغيرة (5 مل) فانيليا سائلة\n
◾️ ملعقة صغيرة (5 مل) قرفة مطحونة\n
◾️ رشة ملح
''';
  static const String breakfastDishe27 = '''
◾️ كوب (200 جم) بلوبيف.\n
◾️ 6 بيضات.\n
◾️ بصلة صغيرة مفرومة ناعمًا.\n
◾️ 2 فص ثوم مهروس.\n
◾️ ملعقة كبيرة (15 مل) زيت.\n
◾️ ملعقة كبيرة (12.5 جم) زبدة، في درجة حرارة الغرفة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) البهارات السبعة.\n
◾️ ملح وفلفل أسود.
''';
  static const String breakfastDishe28 = '''
◾️ 6 بيضات كبيرة.\n
◾️ 2 ثمرة بطاطس متوسطة مقشرة، ومقطعة مكعبات.\n
◾️ بصلة صغيرة مقطعة مكعبات صغيرة.\n
◾️ ½ ثمرة فلفل أخضر رومي مقطعة مكعبات صغيرة.\n
◾️ ½ ثمرة فلفل أحمر رومي مقطعة مكعبات صغيرة.\n
◾️ 2 فص ثوم مهروس.\n
◾️ ¼ كوب (50 جم) بقدونس طازج مقطع.\n
◾️ ¼ كوب (60 مل) حليب.\n
◾️ 2 ملعقة كبيرة (30 مل) زيت.\n
◾️ ملعقة كبيرة (12.5 جم) زبد، في درجة حرارة الغرفة.\n
◾️ ½ ملعقة صغيرة (2.5 جم) كمون مطحون.\n
◾️ ¼ ملعقة صغيرة (1.25 جم) بابريكا.\n
◾️ ملح وفلفل أسود.
''';
  static const String breakfastDishe29 = '''
◾️ 4 بيضات كبيرة.\n
◾️ ¼ كوب (50 جم) شوفان.\n
◾️ ½ ثمرة فلفل أخضر رومي مقطع مكعبات.\n
◾️ بصلة صغيرة مقطعة مكعبات صغيرة.\n
◾️ 3 ملاعق كبيرة (45 مل) حليب.\n
◾️ ملعقة كبيرة (12.5 جم) زبدة، في درجة حرارة الغرفة.\n
◾️ ملعقة كبيرة (12.5 جم) بقدونس طازج مفروم.\n
◾️ ½ ملعقة صغيرة (2.5 جم) بابريكا.\n
◾️ ملح وفلفل أسود.
''';
  static const String breakfastDishe30 = '''
◾️ ثمرة موز كبيرة\n
◾️ بيضة كبيرة\n
◾️ ½ 1 كوب (300 جم) شوفان\n
◾️ ½ كوب (100 جم) زبادي\n
◾️ كوب (250 مل) حليب\n
◾️ 2 ملعقة كبيرة (25 جم) عسل\n
◾️ ملعقة صغيرة (5 جم) فانيليا سائلة\n
◾️ ملعقة صغيرة (5 جم) بيكنج باودر\n
◾️ ملعقة صغيرة (5 جم) قرفة مطحونة\n
◾️ ¼ ملعقة صغيرة (1.25 جم) ملح\n
◾️ فاكهة مشكلة (تفاح مقطع مكعبات، وفراولة مقطعة مكعبات، وتوت أحمر، وتوت أزرق، وتوت أسود، ومكسرات)
''';
}
